{
  "name": "Business Continuity and Disaster Recovery Plan",
  "slug": "business-continuity-plan",
  "body": "## Policy Statement\n\nThis policy establishes the guidelines and procedures to recover from a possible disaster. Disasters can be short or may last for a long time, but \u003cVar keyName=\"companyName\"/\u003e is ready for any adversity.\n\nBusiness continuity and disaster recovery activities are led by the Chief Information Security Officer under the coordination of the Chief Operations Officer.\n\n#### Scope\n\n1. **Critical** - production environments with applications that store or process protected or confidential data, tampering its confidentiality, invalidating its integrity, or affecting its availability (see [Data Classification](/policies/data-management/show?active=data-classification)).\n\n1. **Non-critical** - anything which is not marked as critical will receive a lower priority and be recovered only when business operations have been fully restored.\n\n### Objectives\n\nThe main objective of the disaster recovery program is to develop, test, and document a well-structured and easily understood plan which will help the company recover as quickly and effectively as possible from an unforeseen disaster or emergency which interrupts information systems and business operations. Additional objectives include the following:\n\n- Identify and assess the damage\n- Estimate the time required to resolve the incident\n- Assess the business impact\n- Assess if the Production environments and data are salvageable\n- Identify and assign tasks, and offer guidance to designated teams\n- Define communication channels and techniques with:\n  - Employees and staff\n  - Customers\n  - Media\n\n### Business Recovery Team (BRT)\n\n| Name                  | Function          | Email                 | Phone Number      | Alternate         |\n|-----------------------|-------------------|-----------------------|-------------------|-------------------|\n| **Firstname Lastname**| COO and Co-Founder| email@company.com     |                   | Firstname Lastname|\n| **Firstname Lastname**| CTO               | email@company.com     |                   | Firstname Lastname|\n\n#### Responsibilities\n\n1. **IT** managing the network/VPN infrastructure, servers, and IT Services. This team is led by the CTO/IT Manager;\n1. **DevOps** assuring cloud environments, applications, web services. This team is responsible for redeploying the services, perform data recovery and test that all systems are operational. This team is led by the CTO;\n1. **Security** responding to cybersecurity incidents. This team is led by the CISO;\n1. **Operations** coordinating the recovery plan and ensuring a fast response. This team is led by the COO;\nThese teams are in charge of the recovery plan and have been trained to manage such situations.\n\n## Procedures\n\n\u003cProcedure slug=\"bcp-status\"/\u003e\n\u003cProcedure slug=\"bcp-activation\"/\u003e\n\u003cProcedure slug=\"bcp-recovery\"/\u003e",
  "version": "1",
  "isStandard": false,
  "enabled": true,
  "procedures": [
    {
      "name": "Status",
      "slug": "bcp-status",
      "body": "\u003cVar keyName=\"companyName\"/\u003e uses a https://status.io page for the real-time status of each service. The status page is updated with details and root-cause analysis about the event that may cause service downtime (disaster or planned maintenance).\n\nDowntime durations: short (\u003c 30 minutes), moderate (\u003c 4 hours), long (\u003e 4 hours)",
      "controls": null
    },
    {
      "name": "Activation",
      "slug": "bcp-activation",
      "body": "Good practice says that business continuity and disaster recovery plans should be activated by top-level management. \u003cVar keyName=\"companyName\"/\u003e has appointed the COO as responsible for activating this procedure. If the event affecting the business is related to cybersecurity incidents, the recovery plan can also be activated by the CISO. Activation depends on the assessment results and projected downtime caused by the disaster:\n\n- will the applications and customer-facing systems be unavailable for more than 2 hours?\n- will the business be dysfunctional for more than 24 hours?",
      "controls": null
    },
    {
      "name": "Infrastructure and Data Recovery",
      "slug": "bcp-recovery",
      "body": "Production environment data must be stored across multiple Cloud Storage locations.",
      "controls": null
    }
  ]
}
