{"name":"Email and External Communications","slug":"communications-management","body":"## Policy Statement\n\n\u003cVar keyName=\"companyName\"/\u003e IT and communications systems are intended to promote effective communication and working practices within the organization. This policy outlines the standards you must observe when using these systems, the circumstances in which we may monitor your use, and the action we will take in respect of breaches of these standards.\n\nMisuse of IT and communications systems can damage \u003cVar keyName=\"companyName\"/\u003e's business and reputation. Breach of this policy by any employee may be treated as a disciplinary matter. Breach by a contractor or other third party is likely to lead to the termination of their engagement with \u003cVar keyName=\"companyName\"/\u003e, or financial compensations to be requested.\n\nThis policy does not form part of any employee's contract of employment or consultant's agreement and we may amend it at any time.\n\n#### Scope\n\nThis policy covers all employees, officers, consultants, contractors, volunteers, interns, casual workers, agency workers, and anyone who has access to \u003cVar keyName=\"companyName\"/\u003e IT and communication systems.\n\n## Procedures\n\n\u003cProcedure slug=\"comms-email\"/\u003e\n\u003cProcedure slug=\"comms-video\"/\u003e\n\u003cProcedure slug=\"comms-monitoring\"/\u003e\n\u003cProcedure slug=\"comms-prohibited\"/\u003e","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Email","slug":"comms-email","body":"Email (electronic mail) is a **vital business tool**, and it is pervasively used in almost all industry verticals and is often the primary communication and awareness method within an organization. At the same time, misuse of email can pose many legal, privacy, and security risks, thus it's important for users to understand the appropriate use of electronic communications.\n\n\u003e **Protected** data is never to be sent via email.\n\nAll \u003cVar keyName=\"companyName\"/\u003e's **Confidential** or **Internal** data contained within an email message or an attachment must be secured according to the [Data Protection Policy](/policies/data-protection/show).\n\n\u003cVar keyName=\"companyName\"/\u003e labels emails which are received from outside a list of approved (company-owned) email domains or servers. This allows \u003cVar keyName=\"companyName\"/\u003e to prevent phishing attacks and ensures that messages are not trusted by default.\n\nIn general, you should not:\n\n- send or forward private e-mails which you would not want a third party to read;\n- send or forward chain mail, junk mail, or gossip;\n- automatically forward \u003cVar keyName=\"companyName\"/\u003e emails to third party email systems or recipients;\n- contribute to system congestion by sending trivial messages or unnecessarily copying or forwarding e-mails to those who do not have a real need to receive them;\n- sell or advertise using \u003cVar keyName=\"companyName\"/\u003e communication systems or broadcast messages;\n- agree to terms, enter into contractual commitments or make representations by e-mail unless the appropriate authority has been obtained. A name typed at the end of an e-mail is a signature in the same way as a name written at the end of a letter;\n- download or e-mail text, music, and other content on the internet subject to copyright protection, unless it is clear that the owner of such works allows this;\n- send messages from another person's e-mail address (unless authorized) or under an assumed name;\n- send confidential messages via e-mail or the internet, or by other means of external communication which are known not to be secure.","controls":null},{"name":"Video Conferences and Meetings","slug":"comms-video","body":"**Supported video platforms:** at this time \u003cVar keyName=\"companyName\"/\u003e recommends the use of only two video conferencing platforms for business:\n\n- Microsoft Teams\n- Zoom (second option)\n\n#### Microsoft Teams\n\nMicrosoft Teams is a unified communication and collaboration platform that combines persistent workplace chat, video meetings, web conferences and events, file storage (including collaboration on files), and application integration. The service integrates with the company's [Office 365](https://en.wikipedia.org/wiki/Office_365) productivity suite and features extensions that can integrate with non-Microsoft products.\n\nMicrosoft Teams Glossary\n\n1. **Teams:** find channels to belong to or create your own. Inside channels you can hold on-the-spot meetings, have conversations, and share files;\n1. **Meetings:** see everything you've got lined up for the day or week. Or, schedule a meeting. This calendar syncs with your Outlook calendar;\n1. **Calls:** in some cases, if your organization has it set up, you can call anyone from Teams, even if they're not using Teams;\n1. **Activity:** catch up on all your unread messages, @mentions, replies, and more.\n\n#### Zoom\n\nZoom is a communication and collaboration platform that offers video meetings, web conferences, and webinars. The service integrates with many other products and services to enhance productivity and collaboration within teams.\n\n#### General recommendations and best practices\n\n- Password protect your meetings to prevent situations as Zoombombing;\n- Use the lobby feature and manually allow lobby members into the meetings;\n- Internet connection: typically, you need a minimum of 10mbps upload and download for a good quality video call;\n- Location: ensure suitable setup that is similar as much as possible to an office;\n- Background filters: not mandatory, but consider the use of a static background image. You can either use a built-in image from the library of the app or set a custom one that is company-approved. This will reduce distractions for others in the video chat, block out any unwanted cameos and protect the privacy of your home (office);\n- Headsets: though not always necessary these are recommended. Others at your location cannot hear what is being said to you, and having a mic closer to your mouth means it is less likely to pick up background noise;\n- Screen sharing: – it is recommended you only share the application window you need to show. If you need to share multiple\napplications it may be necessary to share your entire screen, in this case, make sure your desktop is appropriate, you may not want others to see what applications you have installed or the picture of your family on your desktop wallpaper;\n- Framing: position yourself in the center frame when in a chat and be aware of your movements it is easy to forget that the camera, unlike a person, cannot follow you if you move out of its field of view, or rotate on your chair.\n\n#### Recording Video Conferences\n\nThe recording of video conferences should only be used where there is a clear and justifiable business reason to do so, in most cases it is recommended you check with the Chief Privacy Officer before deciding to record a session. Additional points of note are:\n\n- Recorded sessions are covered by GDPR and \u003cVar keyName=\"companyName\"/\u003e Retention Policies, as well as taking up costly storage space;\n- You must have permission from everyone attending the session for them to be recorded and you must also specify the reason why you are recording the session. Preferably in writing (email is sufficient). Anyone objecting to being recorded should be asked to leave the session;\n- Before recording, you should plan what you are going to do with the recording afterward, where will it be stored, and for how long. Recordings must be deleted as soon as they are no longer needed.","controls":null},{"name":"Monitoring","slug":"comms-monitoring","body":"The contents of \u003cVar keyName=\"companyName\"/\u003e systems and company data are \u003cVar keyName=\"companyName\"/\u003e property. All materials, data, communications, and information, including but not limited to:\n\n- outgoing and incoming e-mail;\n- phone conversations and voicemail recordings;\n- instant messages and internet and social media postings and activities;\n- information created on, transmitted to, received or printed from, or stored or recorded on a device (collectively referred to as '*content*' in this policy) during business or on behalf of the company is \u003cVar keyName=\"companyName\"/\u003e property, regardless of who owns the device.\n\nWe reserve the right to monitor, intercept, review and erase, without further notice, all content on the device that has been created for or on behalf of \u003cVar keyName=\"companyName\"/\u003e. This might include, without limitation, the monitoring, interception, accessing, recording, disclosing, inspecting, reviewing, retrieving, and printing of transactions, messages, communications, postings, log-ins, recordings, and other uses of the device, whether or not the device is in your possession.\n\nPersonal data may be inadvertently monitored, intercepted, reviewed, or erased. Therefore employees should not expect privacy in any data on the company-owned device.\n\nYou are advised not to use \u003cVar keyName=\"companyName\"/\u003e systems for any matter intended to be kept private or confidential. Monitoring, intercepting, reviewing, or erasing of content will only be carried out to the extent permitted by law, for legitimate business purposes, including, without limitation, to:\n\n- prevent misuse of the device and protect company data;\n- ensure compliance with \u003cVar keyName=\"companyName\"/\u003e rules, standards of conduct, and policies in force from time to time (including this policy);\n- monitor performance at work;\n- ensure that staff members do not use \u003cVar keyName=\"companyName\"/\u003e facilities or systems for any unlawful purposes or activities that may damage \u003cVar keyName=\"companyName\"/\u003e business or reputation.\n\nWe may also store copies of any content for some time after they are created and may delete such copies from time to time without notice. We may obtain and disclose copies of such content or the entire device (including personal content) for litigation or investigations.\n\nWe will only monitor, intercept and review data where we have a reasonable suspicion that the company or individual may be or has been compromised. Each instance or request will be carefully considered and only with the agreement of the HR Director and the CEO will any of the above be actioned.","controls":null},{"name":"Prohibited use of systems","slug":"comms-prohibited","body":"Access is granted to the internet, smartphones, and other electronic systems for legitimate business purposes only. Incidental personal use is permissible provided it is in full compliance with \u003cVar keyName=\"companyName\"/\u003e rules, policies, and procedures (including this policy).\n\nMisuse or excessive personal use of e-mail system or inappropriate internet use will be dealt with under \u003cVar keyName=\"companyName\"/\u003e Disciplinary Procedure (in respect of employees), and/or may result in the termination of your engagement if you are a contractor. Misuse of the internet can in some circumstances be a criminal offense. In particular, misuse of the e-mail system or inappropriate use of the internet by participating in online gambling or chain letters or by creating, viewing, accessing, transmitting, or downloading any of the following material will usually amount to gross misconduct (or, in the case of consultants, will usually result in the termination of your engagement) (this list is not exhaustive):\n\n- pornographic material (that is, writing, pictures, films, and video clips of a sexually explicit or arousing nature);\n- offensive, obscene, criminal material, or material which is liable to cause embarrassment to us or \u003cVar keyName=\"companyName\"/\u003e clients;\n- a false and defamatory statement about any person or organization;\n- material which is discriminatory, offensive, derogatory or may cause embarrassment to others;\n- confidential information about \u003cVar keyName=\"companyName\"/\u003e or any of its employees or contractors, customers or clients (except as authorized in the proper performance of your duties or the services you provide);\n- any other statement which is likely to create any criminal or civil liability (for you or us);\n- material in breach of copyright.\n\nWhere evidence of misuse is found we may undertake a more detailed investigation, involving the examination and disclosure of monitoring records to those nominated to undertake the investigation and any witnesses or others involved in any procedure. If necessary, such information may be handed to the police in connection with a criminal investigation.","controls":null}]}