{"name":"Data Protection","slug":"data-protection","body":"## Policy Statement\n\nThis policy provides procedures and a set of principles regarding the processing and protection of data contained within \u003cVar keyName=\"companyName\"/\u003e's IT systems, regardless if they are cloud-based or on-premise. \u003cVar keyName=\"companyName\"/\u003e takes data confidentiality, integrity, and availability for employees and customers very seriously.\n\nAll Production environments (labeled accordingly) must follow the requirements laid out in this policy.\n\n#### Scope\n\nAll established and temporary employees who work under a contract of service, contractors, and consultants who work under a contract of service who have, or who may potentially have access to any person or customer data stored in Cloud Systems, IT Systems, or in manual records are mandatory to comply with this policy.\n\n## Procedures\n\n\u003cProcedure slug=\"data-principles-production\"/\u003e\n\u003cProcedure slug=\"data-processing\"/\u003e\n\u003cProcedure slug=\"data-encryption\"/\u003e\n\u003cProcedure slug=\"ssl-certificates\"/\u003e\n\u003cProcedure slug=\"data-protection-rest\"/\u003e\n\u003cProcedure slug=\"data-protection-transit\"/\u003e\n\u003cProcedure slug=\"data-protection-use\"/\u003e\n\u003cProcedure slug=\"data-access\"/\u003e\n\u003cProcedure slug=\"data-monitoring\"/\u003e\n\u003cProcedure slug=\"segregation-duties\"/\u003e\n\n","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Security Principles for Production Environments","slug":"data-principles-production","body":"- Production environments that store, process, and transmit personal data must have:\n  - malware detection installed and configured\n  - packages vulnerability scanning\n  - file integrity monitoring\n  - restricted access\n  - log access\n  - storage of data of the same classification in designated data repositories, in order to avoid mixing different classes of data","controls":null},{"name":"Obtaining and processing Personal Data","slug":"data-processing","body":"1. Personal Data shall be **obtained, processed, and stored** fairly and lawfully. \u003cVar keyName=\"companyName\"/\u003e will only collect personal information about employees and customers when that information is required for a legitimate business or legal reason. To process personal data in accordance with the Data Protection Act, GDPR, HIPAA, or CCPA, \u003cVar keyName=\"companyName\"/\u003e requires customers and employees to sign the Data Protection Consent Form.\n\n1. **Disclosure:** only permitted where the individual has provided their consent. No important decisions will be made concerning any individual using or referring to data that was collected for any other purpose.\n\n1. Personal data will only be **held for so long as it is necessary** to enable those specified and lawful purposes to be achieved.\n\n1. **Entitlement to information:** any individual about whom personal data is retained or is being processed is entitled to ask the Data Controller for the following information:\n\n     - the purpose for which this is being done;\n     - to whom such data may be disclosed;\n     - the source of such data and who will have access to any such data, in an intelligible form on request;\n     - how to have such data corrected or erased where appropriate.\n\nCustomers or employees may be asked to pay for each personal data request.\n\n1. **Transferring personal data:** personal data will only be transferred to a country outside the US or European Economic Area if that country's laws provide similar protection to the data subject. In this event, the data subject has also given their consent to the transfer of data.\n\n1. **Medical records:** for details of the right of access to any medical report prepared by a medical practitioner relating to employment the employee must either request details from the medical practitioner concerned or the HR department.\n\n1. **Notification:** every Data Controller must ensure that they have informed the Legal Counsel of the following details whenever they establish a new set of data or wish to utilize personal data in a manner that is not already notified:\n\n   - name and address of the Data Controller;\n   - description of personal data and the purposes to be held or used; the source from which the data is to be obtained;\n   - details of the persons to whom the data may be disclosed;\n   - the names of any countries outside the EU to which the data may be transferred.\n\n1. **Responsibility:** every Data Controller has to submit applications for notification to the Information Commissioner's Office as required by the Data Protection Act, GDPR, HIPAA, or CCPA.","controls":null},{"name":"Data Encryption","slug":"data-encryption","body":"#### Cryptographic Controls\n\nCryptographic controls must be utilized for sensitive information classified by \u003cVar keyName=\"companyName\"/\u003e as **Protected** or **Confidential** including, but not limited to: Personally Identifiable Information (PII), Protected Health Information (PHI), credit card numbers, passwords, intellectual property, budget or contract proposals, legal correspondence, and research and development information. All encryption mechanisms utilized by \u003cVar keyName=\"companyName\"/\u003e must be authorized by the appropriate authority.\n\nUsers must not attempt to utilize any form of cryptography, including, but not limited to, encryption, digital signatures, and digital certificates, which have not been approved and installed/implemented by \u003cVar keyName=\"companyName\"/\u003e designated representative (maybe an outside consultant). The use of all encryption mechanisms must meet relevant regulatory and legal requirements, including any import/export requirements and the use of cryptography in other countries.\n\n#### Key Management System (KMS)\n\nDepending on the Cloud Service Provider, \u003cVar keyName=\"companyName\"/\u003e uses a Key Management Service (KMS) to store and retrieve encryption keys for both manual and automatic use. Encryption keys must remain only in the environment which is using them. A key rotation mechanism must be implemented with a period that is not greater than 1 year. In special cases, such as the use of Kubernetes clusters or other purposes, \u003cVar keyName=\"companyName\"/\u003e can use a self-serviced Key Management System. A good example is *Vault* from HashiCorp.\n\n#### Network Encryption\n\nAll sensitive information classified by \u003cVar keyName=\"companyName\"/\u003e as **Confidential** must be encrypted when transmitted outside of \u003cVar keyName=\"companyName\"/\u003e. This includes the transmission of information via email or other communication channels. Remote management activities for \u003cVar keyName=\"companyName\"/\u003e, such as contractors accessing \u003cVar keyName=\"companyName\"/\u003e network remotely, must consistently employ session encryption. Procedures for using VPN to access corporate systems while teleworking are defined in the [Mobile Device Management Policy](/policies/mdm-device-management/show).\n\n#### Endpoint Hard Disk Encryption\n\nEncryption and key management of end-user endpoints and on-premise servers should use specific tools such as Bitlocker (Windows), VeraCrypt(Linux), and FileVault (Mac).","controls":[{"control":"aws-iam-4"},{"control":"aws-iam-12"},{"control":"aws-logging-7"},{"control":"aws-1-3-0-iam-19"},{"control":"aws-1-3-0-storage-1-1"},{"control":"aws-1-4-0-storage-1-2"},{"control":"aws-1-3-0-storage-2-1"},{"control":"gcp-iam-2"},{"control":"gcp-iam-5"},{"control":"gcp-kms-keys-rotated-90-days"},{"control":"gcp-iam-7"},{"control":"gcp-vm-2"},{"control":"gcp-vm-6"},{"control":"gcp-kms-cryptokeys-publicly-accessible"},{"control":"gcp-rsasha1-ksk-cloud-dns"},{"control":"gcp-rsasha1-zsk-cloud-dns"},{"control":"gcp-load-balancers-permit-ssl-weak-ciphers"},{"control":"gcp-shielded-vm-enabled"}]},{"name":"SSL Certificate Management","slug":"ssl-certificates","body":"There are several approaches for managing SSL Certificates that are used inside \u003cVar keyName=\"companyName\"/\u003e\n\n1. User Certificate Manager Systems provided by the Cloud Service Provider such as:\n   - Google-managed SSL Certificates for GCP\n   - AWS Certificate Manager (ACM)\n   - Azure Key Vault for managing certificates on Microsoft Azure\n1. Let's Encrypt service - for full self-managed SSL Certificates;\n1. Cloudflare SSL Certificates - in the case of resources being proxied through Cloudflare's infrastructure;\n1. Self-signed Root Certificate Authorities - self-managed certificate authority that can be used for internal purposes and services.\n\nSSL Certificates are renewed automatically and revoked when there is no longer a need for them. Cloudflare offers a service that can discover certificate issuance on the \u003cVar keyName=\"companyName\"/\u003e domain names.","controls":[{"control":"aws-1-3-0-iam-19"},{"control":"gcp-db-require-incoming-conn-ssl"},{"control":"gcp-kubernetes-12"},{"control":"gcp-load-balancers-permit-ssl-weak-ciphers"}]},{"name":"Data protection at rest","slug":"data-protection-rest","body":"*Data at rest* is data that is not actively moving from device to device or network to network such as data stored on a hard drive, laptop, flash drive, or archived/stored in some other way. Data protection at rest aims to secure inactive data stored on any device or network. While data at rest is sometimes considered to be less vulnerable than data in transit, attackers often find data at rest a more valuable target than data in motion.\n\nAll data repositories, databases, and file systems are encrypted with AES-256 and separate keys for each storage type, and the keys must be rotated periodically. For best practices, the rotation should happen annually.","controls":[{"control":"networking-ssh-from-internet"},{"control":"aws-iam-4"},{"control":"aws-iam-12"},{"control":"aws-logging-7"},{"control":"aws-networking-3"},{"control":"aws-1-3-0-iam-7"},{"control":"aws-1-3-0-iam-20"},{"control":"aws-1-3-0-storage-1-1"},{"control":"aws-1-3-0-storage-2-1"},{"control":"gcp-iam-2"},{"control":"gcp-iam-5"},{"control":"gcp-kms-keys-rotated-90-days"},{"control":"gcp-iam-7"},{"control":"gcp-networking-4"},{"control":"gcp-vm-2"},{"control":"gcp-vm-6"},{"control":"gcp-kms-cryptokeys-publicly-accessible"},{"control":"gcp-kms-keys-rotated-90-days"},{"control":"gcp-instances-no-default-service-account"},{"control":"gcp-shielded-vm-enabled"},{"control":"gcp-buckets-uniform-level-access"}]},{"name":"Data protection in transit","slug":"data-protection-transit","body":"*Data in transit*, or data in motion, is data actively moving from one location to another such as across the internet or through a private network. Data protection in transit is the protection of this data while it's traveling from network to network or being transferred from a local storage device to a cloud storage device – wherever data is moving, effective data protection measures for in-transit data are critical as data is often considered less secure while in motion.\n\nEncryption and authentication of data in transit are done using transmission protocols TLS \u003e= 1.2 and encryption methods such as AES \u003e= 256-bit.\n\n| Algorithm | Minimum key length  |\n|-----------|---------------------|\n| AES       | 256                 |\n| RSA       | 2048                |\n| ECDSA     | 256                 |\n| LDWM      | 256                 |","controls":[{"control":"aws-monitoring-11"},{"control":"aws-networking-12"},{"control":"aws-1-3-0-iam-19"},{"control":"aws-1-4-0-storage-1-2"},{"control":"aws-1-3-0-logging-10"},{"control":"aws-1-3-0-logging-11"},{"control":"aws-1-3-0-networking-1"},{"control":"aws-1-3-0-networking-2"},{"control":"gcp-logging-7"},{"control":"gcp-logging-8"},{"control":"gcp-logging-9"},{"control":"gcp-networking-1"},{"control":"gcp-networking-2"},{"control":"gcp-networking-5"},{"control":"gcp-networking-6"},{"control":"gcp-kubernetes-4"},{"control":"gcp-kubernetes-11"},{"control":"gcp-dnssec-enabled-cloud-dns"},{"control":"gcp-rsasha1-ksk-cloud-dns"},{"control":"gcp-rsasha1-zsk-cloud-dns"},{"control":"gcp-load-balancers-permit-ssl-weak-ciphers"},{"control":"gcp-1-1-0-vm-10"}]},{"name":"Data Access","slug":"data-access","body":"The default access to production environments is disabled by enforcing the principle of \"Zero Trust\" with access being permitted only by prior approval. When access is approved, temporary access is granted that allows access to production. The principle of \"Zero Trust\" is to never trust, always verify, and enforce the least-privilege approach to cybersecurity.","controls":[{"control":"networking-ssh-from-internet"},{"control":"aws-iam-4"},{"control":"aws-iam-12"},{"control":"aws-logging-3"},{"control":"aws-logging-6"},{"control":"aws-monitoring-11"},{"control":"aws-1-3-0-iam-11"},{"control":"aws-1-3-0-iam-13"},{"control":"aws-1-3-0-iam-16"},{"control":"aws-1-3-0-iam-18"},{"control":"aws-1-3-0-iam-20"},{"control":"aws-1-4-0-iam-20"},{"control":"aws-1-4-0-storage-1-2"},{"control":"aws-1-3-0-networking-1"},{"control":"aws-1-3-0-networking-2"},{"control":"gcp-networking-4"},{"control":"gcp-networking-5"},{"control":"gcp-vm-1"},{"control":"gcp-storage-1"},{"control":"gcp-kubernetes-16"},{"control":"gcp-kubernetes-17"},{"control":"gcp-kubernetes-18"},{"control":"gcp-1-1-0-iam-12"},{"control":"gcp-1-1-0-iam-13"},{"control":"gcp-1-1-0-iam-14"},{"control":"gcp-1-1-0-iam-15"},{"control":"gcp-instances-no-default-service-account"},{"control":"gcp-local-infile-db-flag-mysql"},{"control":"gcp-1-1-0-sql-2-6"}]},{"name":"Data Monitoring","slug":"data-monitoring","body":"Monitoring should be enabled for the entire cloud infrastructure and IT Systems. Notifications are sent if an alarm is triggered. Channels for notifications may include:\n\n  - instant messaging/chat (Slack, Teams, etc.);\n  - alerting systems (PagerDuty, ServiceNow, OpsGenie, etc.);\n  - emails or SMS.\n\nMonitoring can be performed by inspecting Cloud Audit Services or by installing a monitoring agent on the production environments. All major Cloud Service Providers (AWS, GCP, Azure, Oracle) offer out-of-the-box options to have monitoring and security agents preinstalled on computing resources. While they are scattered all across your multi-cloud environment, it is a good starting point to have a monitoring system in place.","controls":[{"control":"aws-monitoring-1"},{"control":"aws-monitoring-2"},{"control":"aws-monitoring-3"},{"control":"aws-monitoring-4"},{"control":"aws-monitoring-5"},{"control":"aws-monitoring-6"},{"control":"aws-monitoring-7"},{"control":"aws-monitoring-8"},{"control":"aws-monitoring-9"},{"control":"aws-monitoring-10"},{"control":"aws-monitoring-11"},{"control":"aws-monitoring-12"},{"control":"aws-monitoring-13"},{"control":"aws-monitoring-14"},{"control":"aws-1-3-0-monitoring-15"},{"control":"gcp-logging-1"},{"control":"gcp-logging-2"},{"control":"gcp-logging-3"},{"control":"gcp-logging-4"},{"control":"gcp-logging-5"},{"control":"gcp-logging-6"},{"control":"gcp-logging-7"},{"control":"gcp-logging-8"},{"control":"gcp-logging-9"},{"control":"gcp-logging-10"},{"control":"gcp-logging-11"}]},{"name":"Segregation of Duties","slug":"segregation-duties","body":"The roles and responsibilities of the development team should be clearly defined at the start of the project. Care should be taken to limit the exposure of the organization to fraudulent activity within the development process which may eventually lead to data breaches. Duties involving development, acceptance testing, and promotion of code to production should be separated so that they are performed by different people and at any time only one individual should have full rights to production environments storing *Protected Data*.","controls":[{"control":"aws-monitoring-7"},{"control":"aws-1-3-0-iam-7"},{"control":"gcp-iam-7"},{"control":"gcp-kubernetes-14"},{"control":"gcp-separation-of-duties-service-account"}]}]}