{"name":"Data Management","slug":"data-management","body":"## Policy Statement\n\nThis policy describes the requirements and implemented controls for managing Data.\n\nAny person who creates, uses, stores, or transmits \u003cVar keyName=\"companyName\"/\u003e Data, and called hereafter Data Owner, has the responsibility to maintain and safeguard such Data. The very first step is to determine the level of sensitivity applicable to such Data and classify it. This step is handled by the Data Owner.\n\nAccording to some regulations, such as the HIPAA Rules, covered entities _\"must securely back up retrievable exact copies of protected health information\"_ and must be able to fully _\"restore any loss of data\"_. Furthermore, additional security rules mandate that the backup should be frequent, encrypted, tested, and stored offsite.\n\nComplete backups of both \u003cVar keyName=\"companyName\"/\u003e and \u003cVar keyName=\"companyName\"/\u003e's customers' Protected and Confidential Data is performed daily and by respecting the `3-2-1 Backup Rule`: _\"keep at least three (3) copies of your data, and store two (2) backup copies on different storage media, with one (1) of them located offsite\"_.\n\n#### Scope\n\nThis policy applies to all Information Systems and Information Resources owned or operated by or on behalf of \u003cVar keyName=\"companyName\"/\u003e. It can be used for any data that are stored, processed, or transmitted by \u003cVar keyName=\"companyName\"/\u003e, including but not limited to:\n\n- Electronic data;\n- Data recorded on paper;\n- Information shared orally, visually, or by other means.\n\n## Procedures\n\n\u003cProcedure slug=\"data-lifecycle\"/\u003e\n\u003cProcedure slug=\"data-classification\"/\u003e\n\u003cProcedure slug=\"data-handling\"/\u003e\n\u003cProcedure slug=\"data-backup\"/\u003e\n\u003cProcedure slug=\"data-deletion\"/\u003e\n\u003cProcedure slug=\"data-wiping\"/\u003e","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Data Lifecycle Management","slug":"data-lifecycle","body":"\u003cVar keyName=\"companyName\"/\u003e is primarily a Cloud Computing company and the digital information it possesses from operations, internal infrastructure, and customers are hosted on Cloud Computing infrastructure and storage.\n\n\u003cVar keyName=\"companyName\"/\u003e uses different stages for :\n\n- Development\n- Testing\n- Production\n\nIn all stages, Digital Information (Data) will be stored, retrieved, archived, or deleted regularly, depending on the operations required to make use of it.\n\n\u003cVar keyName=\"companyName\"/\u003e operates under the principle of \"C, I, A – Confidentiality, Integrity, and Availability\" of the data, a principle that applies to all handled digital information as well.\n\nAll digital information and associated operations available for it are governed by the rules outlined in the Data Handling Procedure and at no time a single entity is granted full access and rights to it.\n\nFor all the following processes \u003cVar keyName=\"companyName\"/\u003e has implemented controls, guidelines, and worksheets to keep track of access times, categorize the collected digital information and log all performed actions.","controls":null},{"name":"Data Classification","slug":"data-classification","body":"This procedure is intended to help \u003cVar keyName=\"companyName\"/\u003e employees and 3rd Parties classify data to determine its need for protection, handling, and determining applicable policies and laws.\n\nDepending on the regulatory compliance Standards \u003cVar keyName=\"companyName\"/\u003e has to comply with, the following levels of data classification are defined:\n\n  - Protected Data\n  - Confidential Data\n  - Internal Data\n  - Public Data\n\n#### **Protected Data**\n\nProtected data refers to any information protected by federal, state, or local laws and regulations or industry standards, such as HIPAA, HITECH, GDPR, the New York State Information Security Breach and Notification Act, similar state laws, and PCI-DSS.\n\nUnauthorized disclosure of Protected data will cause major problems to business operations, generate a significant cost, damage the company's reputation, and can result in legal prosecution for \u003cVar keyName=\"companyName\"/\u003e.\n\nProtected data requires privacy and security protections. Special authorization is required for use and collection, and the disclosure of this class of data is prohibited without prior approval.\n\n_Characteristics of Protected Data_\n\n- Protected Data cannot be stored outside properly protected and labeled environments.\n- Protected Data must be encrypted at all times, both at rest and in transit.\n- CISO Approval: when a business need arises, the CISO must authorize all storing, processing, and transmitting of Protected Data.\n- Compliance Risk: Protection of information is mandated by law (HIPAA, GDPR, GLBA, CCPA) or required by private contract (PCI DSS).\n- Reputation Risk: Loss of confidentiality or integrity will cause significant damage to \u003cVar keyName=\"companyName\"/\u003e's reputation.\n- Other Risks: Loss of the confidentiality or integrity of the information that could cause harm to individuals and cause the company to incur significant costs in response.\n\n_Examples of Protected Data_\n\n- PII, such as Social Security Numbers (SSN) or last four numbers of an individual's SSN\n- Personal Data for an EU Citizen - governed under GDPR\n- PHI (Protected health information) or ePHI - governed under HIPAA/HITECH\n- CHD (Payment card cardholder data) - governed under PCI-DSS/PA-DSS\n- Credit/debit card numbers, bank account, financial information\n- Production Secrets, Passwords, and Encryption keys\n\n#### **Confidential Data**\n\nThis type of data is restricted information that is required to be maintained in a highly confidential manner as directed by \u003cVar keyName=\"companyName\"/\u003e's Privacy Officer, applicable law or regulation, contractual obligation, or subject to any applicable legal privilege or protection.\n\nUnauthorized disclosure of Confidential data will cause business operations problems and some financial loss.\n\n_Characteristics of Protected Data_\n\n- Access to Confidential Data is limited to \u003cVar keyName=\"companyName\"/\u003e employees and 3rd Parties operating under an executed non-disclosure agreement. This information should never be stored on a computing device or electronic storage media that is personally owned unless expressly permitted.\n- Protected Data must be encrypted at all times, both at rest and in transit.\n- Compliance Risk: Protection of data is mandated by law (e.g. FERPA) or required by private contract (e.g. non-disclosure agreements).\n- Reputation Risk: Loss of confidentiality or integrity will cause significant damage to \u003cVar keyName=\"companyName\"/\u003e's reputation. For example, loss of social security numbers or defacement of the \u003cVar keyName=\"companyName\"/\u003e website would likely be a news item that would appear in the media.\n- Other Risks: Loss of confidentiality that could cause harm to individuals such as \u003cVar keyName=\"companyName\"/\u003e personnel, and partners. Loss of confidentiality or integrity would cause \u003cVar keyName=\"companyName\"/\u003e to incur significant costs in response.\n- Treatment in Open Records Requests: Sensitive information is typically redacted from open records disclosures.\n\n_Examples of Confidential Data_\n\n- Business-critical intellectual property, proprietary data, and/or trade secrets, business plans\n- IP-rich Source Code, Business Application Source Code\n- HR records (e.g., background check reports, salary, DoB, employment records, etc.)\n- Non-public tax and accounting data\n- Non-production Secrets, Passwords, and Encryption keys\n- Network and infrastructure designs\n- Customer lists and contacts\n- Security, system, and application audit logs\n- Internal information security protocols, plans, and processes\n\n#### **Internal Data**\n\nAny information that is proprietary or produced only for internal use in \u003cVar keyName=\"companyName\"/\u003e.\n\nUnauthorized disclosure of Protected data may result in major disruption to business operations, significant cost, irreparable reputation damage, and/or legal prosecution for \u003cVar keyName=\"companyName\"/\u003e.\n\nProtected data requires privacy and security protections. Special authorization is required for use and collection, and the disclosure of this class of data is prohibited without prior approval.\n\n_Examples of Internal Data_\n\n- Application data that does not fall into Protected or Confidential levels\n- Product details and roadmaps, which will be made public at some point\n- Internal operating procedures and operational manuals, security policies and procedures\n- Internal memoranda, emails, reports, communications (e.g., Teams, Slack, Zoom), and other documents\n- IP addresses, system names, account names\n- Source code that is not business critical or contains little or no IP\n\n#### **Public Data**\n\nThis type of information can be disclosed without any restriction at any given time and by any \u003cVar keyName=\"companyName\"/\u003e employee or 3rd Party. This type of data has no legal restrictions on its access or use.\n\n_Examples of Public Data_\n\n- Any information made available on the company's website and subdomains such as `support, help, blog`, etc.\n- Financial statements and other reports filed for tax purposes and generally available to the public\n- Marketing information that is part of materials or posted on Social media","controls":null},{"name":"Data Handling","slug":"data-handling","body":"Information assets shall be handled according to their prescribed classification, including access controls, labeling, retention policies, and destruction methods, among others.\n\nIn general, controls assigned by Data Asset Owners will deal with the confidentiality category of the data. The categories representing Integrity and Availability will be used to guide \u003cVar keyName=\"companyName\"/\u003e to protect against the loss or corruption of the data.\n\n| Data            | Retention¹| Labeling | Non-prod storage | Encrypt (rest, transit) | Access Control²| Backup     |\n|-----------------|-----------|----------|------------------|-------------------------|----------------|------------|\n| **Protected**   | 5 yrs     | Yes      | No               | Yes, Yes                | Yes            | Required   |\n| **Confidential**| 3 yrs     | Yes      | Yes              | Yes, Yes                | Yes            | Required   |\n| **Internal**    | Optional  | Yes      | Yes              | No, Yes                 | No             | Optional   |\n| **Public**      | Optional  | Optional | Yes              | No, No                  | Now            | Optional   |\n\n¹There are situations when data retention may differ, depending on business needs and regulatory requirements.\n\n²The need-to-know requires that Data Assets should only be available to those who need to use or access the Data Asset to do their work.","controls":[{"control":"networking-ssh-from-internet"},{"control":"aws-1-3-0-storage-1-1"},{"control":"aws-1-4-0-storage-1-2"},{"control":"aws-1-3-0-storage-2-1"},{"control":"aws-1-3-0-networking-1"},{"control":"aws-1-3-0-networking-2"},{"control":"gcp-iam-5"},{"control":"gcp-iam-7"},{"control":"gcp-logging-3"},{"control":"gcp-networking-1"},{"control":"gcp-networking-4"},{"control":"gcp-separation-of-duties-service-account"},{"control":"gcp-rsasha1-ksk-cloud-dns"},{"control":"gcp-rsasha1-zsk-cloud-dns"},{"control":"gcp-buckets-uniform-level-access"}]},{"name":"Data Deletion","slug":"data-deletion","body":"There are times when digital information must be destroyed entirely for several reasons:\n\n- \u003cVar keyName=\"companyName\"/\u003e stores digital information for 3 years either in the original form or archived; After this period and if no further contractual obligations have to be met, data will be destroyed by deletion; As \u003cVar keyName=\"companyName\"/\u003e is using Cloud Storage, it initiates the procedure of deletion based on the instructions from the Cloud Provider and logs the operations for later reference;\n- If a customer is requesting deletion of data, this must be carried out by following GDPR, CCPA or HIPAA, and performed in a timely interval. \u003cVar keyName=\"companyName\"/\u003e will delete data requested by customers in 90 days from the request being formally sent;\n- Personal data was unlawfully processed;\n- Data is no longer relevant or provides no meaningful insights;\n- Data has expired in the lifecycle based on an agreement;\n- Regulatory compliance – where applicable;\n\nActive customers' data is preserved for as long as the customer is active. Unless otherwise stated or data belonging to inactive customers is not part of an investigation, the inactive account will have its data automatically removed within 30 days.\n\nFree or Trial customers that wish to voluntarily close their account should download their data manually or via the API before closing their account. After the trial period has expired, customers in this category will have their data deleted automatically from the systems within 7 days.","controls":null},{"name":"Data Wiping","slug":"data-wiping","body":"All company-owned devices are subject to a complete data wipe. In the event of the device being lost or stolen, the owner must inform the IT Team as soon as possible, giving details of the circumstances of the loss and the sensitivity of the business information stored on it. \u003cVar keyName=\"companyName\"/\u003e reserves the right to remote wipe the device where possible as a security precaution. This may involve the deletion of non-business data belonging to the device owner.","controls":null}]}