{"name":"GDPR - General Data Protection Regulation (EU)","slug":"gdpr","body":"## Statement\n\n\u003e **GDPR is a law.** As compared to other Standards that generally offer recommendations, GDPR is a set of controls and **requirements** companies ***MUST*** meet as covered entities.\n\nThe General Data Protection Regulation (GDPR) is the toughest privacy and security law in the world. Though it was drafted and passed by the European Union (EU), it imposes obligations onto organizations anywhere, so long as they target or collect data related to people in the EU. The regulation was put into effect on May 25, 2018. The GDPR will levy harsh fines against those who violate its privacy and security standards, with penalties reaching into the tens of millions of euros.\n\n**Data protection by design and by default** is the main principle that drives GDPR's controls and requirements.\n\n#### Scope\n\n- All EU organisations that collect, store or otherwise process the personal data of individuals residing in the EU, even if they're not EU citizens.\n- Organisations based outside the EU that offer goods or services to EU residents, monitor their behaviour, or process their personal data.\n\n#### Definitions\n\nThe GDPR defines an array of legal terms at length. Below are some of the most important ones that we refer to in this article:\n\n- **Personal data** — Personal data is any information that relates to an individual who can be directly or indirectly identified. Names and email addresses are obviously personal data. Location information, ethnicity, gender, biometric data, religious beliefs, web cookies, and political opinions can also be personal data. Pseudonymous data can also fall under the definition if it's relatively easy to ID someone from it.\n\n- **Data processing** — Any action performed on data, whether automated or manual. The examples cited in the text include collecting, recording, organizing, structuring, storing, using, erasing… so basically anything.\n\n- **Data subject** — The person whose data is processed. These are your customers or site visitors.\n\n- **Data controller** — The person who decides why and how personal data will be processed. If you're an owner or employee in your organization who handles data, this is you.\n\n- **Data processor** — A third party that processes personal data on behalf of a data controller. The GDPR has special rules for these individuals and organizations. They could include cloud servers like Tresorit or email service providers like ProtonMail.\n\n#### Personal Data\n\nPersonal data is any information relating to an identified or identifiable natural person (the *data subject*). The Regulation places much stronger controls on the processing of special categories of personal data (previously referred to as sensitive personal data) than the Irish Data Protection Act. The inclusion of genetic and biometric data is new to this category.\n\n- Personal data\n  - Name\n  - Address\n  - Email address\n  - Photo\n  - IP address\n  - Location data\n  - Online behaviour (cookies)\n  - Profiling and analytics data\n- Special category data\n  - Racial or ethnic origin\n  - Political opinions\n  - Religious and philosophical beliefs\n  - Trade union membership\n  - Genetic data\n  - Biometric data for the purpose of uniquely identifying a natural person\n  - Data concerning health\n  - Sex life and sexual orientation\n\n### Penalties\n\nThe GDPR states explicitly that some violations are more severe than others. Depending on several factors such as the gravity and nature, intention, the number of data subjects affected and data category, penalties are:\n\n- **Up to 10,000,000 EUR** - The less severe infringements could result in a fine of up to €10 million, or 2% of the firm's worldwide annual revenue from the preceding financial year, whichever amount is higher;\n\n- **Up to 20,000,000 EUR** - The more serious infringements go against the very principles of the right to privacy and the right to be forgotten that are at the heart of the GDPR. These types of infringements could result in a fine of up to €20 million, or 4% of the firm's worldwide annual revenue from the preceding financial year, whichever amount is higher.\n\n## Requirements\n\n\u003cProcedure slug=\"gdpr-governance\"/\u003e\n\u003cProcedure slug=\"gdpr-data-processing-principles\"/\u003e\n\u003cProcedure slug=\"gdpr-lawful-processing\"/\u003e\n\u003cProcedure slug=\"gdpr-rights\"/\u003e\n\u003cProcedure slug=\"gdpr-consent\"/\u003e\n\u003cProcedure slug=\"gdpr-data-protection-by-design-default\"/\u003e\n\u003cProcedure slug=\"gdpr-transparency\"/\u003e\n\u003cProcedure slug=\"gdpr-transfers-outside-eu\"/\u003e\n\u003cProcedure slug=\"gdpr-notification\"/\u003e\n\u003cProcedure slug=\"gdpr-dpos\"/\u003e","version":"1","isStandard":true,"enabled":true,"procedures":[{"name":"Accountability and governance","slug":"gdpr-governance","body":"You must be able to demonstrate compliance with the GDPR. This includes:\n\n- Establishing a governance structure with roles and responsibilities;\n- Keeping a detailed record of all data processing operations;\n- Documenting data protection policies and procedures;\n- Carrying out DPIAs (data protection impact assessments) for high-risk processing operations. Learn more about DPIAs;\n- Implementing appropriate measures to secure personal data;\n- Conducting staff awareness training;\n- Where required, appointing a data protection officer.","controls":[{"control":"aws-1-3-0-iam-7"},{"control":"aws-logging-1"},{"control":"aws-logging-3"},{"control":"aws-logging-4"},{"control":"aws-logging-5"},{"control":"aws-logging-6"},{"control":"aws-logging-7"},{"control":"aws-logging-8"},{"control":"aws-logging-9"},{"control":"aws-1-3-0-logging-10"},{"control":"aws-1-3-0-logging-11"},{"control":"aws-monitoring-1"},{"control":"aws-monitoring-2"},{"control":"aws-monitoring-3"},{"control":"aws-monitoring-4"},{"control":"aws-monitoring-5"},{"control":"aws-monitoring-6"},{"control":"aws-monitoring-7"},{"control":"aws-monitoring-8"},{"control":"aws-monitoring-9"},{"control":"aws-monitoring-10"},{"control":"aws-monitoring-11"},{"control":"aws-monitoring-12"},{"control":"aws-monitoring-13"},{"control":"aws-monitoring-14"},{"control":"aws-1-3-0-monitoring-15"}]},{"name":"The six data processing principles","slug":"gdpr-data-processing-principles","body":"The GDPR lists six data processing principles that data controllers must comply with. Personal data must be:\n\n1. Processed lawfully, fairly and transparently;\n1. Collected only for specific legitimate purposes;\n1. Adequate, relevant and limited to what is necessary;\n1. Accurate and, where necessary, kept up to date;\n1. Stored only as long as is necessary;\n1. Processed in a manner that ensures appropriate security.","controls":null},{"name":"Lawful processing","slug":"gdpr-lawful-processing","body":"In order to process personal data you must have a lawful basis to do so. The lawful grounds for processing personal data are set out in Article 6 of the GDPR. These are:\n\n- The consent of the individual;\nPerformance of a contract;\nCompliance with a legal obligation;\nNecessary to protect the vital interests of a person;\nNecessary for the performance of a task carried out in the public interest; or\nIn the legitimate interests of company/organisation (except where those interests are overridden by the interests or rights and freedoms of the data subject).","controls":[{"control":"networking-ssh-from-internet"},{"control":"aws-1-3-0-iam-7"},{"control":"aws-iam-17"},{"control":"aws-logging-7"},{"control":"azure-1-3-0-database-1-1"},{"control":"azure-1-3-0-database-1-2"},{"control":"azure-1-3-0-security-1"},{"control":"azure-1-3-0-storage-1"},{"control":"azure-1-3-0-networking-5"},{"control":"aws-1-3-0-iam-1"},{"control":"aws-1-3-0-iam-2"},{"control":"aws-1-3-0-iam-3"}]},{"name":"Data subjects' rights","slug":"gdpr-rights","body":"Data subjects have:\n\n- The right to be informed;\n- The right of access;\n- The right to rectification;\n- The right to erasure;\n- The right to restrict processing;\n- The right to data portability;\n- The right to object; and\n- Rights concerning automated decision-making and profiling.","controls":null},{"name":"Valid consent","slug":"gdpr-consent","body":"There are strict new rules about what constitutes consent from a data subject to process their information:\n\n- Consent must be \"freely given, specific, informed and unambiguous.\";\n- Requests for consent must be \"clearly distinguishable from the other matters\" and presented in \"clear and plain language.\";\n- Data subjects can withdraw previously given consent whenever they want, and you have to honor their decision. You can't simply change the legal basis of the processing to one of the other justifications;\n- Children under 13 can only give consent with permission from their parent;\n- You need to keep documentary evidence of consent.","controls":null},{"name":"Data protection by design and by default","slug":"gdpr-data-protection-by-design-default","body":"The GDPR provides for two crucial concepts for future project planning: ***Data Protection By Design*** and ***Data Protection By Default***. This means you must consider the data protection principles in the design of any new product or activity at an early stage. The GDPR covers this principle in Article 25.\n\n**Data Protection by design** means embedding data privacy features and data privacy enhancing technologies directly into the design of projects at an early stage. This will help to ensure better and more cost-effective protection for individual data privacy.\n\n**Data Protection by default** means that the user service settings (e.g. no automatic opt-ins on customer account pages) must be automatically data protection friendly, and that only data which is necessary for each specific purpose of the processing should be gathered at all.","controls":[{"control":"aws-1-3-0-iam-7"},{"control":"aws-iam-2"},{"control":"aws-1-4-0-iam-12"},{"control":"aws-iam-4"},{"control":"aws-iam-5"},{"control":"aws-iam-6"},{"control":"aws-iam-7"},{"control":"aws-iam-8"},{"control":"aws-iam-9"},{"control":"aws-iam-10"},{"control":"aws-iam-11"},{"control":"aws-iam-12"},{"control":"aws-iam-13"},{"control":"aws-iam-14"},{"control":"aws-iam-15"},{"control":"aws-iam-16"},{"control":"aws-logging-2"},{"control":"aws-logging-7"},{"control":"aws-logging-8"},{"control":"aws-monitoring-2"},{"control":"aws-1-3-0-iam-11"},{"control":"aws-1-3-0-iam-13"},{"control":"aws-1-3-0-iam-15"},{"control":"aws-1-3-0-iam-16"},{"control":"aws-1-3-0-iam-20"},{"control":"aws-1-4-0-iam-20"},{"control":"aws-1-3-0-storage-1-1"},{"control":"aws-1-4-0-storage-1-2"},{"control":"aws-1-3-0-storage-2-1"},{"control":"aws-1-3-0-logging-10"},{"control":"aws-1-3-0-logging-11"},{"control":"azure-1-3-0-database-4"},{"control":"azure-1-3-0-security-1"},{"control":"azure-1-3-0-security-2"}]},{"name":"Transparency and privacy notices","slug":"gdpr-transparency","body":"Organisations must be clear about how, why and by whom personal data will be processed.\n\n- When personal data is collected directly from data subjects, data controllers must provide a privacy notice at the time of collection;\n- When personal data is not obtained directly from data subjects, data controllers must provide a privacy notice without undue delay, and within a month. This must be done the first time they communicate with the data subject;\n- For all processing activities, data controllers must decide how the data subjects will be informed, and design privacy notices accordingly. Notices can be issued in stages;\n- Privacy notices must be provided to data subjects in a concise, transparent and easily accessible form, using clear and plain language.","controls":null},{"name":"Data transfers outside the EU","slug":"gdpr-transfers-outside-eu","body":"Many non-EU organisations that process EU residents' personal data also need to appoint an EU representative following the end of the transition period.\n\n- Where the EU has designated a country as providing an adequate level of data protection;\n- Through standard contractual clauses or binding corporate rules;\n- By complying with an approved certification mechanism.","controls":[{"control":"networking-ssh-from-internet"},{"control":"aws-networking-2"},{"control":"aws-networking-3"},{"control":"aws-1-3-0-networking-1"},{"control":"aws-1-3-0-networking-2"},{"control":"azure-1-3-0-networking-1"}]},{"name":"Mandatory data breach notification","slug":"gdpr-notification","body":"The GDPR defines a personal data breach as \"a breach of security leading to the accidental or unlawful destruction, loss, alteration, unauthorised disclosure of, or access to, personal data transmitted, stored or otherwise processed\".\n\n- Data processors are required to report all breaches of personal data to data controllers;\n- Data controllers are required to report breaches to the supervisory authority (the Data Protection Commission (DPC) in Ireland) within 72 hours of becoming aware of them if there is a risk to data subjects' rights and freedoms;\n- Data subjects themselves must be notified without undue delay if there is a high risk to their rights and freedoms.","controls":null},{"name":"DPOs (data protection officers)","slug":"gdpr-dpos","body":"Many companies use third parties, like email or cloud storage services, to handle their data. While this can be helpful in adhering to the GDPR if the third party has a higher technological capacity, it does not absolve the hiring organization (i.e. the controller) from ensuring that personal data is processed in accordance with the GDPR. Unless the controller can clearly demonstrate that it was \"not in any way responsible for the event giving rise to the damage,\" it will be fully liable for any infringement caused by a non-compliant third party.\n\nAppointing a DPO is mandatory for:\n\n- Public authorities;\n- Organisations involved in high-risk processing;\n- Organisations processing special categories of data.\n\nA DPO has set tasks:\n\n- Inform and advise the organisation of its obligations;\n- Monitor compliance, including awareness-raising, staff training and audits;\n- Cooperate with data protection authorities and act as a contact point.","controls":[{"control":"aws-logging-5"}]}]}