{"name":"Information Security Program","slug":"information-security-program","body":"## Policy Statement\n\n\u003cVar keyName=\"companyName\"/\u003e promotes a `Security-First` culture. This is done through proper Policies and Procedures, [Training and Awareness Programs](/policies/security-training-awareness/show), Technical documentation, and [Systems Audit](/policies/systems-audit/show).\n\nThis document establishes the Information Security Program Policy for \u003cVar keyName=\"companyName\"/\u003e. It helps \u003cVar keyName=\"companyName\"/\u003e address future changes in the information security landscape, including new or amended regulations, and to minimize the risk of damage by preventing security incidents and reducing their potential impact. For the information security policies to provide value they must be approved by management and adopted throughout the organization.\n\n\u003cVar keyName=\"companyName\"/\u003e's Information Security Program covers:\n\n1. Assist in compliance with regulatory requirements such as GDPR, SOC 2, HIPAA, ISO 27001, etc.;\n1. Inventory and protection of all IT assets;\n1. Ensure that appropriate measures are taken to protect the confidentiality, integrity, and availability of information entrusted to the organization by its customers, business partners, and stakeholders;\n1. Protection of data-at-rest and data-in-transit;\n1. Provide management with assurance that the organization is doing what it should concerning information security;\n1. Centralized identity and access management;\n1. Ensure Secure Software Development Lifecycle;\n1. Plan for business continuity, disaster recovery, and emergency response.\n\n#### Purpose\n\nThe \u003cVar keyName=\"companyName\"/\u003e Information Security Program is developed on the principle that security is everyone's responsibility and that rewarding positive behavior reinforces and encourages repeating it.\n\n#### Scope\n\nThis policy applies to all Information Systems and Information Resources owned or operated by or on behalf of \u003cVar keyName=\"companyName\"/\u003e. All \u003cVar keyName=\"companyName\"/\u003e related Persons with access to Information or computers and systems operated or maintained on behalf of \u003cVar keyName=\"companyName\"/\u003e are responsible for adhering to this policy,  including full-time and part-time employees, contractors, interns, and other 3rd Parties.\n\n## Procedures\n\n\u003cProcedure slug=\"security-program-concepts\"/\u003e\n\u003cProcedure slug=\"security-program-assessment\"/\u003e\n\u003cProcedure slug=\"security-program-review\"/\u003e\n\u003cProcedure slug=\"security-program-authorities\"/\u003e\n","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Organizational Concepts","slug":"security-program-concepts","body":"\u003cVar keyName=\"companyName\"/\u003e makes use of cloud services and infrastructure. The network components and supporting network infrastructure are contained within the cloud service provider's infrastructures and managed by the provider. \u003cVar keyName=\"companyName\"/\u003e does not have physical access to the network components.\n\nWithin the \u003cVar keyName=\"companyName\"/\u003e platform and supporting services all data storage and transmission is encrypted. \u003cVar keyName=\"companyName\"/\u003e assumes data may contain ePHI, PHI, or PII and provides appropriate protections based on that assumption.\n\n\u003cVar keyName=\"companyName\"/\u003e has implemented access controls and only authorized personnel is given access to the Productions environments. The database servers and/or data repositories, where the ePHI, PHI, or PII resides, can only be accessed through a secure connection. For more info, please read the [Identity and Access Management Policy](/policies/identity-access-management/show).","controls":null},{"name":"Risk Assessments","slug":"security-program-assessment","body":"Risk assessments are conducted at least annually to identify existing and potential safeguards to mitigate foreseeable risks to covered assets. Risk assessments are used to inform the selection and implementation of safeguards. Identified risks without mitigating or compensating safeguards are documented and tracked in a central risk registry according to the [Risk Management Policy](/policies/risk-management/show).","controls":null},{"name":"Frequency of Policy Review","slug":"security-program-review","body":"In the \u003cVar keyName=\"companyName\"/\u003e Information Security Program, policies, procedures, and controls are reviewed regularly. This should happen at least annually or when a significant event causes the need for a policy change.\n\nIt is the responsibility of the Chief Information Security Officer and the Chief Privacy Officer to maintain this policy and ensure the contents of the policy are continually monitored and enforced.","controls":null},{"name":"Contact with Authorities","slug":"security-program-authorities","body":"Appropriate contact with relevant authorities must be maintained. Remember when adapting this control to think about the legal responsibilities for communicating with authorities such as the Police, the Information Commissioner's Office, or other regulatory bodies e g. around GDPR. Consider how that contact is to be made, by whom, under what circumstances, and the nature of the information to be provided.","controls":null}]}