{"name":"Device Management (MDM)","slug":"mdm-device-management","body":"## Policy Statement\n\nMobile computing is an increasing part of everyday life. As devices become smaller and more powerful the number of tasks that can be achieved away from the office grows. However, as the capabilities increase so do the risks. Security controls that have evolved to protect the static desktop environment are easily bypassed when using a mobile device outside of the confines of an office building. Disposal of sensitive data shall be carried out under federal and state law.\n\n#### Purpose\n\nTo set out the controls that must be in place when using mobile devices or removable media. It is intended to mitigate the following risks:\n\n- **Protected** data being stored on Mobile Devices;\n- Loss or theft of a mobile device, including the data on it, especially if it contains **Confidential** Data;\n- Compromise of classified information through observation by the public;\n- Introduction of viruses and malware to the network and cloud environment.\n\n#### Scope\n\nAll devices, systems, people, and processes that constitute \u003cVar keyName=\"companyName\"/\u003e's information systems.\n\nMobile devices include items such as:\n\n- Laptops\n- Notebooks\n- Tablets\n- Smartphones\n- Smart Watches\n\n## Procedures\n\n\u003cProcedure slug=\"mdm-byod\"/\u003e\n\u003cProcedure slug=\"mdm-external-media\"/\u003e\n\u003cProcedure slug=\"mdm-transmission\"/\u003e\n\u003cProcedure slug=\"mdm-disposal\"/\u003e\n","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Bring Your Own Device (BYOD)","slug":"mdm-byod","body":"In most cases, \u003cVar keyName=\"companyName\"/\u003e ensures that employees receive laptops/notebooks when they join. However, there are cases when personal or other devices can be used for business functions. This is commonly referred to as *\"Bring Your Own Device\"* (BYOD). In some cases, this can provide increased flexibility and remove the need for the employee to carry more than one device regularly. This results in the need for such devices to be subject to additional controls over and above those typically in place for a consumer device.\n\nCommon issues and security challenges with BYOD may include:\n\n- Use of the device by other family members or friends\n- Default storage of data in cloud backup facilities\n- Increased exposure to potential loss in social situations (e.g. on the beach, in a bar)\n- Potential access to websites that do not meet \u003cVar keyName=\"companyName\"/\u003e's Acceptable Use Policy\n- Connection to insecure networks (e.g. unsecured wireless hotspots)\n- Anti-virus protection and how often the device is patched\n- Installation of potentially malicious apps onto the device (often without the user being aware that they are malicious)\n\nRequirements for the use of personal devices that store \u003cVar keyName=\"companyName\"/\u003e data which is classified as **Confidential** or **Internal**:\n\n\u003e - All Bring Your Own Devices (BYOD) must be managed by \u003cVar keyName=\"companyName\"/\u003e using Mobile Device Management (MDM) solutions;\n\u003e - All Mobile Devices, removable media, and other mobile storage devices are to be added to \u003cVar keyName=\"companyName\"/\u003e's asset inventory according to the [Asset Management Policy](/policies/asset-management/show);\n\u003e - Owner/Manager must provide a reason for requesting a personal device to be used for business functions;\n\u003e - Company-owned devices and Bring Your Own Devices (BYOD) are encrypted;\n\u003e - As data is mainly stored in cloud-based systems, a regular backup of the phone is preferred, but not mandatory;\n\u003e - Rooted (Android) or Jailbroken (Apple iOS) devices are strictly forbidden from being enrolled as a BYOD;\n\u003e - Strong password/passcode must be enforced by the MDM software based on the [Password Management Policy](/policies/password-management/show);\n\u003e - Devices are kept up to date as part of the mobile device management controls;\n\u003e - Only pre-approved application stores are allowed (public such as Apple AppStore, Google App Store, or company-managed app store)\n- \u003cVar keyName=\"companyName\"/\u003e reserves the right to take appropriate disciplinary action up to and including termination for non-compliance with this policy.\n\nThe device may be disconnected, remotely locked, or wiped (company-owned data only). This is done only with the approval of both the CISO and the device owner, and after confirmation of one of the following events:\n\n  1. the device is lost (device owner must report this as soon as possible but not later than 24 hours)\n  1. the employee terminates his or her employment\n  1. IT/Security Team detects a data or policy breach, a virus, or similar threat to the security of \u003cVar keyName=\"companyName\"/\u003e's data and IT/Cloud infrastructure","controls":null},{"name":"External Media and Storage Devices","slug":"mdm-external-media","body":"#### Devices\n\n- USB Flash and External Drives;\n- Optical disks (CD, DVD);\n- SD Cards (secure digital cards);\n- Tapes (infrequently used);\n- Floppy disks (infrequently used).\n\n#### Roles and Responsibilities\n\n1. Sender – responsible for ensuring, among others, the following requirements:\n\n    - Assessing the information to be sent;\n    - Ensuring that the identity and authorization of the recipient has been formally confirmed and documented;\n    - Obtaining the consent of the Manager (if applicable) for the transfer;\n    - Ensuring that the information is sent and tracked properly in compliance with the policy.\n\n1. IS Auditor – will monitor and audit departments to ensure compliance with all statutory and regulatory obligations but also internal policies.\n\n1. Managers – responsible for ensuring that this Policy is communicated and implemented within their area of responsibility.\n\n1. Employees – responsible for knowing this Policy and ensuring that any information transfer for which they are responsible is done right. They must report any suspected or actual security breaches related to data transfer to their Managers.\n\n1. Contractor or 3rd Party – responsible for knowing this Policy and ensuring that any information transfer for which they are responsible is done right. They must report any suspected or actual security breaches related to data transfer to their contact within \u003cVar keyName=\"companyName\"/\u003e.","controls":null},{"name":"Transmission Process","slug":"mdm-transmission","body":"**Protected** data, as defined in the [Data Management Policy](/policies/data-management/show), cannot be stored outside \u003cVar keyName=\"companyName\"/\u003e's systems or cloud infrastructure.\n\nThe other types of data can be transferred on external storage devices only by following these requirements:\n\n- **Confidential** and **Internal** data will only be transferred to external parties if the owner of the data explicitly approves its transfer. For GDPR and most compliant-related data, the owner is the creator of the data;\n- For all transfers of personal information, the owner of the sensitive information must provide his/her consent;\n- Data must be encrypted during transfer. Best practices include a standard of AES 256-bit encryption, although other levels may be appropriate. Most of the time, this can be achieved using encrypted ZIP files;\n- The key or password to the encrypted data must be transferred out of bounds; that is, it cannot be transferred using the same mechanism as the data. For instance, if the data is sent via e-mail, the key must be exchanged via phone or SMS;\n-  The Sender has the responsibility to assess risks in what they are intending to do and ensure that all associated risks are adequately understood and covered, and that the transfer is properly authorized;\n- \u003cVar keyName=\"companyName\"/\u003e staff shall not assume that because someone asks for information they are authorized or legally entitled to have it. If in doubt, staff shall check with their Manager;\n- For all transfers of personal information, the identity and authorization of the recipient must be appropriately authenticated by the sender;\n- Any unauthorized release of confidential information can leave \u003cVar keyName=\"companyName\"/\u003e staff open to legal sanction or litigation;\n- Personal e-mail accounts (e.g. Gmail, Yahoo, Hotmail accounts) must not be used for transferring **Confidential** and **Internal** Data;\n- Any removable devices used for information transfer should be scanned for viruses and malware.\n\n**Approved Communication and Transmission Channels:**\n\n- E-mail transfers and communications – Outlook/Exchange Online service;\n- Transfers of data on removable media (USB, CD, DVD, HDD, etc.);\n- Remote Desktop Access Software (WebEx, TeamViewer, etc.);\n- Virtual Private Networks (contractors, customers);\n- Instant Messaging or SMS Systems (Teams, Zoom, Google Meet, Skype);\n- Postal / Courier services;\n- Faxes and eFax.","controls":null},{"name":"Media Disposal","slug":"mdm-disposal","body":"Due to technological advancements, simple deletion or formatting does not provide enough protection of **Protected** and **Confidential** data. Deleted files usually will remain on the media for long periods, and many software tools are now available to recover such data. Many state and federal regulations may also require the removal of information from electronic media to be made securely.\n\n\u003e **Warning:** Once destroyed in the manner described below, files cannot be recovered. \u003cVar keyName=\"companyName\"/\u003e is not responsible for unwanted effects the use of this procedure or software may cause. Do not use the methods described below unless you are certain the data will no longer be needed.\n\n#### Disposal Methods\n\n1. **Overwriting:** as the name implies, overwriting uses a program to write (1s, 0s, or a combination of both) onto the location of the media where the file to be sanitized is located. The number of times the media is overwritten depends on the level of sensitive information. Overwriting can be done for single files/folders, or it can be performed on entire disks or media devices.\n\n1. **Degaussing:** magnetically erase data from magnetic media. Two types of degaussing exist, strong magnets and electric degauss. Note that common magnets (e.g., those used to hang a picture on a wall) are fairly weak and cannot effectively degauss magnetic media.\n\n1. **Destruction (physical):** destruction can be as simple as unraveling and cutting up disks, or putting entire drives through a shredder. It is usually a much quicker process than overwriting data, and when done properly just as effective.\n\n1. **Hiring a 3rd Party:** due to the time investment required to process the media, it may be advantageous to hire a 3rd Party record management and destruction company to perform the media wipe. If that's the case, the vendor must provide:\n\n    - a written statement explaining the procedure;\n    - include a time estimate in which the media will be stored awaiting processing;\n    - a statement assuming responsibility for the confidentiality of the data while under their possession.","controls":null}]}