{"name":"Password Management","slug":"password-management","body":"## Policy Statement\n\n\u003cVar keyName=\"companyName\"/\u003e identified that a solid password policy is perhaps the most important security control an organization can employ. Since the responsibility for choosing good passwords falls on the users, a detailed and easy-to-understand policy is essential.\n\nBy default, failed login attempts to systems/applications should be monitored and accounts should automatically be locked and require password change after 5 failed attempts.\n\n#### Purpose\n\nThe purpose of this policy is to specify guidelines for use of passwords. Most importantly, this policy will help users understand why strong passwords are a necessity and help them create passwords that are both secure and useable. Lastly, this policy will educate users on the secure use of passwords.\n\n#### Scope\n\nThis policy applies to any person who is provided an account on the organization's network or systems, including employees, guests, contractors, partners, vendors, etc.\n\n## Procedures\n\n\u003cProcedure slug=\"password-construction\"/\u003e\n\u003cProcedure slug=\"password-confidentiality\"/\u003e\n\u003cProcedure slug=\"password-change\"/\u003e\n\u003cProcedure slug=\"password-incident\"/\u003e\n\u003cProcedure slug=\"password-storage-transmission\"/\u003e\n\u003cProcedure slug=\"password-app-development\"/\u003e\n","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Password Construction","slug":"password-construction","body":"- Passwords should be at least 10 characters long;\n- A password history is enforced. Meaning a user cannot use the last 24 passwords they have set in the past;\n- Passwords should be comprised of a mix of letters, numbers, and special characters (punctuation marks and symbols);\n- Passwords should be comprised of a mix of upper and lower case characters;\n- Passwords should not be comprised of, or otherwise utilize, words that can be found in a dictionary;\n- Passwords should not be comprised of an obvious keyboard sequence (i.e., qwerty);\n- Passwords should not include \"guessable\" data such as personal information about yourself, your spouse, your pet, your children, birthdays, addresses, phone numbers, locations, etc.","controls":[{"control":"aws-iam-2"},{"control":"aws-iam-5"},{"control":"aws-iam-6"},{"control":"aws-iam-7"},{"control":"aws-iam-8"},{"control":"aws-iam-9"},{"control":"aws-iam-10"},{"control":"aws-iam-11"}]},{"name":"Password Confidentiality","slug":"password-confidentiality","body":"- Users must not disclose their passwords to anyone\n- Users must not share their passwords with others (co-workers, supervisors, family, etc.)\n- Users must not write down their passwords and leave them unsecured\n- Users must not check the \"save password\" box when authenticating to applications\n- Users must not use the same password for different systems and/or accounts\n- Users must not send passwords via email\n- Users must not re-use passwords on more than one system/application","controls":null},{"name":"Password Change Frequency","slug":"password-change","body":"To maintain good security, passwords should be periodically changed. This limits the damage an attacker can do as well as helps frustrate brute force attempts. At a minimum, users must change passwords every 90 days. The organization may use software that enforces this policy by expiring users' passwords after this period. \u003cVar keyName=\"companyName\"/\u003e uses an IdP solution for enforcing password change. Once a password has been changed it cannot be changed again for 15 days.\n\nPasswords are made inactive or changed to a strong random one when the employee is leaving \u003cVar keyName=\"companyName\"/\u003e.","controls":[{"control":"aws-iam-4"},{"control":"aws-iam-10"},{"control":"aws-iam-11"},{"control":"gcp-iam-5"},{"control":"gcp-1-1-0-iam-10"}]},{"name":"Password Incident Reporting","slug":"password-incident","body":"Since the compromise of a single password can have a catastrophic impact on \u003cVar keyName=\"companyName\"/\u003e's security, it is the user's responsibility to immediately report any suspicious activity involving his or her passwords to the Security Team. Any request for passwords over the phone or email, whether the request came from organization personnel or not, should be expediently reported. When a password is suspected to have been compromised, the Security Team will request that the user, or users, change all his or her passwords.","controls":null},{"name":"Password Storage and Transmission","slug":"password-storage-transmission","body":"- Passwords must be stored and transmitted securely;\n- Default system or application passwords must be changed for Production environments;\n- Password can be stored in a Password Management solution;\n- The password manager encrypts the password with a master password and an encryption key.","controls":null},{"name":"Passwords in Application Development","slug":"password-app-development","body":"Application developers must ensure their programs contain the following security precautions:\n\n- Applications must support authentication of individual users, not groups;\n- Applications must not have hardcoded, backdoors, persisted password, or access;\n- Applications must provide role management, such that one user can take over the functions of another without having to know the other's password;\n- Applications must ensure access to **Protected** data only to entities that have the right access, the right password, and also have MFA enabled.","controls":null}]}