{"name":"PCI-DSS - PCI Security Standards Council - Payment Card Industry Data Security Standard","slug":"pci-dss","body":"## Statement\n\nThe Payment Card Industry Data Security Standard (PCI DSS) is a set of requirements intended to ensure that all companies that process, store, or transmit credit card information maintain a secure environment. It was launched on September 7, 2006, to manage PCI security standards and improve account security throughout the transaction process. \n\nThe PCI Standards Council (SSC) is responsible for the development of the standards for PCI compliance. It is an independent body created by Visa, MasterCard, American Express, Discover, and JCB. \n\n#### Scope\n\nInfrastructure, software, people, procedures, and data.\n\n## Requirements and Security Assessment Procedures\n\n\u003cProcedure slug=\"pci-dss-firewall\"/\u003e\n\u003cProcedure slug=\"pci-dss-change-passwords\"/\u003e\n\u003cProcedure slug=\"pci-dss-data-rest\"/\u003e\n\u003cProcedure slug=\"pci-dss-data-transit\"/\u003e\n\u003cProcedure slug=\"pci-dss-antimalware\"/\u003e\n\u003cProcedure slug=\"pci-dss-sdlc\"/\u003e\n\u003cProcedure slug=\"pci-dss-access-control\"/\u003e\n\u003cProcedure slug=\"pci-dss-iam\"/\u003e\n\u003cProcedure slug=\"pci-dss-physical\"/\u003e\n\u003cProcedure slug=\"pci-dss-monitoring\"/\u003e\n\u003cProcedure slug=\"pci-dss-testing\"/\u003e\n\u003cProcedure slug=\"pci-dss-policy-maintenance\"/\u003e\n\n","version":"3.2.1","isStandard":true,"enabled":true,"procedures":[{"name":"1. Install and maintain a firewall configuration to protect cardholder data","slug":"pci-dss-firewall","body":"Firewalls are devices that control computer traffic allowed between an entity's networks (internal) and untrusted networks (external), as well as traffic into and out of more sensitive areas within an entity's internal trusted networks. The cardholder data environment is an example of a more sensitive area within an entity's trusted network.\n\nA firewall examines all network traffic and blocks those transmissions that do not meet the specified security criteria.\n\nAll systems must be protected from unauthorized access from untrusted networks, whether entering the system via the Internet as e-commerce, employee Internet access through desktop browsers, employee e-mail access, dedicated connections such as business-to-business connections, via wireless networks, or via other sources.","controls":[{"control":"networking-ssh-from-internet"},{"control":"aws-logging-9"},{"control":"aws-networking-2"},{"control":"aws-networking-3"},{"control":"aws-1-3-0-networking-1"},{"control":"aws-1-3-0-networking-2"},{"control":"gcp-networking-4"},{"control":"gcp-networking-5"},{"control":"gcp-vm-4"},{"control":"gcp-sql-2"},{"control":"gcp-kubernetes-4"},{"control":"gcp-kubernetes-11"},{"control":"gcp-kubernetes-13"},{"control":"azure-auditing-on"},{"control":"azure-restrict-rdp"},{"control":"azure-sql-db-disallow-any-ip"},{"control":"azure-network-watcher-enabled"}]},{"name":"2. Do not use vendor-supplied defaults for system passwords and other security parameters","slug":"pci-dss-change-passwords","body":"Malicious individuals (external and internal to an entity) often use vendor default passwords and other vendor default settings to compromise systems. These passwords and settings are well known by hacker communities and are easily determined via public information. Ensuring compliance in this area includes keeping a list of all devices and software which require a password (or other security to access).","controls":[{"control":"aws-networking-3"},{"control":"aws-1-3-0-iam-11"},{"control":"gcp-vm-1"},{"control":"gcp-storage-1"},{"control":"gcp-sql-1"},{"control":"gcp-kubernetes-5"},{"control":"gcp-kubernetes-9"},{"control":"gcp-kubernetes-17"},{"control":"gcp-1-1-0-vm-1"}]},{"name":"3. Protect stored cardholder data","slug":"pci-dss-data-rest","body":"Arguably, this is **the most important requirement** of the PCI standard. Protection methods such as encryption, truncation, masking, and hashing are critical components of cardholder data protection. If an intruder circumvents other security controls and gains access to encrypted data, without the proper cryptographic keys, the data is unreadable and unusable to that person. Regular maintenance and scanning of primary account numbers (PAN) are needed to ensure no unencrypted data exists.\n\nMore information can be found in the [Data Management](/policies/data-management/show) and [Data Protection](/policies/data-protection/show) policies.","controls":[{"control":"aws-logging-8"},{"control":"aws-1-3-0-storage-1-1"},{"control":"aws-1-3-0-storage-2-1"},{"control":"gcp-vm-2"},{"control":"gcp-vm-6"},{"control":"azure-encryption-on-sql-database"},{"control":"azure-key-vault-logging-enabled"},{"control":"azure-expiration-keys-key-vault"}]},{"name":"4. Encrypt transmission of cardholder data across open, public networks","slug":"pci-dss-data-transit","body":"Sensitive information must be encrypted during transmission over networks (in transit) that are easily accessed by malicious individuals. Misconfigured wireless networks and vulnerabilities in legacy encryption and authentication protocols continue to be targets of malicious individuals who exploit these vulnerabilities to gain privileged access to cardholder data environments.","controls":[{"control":"aws-1-3-0-iam-19"},{"control":"aws-1-4-0-storage-1-2"},{"control":"gcp-vm-3"},{"control":"gcp-kubernetes-3"},{"control":"gcp-1-1-0-networking-9"},{"control":"gcp-1-1-0-vm-10"},{"control":"azure-https-transfer-enabled"}]},{"name":"5. Protect all systems against malware and regularly update anti-virus software or programs","slug":"pci-dss-antimalware","body":"Malicious software commonly referred to as \"malware\"—including viruses, worms, and Trojans—enters the network during many business-approved activities including employee e-mail and use of the Internet, mobile computers, and storage devices, resulting in the exploitation of system vulnerabilities. Anti-virus software must be used on all systems commonly affected by malware to protect systems from current and evolving malicious software threats. Additional anti-malware solutions may be considered as a supplement to the anti-virus software; however, such additional solutions do not replace the need for anti-virus software to be in place.","controls":null},{"name":"6. Develop and maintain secure systems and applications","slug":"pci-dss-sdlc","body":"Unscrupulous individuals use security vulnerabilities to gain privileged access to systems. Many of these vulnerabilities are fixed by the vendor-provided security patches, which must be installed by the entities that manage the systems. All systems must have all appropriate software patches to protect against the exploitation and compromise of cardholder data by malicious individuals and malicious software. Refer to the [SDLC Policy](/policies/sdlc/show) for more info.\n\nOrganizations must limit the potential for exploits by deploying critical patches on time. Patch all systems in the card data environment, including:\n\n- Cloud accounts\n- Operating systems\n- Firewalls, Routers, Switches\n- Application software\n- Databases\n- POS/POI terminals","controls":[{"control":"gcp-storage-1"},{"control":"gcp-kubernetes-6"},{"control":"gcp-1-1-0-vm-10"},{"control":"azure-https-transfer-enabled"}]},{"name":"7. Restrict access to cardholder data by business need to know","slug":"pci-dss-access-control","body":"To ensure **Protected** (critical) data can only be accessed by authorized personnel, systems and processes must be in place to limit access based on the *need to know* and according to job responsibilities. The roles that do need sensitive data should be well-documented and regularly updated - as required by PCI DSS.\n\n\"**Need to know**\" - access rights are granted to only the least amount of data and privileges needed to perform a job.","controls":[{"control":"aws-iam-15"},{"control":"aws-iam-17"},{"control":"aws-1-3-0-iam-15"},{"control":"aws-1-3-0-iam-20"},{"control":"aws-1-4-0-iam-20"},{"control":"aws-1-3-0-iam-22"},{"control":"gcp-vm-1"},{"control":"gcp-1-1-0-iam-6"},{"control":"okta-app-group-assignments"}]},{"name":"8. Identify and authenticate access to system components","slug":"pci-dss-iam","body":"Assigning a unique identification (ID) to each person with access ensures that each individual is uniquely accountable for their actions. When such accountability is in place, actions taken on critical data and systems are performed by, and can be traced to, known and authorized users and processes.\n\nThe effectiveness of a password is largely determined by the design and implementation of the authentication system—particularly, how frequently password attempts can be made by an attacker, and the security methods to protect user passwords at the point of entry, during transmission, and while in storage.","controls":[{"control":"aws-1-3-0-iam-7"},{"control":"aws-iam-2"},{"control":"aws-1-4-0-iam-12"},{"control":"aws-iam-4"},{"control":"aws-iam-5"},{"control":"aws-iam-6"},{"control":"aws-iam-7"},{"control":"aws-iam-8"},{"control":"aws-iam-9"},{"control":"aws-iam-11"},{"control":"aws-iam-12"},{"control":"aws-iam-13"},{"control":"aws-iam-14"},{"control":"aws-1-3-0-iam-1"},{"control":"aws-1-3-0-iam-2"},{"control":"aws-1-3-0-iam-3"},{"control":"aws-1-3-0-iam-11"},{"control":"aws-1-3-0-iam-13"},{"control":"aws-1-3-0-iam-15"},{"control":"aws-1-3-0-iam-16"},{"control":"aws-1-3-0-iam-18"},{"control":"aws-1-3-0-iam-19"},{"control":"aws-1-3-0-iam-20"},{"control":"aws-1-4-0-iam-20"},{"control":"aws-1-3-0-iam-22"},{"control":"aws-monitoring-2"},{"control":"aws-monitoring-3"},{"control":"gcp-kubernetes-12"},{"control":"gcp-1-1-0-iam-2"},{"control":"gcp-1-1-0-iam-3"},{"control":"gcp-1-1-0-iam-6"},{"control":"gcp-1-1-0-iam-8"},{"control":"gcp-1-1-0-iam-9"},{"control":"gcp-1-1-0-iam-10"},{"control":"gcp-1-1-0-iam-12"},{"control":"gcp-1-1-0-iam-13"},{"control":"gcp-1-1-0-iam-14"},{"control":"gcp-1-1-0-iam-15"},{"control":"azure-ad-admin-sql-servers"},{"control":"azure-expiration-keys-key-vault"},{"control":"azure-expiration-secrets-key-vault"}]},{"name":"9. Restrict physical access to cardholder data","slug":"pci-dss-physical","body":"Any physical access to data or systems that house cardholder data provides the opportunity for individuals to access devices or data and to remove systems or hardcopies, and should be appropriately restricted. For Requirement 9, \"onsite personnel\" refers to full-time and part-time employees, temporary employees, contractors, and consultants who are physically present on the entity's premises. A \"visitor\" refers to a vendor, guest of any onsite personnel, service workers, or anyone who needs to enter the facility for a short duration, usually not more than one day. \"Media\" refers to all paper and electronic media containing cardholder data.","controls":[{"control":"aws-1-3-0-iam-20"},{"control":"gcp-storage-1"},{"control":"gcp-1-1-0-vm-9"},{"control":"gcp-1-1-0-sql-6"},{"control":"gcp-1-1-0-bigquery-1"}]},{"name":"10. Track and monitor all access to network resources and cardholder data","slug":"pci-dss-monitoring","body":"All activity dealing with cardholder data and primary account numbers (PAN) require a log entry. Logging mechanisms and the ability to track user activities are critical in preventing, detecting, or minimizing the impact of a data compromise. The presence of logs in all environments allows thorough tracking, alerting, and analysis when something does go wrong. Determining the cause of a compromise is very difficult, if not impossible, without system activity logs.\n\nFor more info, please refer to the [Systems Audit Policy](/policies/systems-audit/show).","controls":[{"control":"aws-iam-12"},{"control":"aws-iam-13"},{"control":"aws-logging-1"},{"control":"aws-logging-3"},{"control":"aws-logging-4"},{"control":"aws-logging-5"},{"control":"aws-logging-6"},{"control":"aws-logging-7"},{"control":"aws-logging-9"},{"control":"aws-monitoring-1"},{"control":"aws-monitoring-2"},{"control":"aws-monitoring-3"},{"control":"aws-monitoring-4"},{"control":"aws-monitoring-5"},{"control":"aws-monitoring-6"},{"control":"aws-monitoring-7"},{"control":"aws-monitoring-8"},{"control":"aws-monitoring-9"},{"control":"aws-monitoring-10"},{"control":"aws-monitoring-11"},{"control":"aws-monitoring-12"},{"control":"aws-monitoring-13"},{"control":"aws-monitoring-14"},{"control":"aws-1-3-0-logging-10"},{"control":"aws-1-3-0-logging-11"},{"control":"aws-1-3-0-monitoring-15"},{"control":"gcp-storage-2"},{"control":"gcp-kubernetes-1"},{"control":"gcp-kubernetes-2"},{"control":"gcp-1-1-0-logging-3"},{"control":"azure-auditing-on"},{"control":"azure-auditing-retention-greater-90"},{"control":"azure-1-3-0-networking-4"},{"control":"azure-network-watcher-enabled"}]},{"name":"11. Regularly test security systems and processes","slug":"pci-dss-testing","body":"Vulnerabilities are being discovered continually by malicious individuals and researchers, and being introduced by new software. System components, processes, and custom software should be tested frequently to ensure security controls continue to reflect a changing environment.\n\nFollowing periodic activities are required:\n\n- Wireless analyzer scan to detect and identify all authorized and unauthorized wireless access points quarterly;\n- All external IPs and domains exposed in the CDE are required to be scanned by a PCI Approved Scanning Vendor (ASV) at least quarterly;\n- Internal vulnerability scan must be conducted at least quarterly;\n- All external IPs and domains must go through exhaustive Application penetration test and Network penetration test at least yearly or after any significant change.","controls":null},{"name":"12. Maintain a policy that addresses information security for all personnel","slug":"pci-dss-policy-maintenance","body":"A strong security policy sets the security tone for the whole entity and informs personnel what is expected of them. All personnel should be aware of the sensitivity of data and their responsibilities for protecting it. For Requirement 12, \"personnel\" refers to full-time and part-time employees, temporary employees, contractors, and consultants who are \"resident\" on the entity's site or otherwise have access to the cardholder data environment.\n\nThis requirement also requires you to perform:\n\n- An annual, formal risk assessment that identifies critical assets, threats, and vulnerabilities;\n- User awareness training;\n- Employee background checks;\n- Incident management.\n\n\u003cVar keyName=\"companyName\"/\u003e uses an asset inventory solution to track equipment, software, and employees that have access to \u003cVar keyName=\"companyName\"/\u003e cloud environment and other resources.","controls":[{"control":"aws-iam-12"},{"control":"aws-logging-5"},{"control":"azure-sql-db-disallow-any-ip"},{"control":"azure-additional-email-address"},{"control":"azure-notify-alerts-high-severity"}]}]}