{"name":"Remote Working","slug":"remote-working","body":"## Policy Statement\n\nA remote working arrangement is a voluntary agreement between the organization and the employee. It usually involves the employee working from home in a separate area of their living accommodation, whether this is a house, apartment, or another type of domestic residence.\n\nThis policy sets out the key information security-related elements that must be considered in agreeing on a teleworking arrangement. It ensures that all of the necessary issues are addressed and that \u003cVar keyName=\"companyName\"/\u003e's assets are protected.\n\nThis policy does not address the human resources aspects of remote working such as health and safety, absence monitoring, job performance, and contractual issues. These will be handled by the HR department and must also be in place before the teleworking arrangement begins.\n\n#### Scope\n\nThis control applies to all systems, people, and processes that constitute the organization's information systems, including board members, directors, employees, suppliers, and other 3rd Parties who have access to \u003cVar keyName=\"companyName\"/\u003e systems.\n\n## Procedures\n\n\u003cProcedure slug=\"remote-risk-assessment\"/\u003e\n\u003cProcedure slug=\"remote-facilities\"/\u003e\n\u003cProcedure slug=\"remote-equipment\"/\u003e\n\n","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Initial Risk Assessment","slug":"remote-risk-assessment","body":"Before a remote working arrangement can commence there will be an initial risk assessment of the proposed environment and nature of the work to be carried out.\n\n1. **Nature of the Work:** a major part of the risk assessment concerns the type of activities that are to be carried out as part of the arrangement. A full understanding needs to be gained of:\n\n    - The classification of the information that will be stored and processed as part of the role\n    - The method of access of the information\n    - Whether the role requires that classified information is printed locally\n    - The business criticality of the role and the consequences if it were unavailable\n\n1. **Physical Security:** the risk assessment will also consider the physical security of the proposed work location:\n\n    - Is there enough room to house the required equipment safely?\n    - Is it in a separate area of the living accommodation?\n    - Can the work area be secured e.g. via a locked door when not in use?\n    - Who else has access to the work area?\n    - Will the equipment be visible from outside the accommodation e.g. through a window?\n    - What is the likelihood of theft in the surrounding area?\n    - Can paper documents be locked away securely?\n    - Is there an adequate and reliable power supply to the work area?\n\n1. **Insurance:** the impact of remote working on the individual's home insurance should be investigated to ensure that any policies currently in place remain valid. Additional insurance may be required and if so it should be agreed in advance how this will be funded.","controls":null},{"name":"Facilities provided","slug":"remote-facilities","body":"All of the provisions in the \u003cVar keyName=\"companyName\"/\u003e Mobile Device Policy also apply to the remote working environment and this document should be read by all parties involved.\n\n1. **Equipment:** the individual's own devices such as laptops or PCs could be used to access \u003cVar keyName=\"companyName\"/\u003e information under \u003cVar keyName=\"companyName\"/\u003e Mobile Device Policy. Users of mobile devices should adhere to \u003cVar keyName=\"companyName\"/\u003e [Mobile Device Management Policy](/policies/mdm-device-management/show).\n\n1. **Communications:** in addition to client equipment the remote worker will wherever possible be provided with a physically separate communications link that is not connected in any way to existing domestic broadband or similar. This is to ensure that:\n\n      - Network performance is not affected by other activities in the household;\n      - The configuration of the router can be security-hardened according to organization policy;\n      - The ability for other devices to connect to this link can be prevented through the protection of network keys, etc.\n\n    A Virtual Private Network (VPN) should be used to ensure that all network traffic from the remote worker to \u003cVar keyName=\"companyName\"/\u003e internal systems is encrypted to organization standards.\n\n1. **Backup and Virus Protection:** where possible, no \u003cVar keyName=\"companyName\"/\u003e information will be stored on the client machine. If this is unavoidable it is the responsibility of the remote worker to ensure it is backed up to the corporate network as soon as possible. Virus protection will be provided on all relevant equipment and configured to update automatically on connection to the corporate network.","controls":null},{"name":"Equipment and Expenses","slug":"remote-equipment","body":"\u003cVar keyName=\"companyName\"/\u003e will provide remote employees with equipment that is essential to their job duties, like laptops, headsets, and/or smartphones (when applicable.) We will install VPN and company-required software when employees receive their equipment. If the equipment is not available and employees use their equipment for work, \u003cVar keyName=\"companyName\"/\u003e will reimburse the employee for that use, consistent with legal requirements and this policy.\n\nEquipment that \u003cVar keyName=\"companyName\"/\u003e provides is Company property. \u003cVar keyName=\"companyName\"/\u003e retains control over the property and reserves the right to monitor Company property even when used at your remote location. Employees must keep it safe and avoid any misuse. Equipment supplied by the Company is to be used for business purposes only. The remote worker will sign an inventory of all Company property received and agree to take appropriate action to protect the items from damage or theft. Employees must take proper measures to secure Company information, assets, and systems.\n\nDevice owners must:\n\n- Keep their equipment password protected\n- Store equipment in a safe and clean space when not in use\n- Follow all data encryption, protection standards, and settings\n- Refrain from visiting untrustworthy or suspicious sites\n- Only download authorized software with prior approval\n- Keep devices containing **Confidential** data in locked desks\n\n\u003cVar keyName=\"companyName\"/\u003e will pay the employee an allowance towards their BYOD, this allowance is understood to also cover any individual stationery items required by the individual.\n\n| Country         | NET per calendar month  |\n|-----------------|-------------------------|\n| European Union  | €100                    |\n| UK              | £80                     |\n| Romania         | RON 500                 |\n| Canada          | $125                    |\n| US              | $125                    |\n| India           | INR 8500                |\n\n\u003cVar keyName=\"companyName\"/\u003e will NOT reimburse the employee for the following charges: roaming, plan overages, etc.","controls":null}]}