{"name":"Risk Management, Risk Assessment and Risk Analysis","slug":"risk-management","body":"## Policy Statement\n\n\u003e **Software Risk is Business Risk.** It is a future event that may or may not happen but if it does occur it will have consequences for \u003cVar keyName=\"companyName\"/\u003e.\n\nSoftware engineering projects are risky because of the range of serious potential problems that can arise. The primary benefit of risk management is to contain and mitigate threats to project success. \u003cVar keyName=\"companyName\"/\u003e identifies, plans, and acts when a risk arises—drawing upon the experience and knowledge of the entire team to minimize the impact on the project.\n\nRisk is generally caused due to a lack of information, control, or time. A possibility of suffering from loss in the software development process is called a software risk. Loss can be:\n\n- Financial\n- Reputation for \u003cVar keyName=\"companyName\"/\u003e\n- Increase in production cost\n- Development of poor quality software\n- Not being able to complete the project on time\n\n#### Scope\n\nA software risk can be of two types (a) **internal risks** that are within the control of the project manager and (b) **external risks** that are beyond the control of the Project Manager.\n\n#### Purpose\n\nRisk management is carried out to:\n\n1. Identify the risk\n1. Reduce the impact of risk\n1. Reduce the probability or likelihood of risk\n1. Risk monitoring\n\n## Procedures\n\n\u003cProcedure slug=\"risk-identification\"/\u003e\n\u003cProcedure slug=\"risk-analysis\"/\u003e\n\u003cProcedure slug=\"risk-determination\"/\u003e\n\u003cProcedure slug=\"risk-planning\"/\u003e\n\u003cProcedure slug=\"risk-mitigation\"/\u003e\n\u003cProcedure slug=\"risk-monitoring\"/\u003e\n\u003cProcedure slug=\"risk-register\"/\u003e\n\n","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Risk Identification","slug":"risk-identification","body":"To identify the risks that your project may be subjected to, it is important to first study the problems faced by previous projects. Study the project plan properly and check for all the possible areas that are vulnerable to some of the other types of risks.\n\nThe best way of analyzing a project plan is by converting it to a flowchart and examine all essential areas. It is important to conduct few brainstorming sessions to identify the known unknowns that can affect the project. Any decision taken related to technical, operational, political, legal, social, internal, or external factors should be evaluated properly.\n\nIdentification of risk is part of the product lifecycle, before the integration of new technologies and when introducing new and untested infrastructure changes.","controls":null},{"name":"Risk Analysis","slug":"risk-analysis","body":"Software Risk Analysis a very important aspect of risk management. In this phase, the risk is identified and then categorized. After the categorization of risk, the level, likelihood (percentage), and impact of the risk are analyzed. The likelihood is defined in percentage after examining what are the chances of risk to occur due to various technical conditions. These technical conditions can be:\n\n- Complexity of the technology\n- Technical knowledge possessed by the testing team\n- Conflicts within the team\n- Teams being distributed over a large geographical area\n- Usage of poor quality testing tools\n\nWith impact we mean the consequence of a risk in case it happens. It is important to know about the impact because it is necessary to know how a business can get affected:\n\n- What will be the loss to the customer?\n- How would the business suffer?\n- Loss of reputation or harm to society?\n- Monetary losses are how big?\n- Legal actions against the company?\n- Cancellation of a business license?\n\n#### Consequences of Risks\n\n1. **Loss of Integrity:** system and data integrity refers to the requirement that information is protected from improper modification. Integrity is lost if unauthorized charges are made to the data or IT system by either intentional or accidental acts. If the loss of system or data integrity is not corrected, continued use of the contaminated system or corrupted data could result in inaccuracy, fraud, or erroneous decisions. Also, violation of integrity may be the first step in a successful attack against system availability or confidentiality. For all these reasons, loss of integrity reduces the assurance of an IT system.\n\n1. **Loss of Availability:** if a mission-critical IT system is unavailable to its end users, the organization's mission may be affected. Loss of system functionality and operational effectiveness, for example, may result in loss of productive time, thus\nimpeding the end users' performance of their functions in supporting the organization's mission.\n\n1. **Loss of Confidentiality:** system and data confidentiality refers to the protection of information from unauthorized disclosure. The impact of unauthorized disclosure of confidential information can range from the jeopardizing of national security to the\ndisclosure of Privacy Act data. Unauthorized, unanticipated, or unintentional disclosure could result in loss of public confidence, embarrassment, or legal action against the organization.","controls":null},{"name":"Risk Determination","slug":"risk-determination","body":"#### Level of risk is identified with the help of:\n\n1. *Qualitative Risk Analysis*: Here you define risk as:\n\n  - High\n  - Low\n  - Medium\n\n1. *Quantitative Risk Analysis*: can be used for software risk analysis but is considered inappropriate because risk level is defined in % which does not give a very clear picture.\n\n#### Risk-Level Matrix\n\nThe purpose of this step is to assess the level of risk to the IT system. The determination of risk for a particular threat vulnerability pair can be expressed as a function of\n\n- The likelihood of a given threat source's attempting to exercise a given vulnerability;\n- The magnitude of the impact should a threat-source successfully exercise the vulnerability;\n- The adequacy of planned or existing security controls for reducing or eliminating risk.\n\nTo measure risk, a risk scale and a risk-level matrix must be developed. The final determination of mission risk is derived by multiplying the ratings assigned for threat likelihood (e.g., probability) and threat impact.\n\n**Example:**\n\n\u003e The probability assigned for each threat likelihood level is 1.0 for High, 0.5 for Medium, 0.1 for Low\n\u003e\n\u003e The value assigned for each impact level is 100 for High, 50 for Medium, and 10 for Low\n\u003e\n\u003e Risk Scale: High ( \u003e50 to 100); Medium ( \u003e10 to 50); Low (1 to 10)\n\n| Threat Likelihood | Impact    | Rating            |\n|-------------------|-----------|-------------------|\n| High (1.0)        | Low       | 10 * 1.0 = 10     |\n| High (1.0)        | Medium    | 50 * 1.0 = 50     |\n| High (1.0)        | Low       | 100 * 1.0 = 100   |\n|                   |           |                   |\n| Medium (0.5)      | Low       | 10 * 0.5 = 5      |\n| Medium (0.5)      | Medium    | 50 * 0.5 = 25     |\n| Medium (0.5)      | Low       | 100 * 0.5 = 50    |\n|                   |           |                   |\n| Low (0.1)         | Low       | 10 * 0.1 = 1      |\n| Low (0.1)         | Medium    | 50 * 0.1 = 5      |\n| Low (0.1)         | Low       | 100 * 0.1 = 10    |","controls":null},{"name":"Risk Planning","slug":"risk-planning","body":"Software risk planning is about:\n\n1. Defining preventive measures that would lower down the likelihood or probability of various risks.\n1. Define measures that would reduce the impact in case a risk happens.\n1. Constant monitoring of processes to identify risks as early as possible.","controls":null},{"name":"Risk Mitigation Strategy","slug":"risk-mitigation","body":"\u003cVar keyName=\"companyName\"/\u003e follows [NIST's](https://www.nist.gov/) recommendations for risk management. When control actions must be taken, the following rule applies:\n\n\u003e \"Address the greatest risks and strive for sufficient risk mitigation at the lowest cost, with minimal impact on other mission capabilities.\"\n\nRisk mitigation is a systematic methodology used by senior management to reduce mission risk. Risk mitigation can be achieved through any of the following risk mitigation options:\n\n- **Risk Assumption:** to accept the potential risk and continue operating the IT system or to implement controls to lower the risk to an acceptable level;\n- **Risk Avoidance:** to avoid the risk by eliminating the risk cause and/or consequence (e.g., forgo certain functions of the system or shut down the system when risks are identified);\n- **Risk Limitation:** to limit the risk by implementing controls that minimize the adverse impact of a threat's exercising a vulnerability (e.g., use of supporting, preventive, detective controls);\n- **Risk Planning:** to manage risk by developing a risk mitigation plan that prioritizes, implements, and maintains controls\n- Research and Acknowledgment. To lower the risk of loss by acknowledging the vulnerability or flaw and researching controls to correct the vulnerability;\n- **Risk Transference:** to transfer the risk by using other options to compensate for the loss, such as purchasing insurance.\n\nSenior management, the mission owners, knowing the potential risks and recommended controls, may ask, \"*When and under what circumstances should I take action?*\" or \"*When shall I implement these controls to mitigate the risk and protect \u003cVar keyName=\"companyName\"/\u003e organization?*\".","controls":null},{"name":"Risk Monitoring","slug":"risk-monitoring","body":"Software risk monitoring is integrated into project activities and regular checks are conducted on top risks. Software risk monitoring comprises of:\n\n1. Tracking of risk plans for any major changes in actual plan, attribute, etc.;\n1. Prioritize mitigation measures based on Risk Determination;\n1. Evaluate proposed controls and conduct a cost-benefit;\n1. Preparation of status reports for project management;\n1. Review risks and risks whose impact or likelihood has reached the lowest possible level should be closed;\n1. Regularly search for new risks.","controls":null},{"name":"Risk Register","slug":"risk-register","body":"To ensure that risks remain at the forefront of project management activities, it's best to keep the risk management plan as simple as possible. For both conventional and agile software project management methodologies, a risk register is a proven tool for organizing and referring to known project risks. A comprehensive risk register would contain consist of the following attributes:\n\n- Description of risk — Summary description of the risk—easy to understand;\n- Recognition Date — Date on which stakeholders identify and acknowledge the risk;\n- Probability of occurrence — Estimate of probability that this risk will materialize (%);\n- Severity — The intensity of undesirable impact to the project—if the risk materializes;\n- Owner — This person monitors the risk and takes action if necessary;\n- Action — The contingent response if the risk materializes;\n- Status — current team view of the risk: potential, monitoring, occurring, or eliminated;\n- Loss Size — Given in hours or days, this is a measure of the negative impact to the project;\n- Risk Exposure — Given in hours or days, this is is a product of probability and loss size;\n- Priority (optional) — This is either an independent ranking or the product of probability and severity. Typically, a higher-severity risk with high probability has higher relative priority.\n\n***Risk Register example entry*:**\n\n| Risk Description | Probability of Occurrence | Loss Size (Days) | Risk Exposure (Days) |\n|-----------------------------------------------------------|-----|----|-----|\n| Insufficient QA to validate on all browsers and OS types  | 45% | 6  | 2.7 |\n| Insufficient staff until very late in SDLC                | 25% | 7  | 1.8 |\n| Following end-user testing, more effort may be required   | 25% | 18 | 4.5 |\n| Backup \u0026 restore requires 3rd Party solutions             | 20% | 12 | 2.4 |\n|||||\n| **Total Risk Exposure** | **18.2** |","controls":null}]}