{"name":"Security Training and Awareness","slug":"security-training-awareness","body":"## Policy Statement\n\n\u003cVar keyName=\"companyName\"/\u003e promotes a `Security-First` culture. To support this culture, the company is committed to providing financial and moral support for employees in the processes of:\n\n- acquiring certifications (cloud competencies, security certifications, etc.);\n- being trained in skills they are missing or are needed to perform their job functions;\n- receiving proper education about \u003cVar keyName=\"companyName\"/\u003e policies and procedures;\n- raising security awareness for both the individual and the entire company.\n\n\u003cVar keyName=\"companyName\"/\u003e has named the following responsibles:\n\n-  Chief Information Security Officer - in charge of HITRUST, HIPAA, ISO 27001, PCI-DSS;\n-  Chief Data Protection Officer - in charge of ISO 27001, HIPAA;\n-  Chief Privacy Officer - in charge of GDPR, CCPA, HIPAA;\n\nFor managing training and security awareness programs for employees, \u003cVar keyName=\"companyName\"/\u003e is using a SaaS-based solution offered by Mimecast. This tool offers traceable progress, phishing tests, and helps \u003cVar keyName=\"companyName\"/\u003e to predict employee security risks.\n\n#### Scope\n\nAll \u003cVar keyName=\"companyName\"/\u003e employees with access to **Protected** and **Confidential** data and information assets must participate in information security awareness training. When appropriate, information security training will be provided to individuals whose job functions require specialized skills or knowledge in information security.\n\n## Procedures\n\n\u003cProcedure slug=\"training-importance\"/\u003e\n\u003cProcedure slug=\"training-timeline\"/\u003e\n\u003cProcedure slug=\"training-training\"/\u003e\n\u003cProcedure slug=\"training-certifications\"/\u003e\n\u003cProcedure slug=\"training-awareness\"/\u003e\n\u003cProcedure slug=\"training-simulations\"/\u003e","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Importance of Security","slug":"training-importance","body":"At \u003cVar keyName=\"companyName\"/\u003e we take product security very seriously. \u003cVar keyName=\"companyName\"/\u003e practices include designing for both security and privacy, in product software, IT applications, and cloud services.\n\nWe have rigorous software security policies and processes designed to proactively find and remove software security defects such as security vulnerabilities.\n\n\u003cVar keyName=\"companyName\"/\u003e products, IT applications, and cloud services must not only fulfill the stated function to help protect \u003cVar keyName=\"companyName\"/\u003e customers, the \u003cVar keyName=\"companyName\"/\u003e software itself must also aim to protect itself from vulnerabilities and attackers. \u003cVar keyName=\"companyName\"/\u003e strives to build software that demonstrates resilience against attacks.\n\nDevelopers are expected to pursue ongoing developer education. Self-training is encouraged.","controls":null},{"name":"Timeline for Security Training and Awareness","slug":"training-timeline","body":"- \u003cVar keyName=\"companyName\"/\u003e requires new employees to take a security awareness training within 30 days of joining;\n- \u003cVar keyName=\"companyName\"/\u003e requires existing employees to take security awareness training annually;\n- \u003cVar keyName=\"companyName\"/\u003e requires existing employees to take security awareness training within 30 days in case of a major change in the company's infrastructure or systems.","controls":null},{"name":"Training","slug":"training-training","body":"When necessary, the information security program must provide or coordinate training for individuals whose job functions require special knowledge of security threats, vulnerabilities, and safeguards. This training must focus on expanding knowledge, skills, and abilities for individuals who are assigned information security responsibilities. To begin training, the employee must make an official request (email) to the CISO.","controls":null},{"name":"Certifications","slug":"training-certifications","body":"IT professionals with cloud or security skills are in high demand and certifications can help make you even more hirable by validating your cloud skills and expertise. At the same time, cloud certifications help \u003cVar keyName=\"companyName\"/\u003e become more trustworthy and powerful.\n\n\u003cVar keyName=\"companyName\"/\u003e covers costs to acquire training and certifications, including but not limited to:\n\n- Google Certified Professional Cloud Architect\n- Google Certified Professional Data Engineer\n- AWS Certified Solutions Architect – Associate\n- AWS Certified SysOps Administrator\n- AWS Certified Developer – Associate\n- Microsoft Certified: Microsoft Azure Fundamentals\n- Microsoft Certified: Azure Administrator Associate\n- Microsoft Certified: Azure Solutions Architect Expert\n- Certified Cloud Security Professional (CCSP)\n- CompTIA Cloud+","controls":null},{"name":"Awareness","slug":"training-awareness","body":"One of the goals of a robust security-training program is to raise awareness and understanding of cyber threats with staff. However, to motivate change it is often necessary to not just punish negative behavior but to reward positive behavior.\nA reward system in place for employees that follow procedures and complete testing according to the training roadmap will engage staff in the success of security. Rewards should also be provided for reporting security issues and concerns to keep lines of communication open.\n\n\u003cVar keyName=\"companyName\"/\u003e promotes on-going information security awareness via:\n\n- Regular articles published in corporate newsletters;\n- Information security bulletins distributed to all employees to address security policy modifications, security alerts, and other urgent security issues;\n- Optional: distribution of employee manuals to all employees requiring annual sign-off of agreement and compliance.","controls":null},{"name":"Conduct random simulations","slug":"training-simulations","body":"A common mistake made in security awareness training is simply using the same simulation techniques at the same time intervals. To get a real understanding of security preparedness, conduct simulations at random times. Try not to always give any advanced warning of the simulation. Companies can gain actionable data on the success of their training through careful scheduling and comprehensive analysis. More info in the [Incident Response Policy](/policies/incident-response/show)","controls":null}]}