{"name":"Software Policy","slug":"software","body":"## Policy Statement\n\n\u003cVar keyName=\"companyName\"/\u003e uses many types of computer software to perform its business operations and always relies upon the correct functioning and security of that software. It is imperative therefore that steps are taken to ensure that only approved software is used within the organization and that no classified information is put at risk.\n\nThis policy sets out how the software will be acquired, registered, installed, and developed within \u003cVar keyName=\"companyName\"/\u003e.\n\nThis control applies to all systems, people, and processes that constitute the organization's information systems, including board members, directors, employees, suppliers, and other 3rd Parties who have access to \u003cVar keyName=\"companyName\"/\u003e systems.\n\n## Procedures\n\n\u003cProcedure slug=\"software-purchase\"/\u003e\n\u003cProcedure slug=\"software-registration\"/\u003e\n\u003cProcedure slug=\"software-installation\"/\u003e\n\u003cProcedure slug=\"software-removal\"/\u003e\n\u003cProcedure slug=\"software-inhouse\"/\u003e\n","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Purchasing Software","slug":"software-purchase","body":"All computer software to be used within the organization must be purchased through \u003cVar keyName=\"companyName\"/\u003e. This is necessary to ensure that:\n\n- Licensing requirements are addressed\n- The software works effectively with the standard corporate software image\n- Use of the software can be supported by the \u003cVar keyName=\"companyName\"/\u003e IT Support\n- Best value for money is obtained in procurement\n- A record is kept of installed software within the organization\n\nUnder no circumstances should software be purchased using local departmental budgets.","controls":null},{"name":"Software Registration","slug":"software-registration","body":"All software in use within \u003cVar keyName=\"companyName\"/\u003e must be correctly licensed.\n\nAll installed software programs will be registered in the name of the organization, not the individual. Purchased software is a corporate asset and licenses will frequently be reused as the shape of the organization changes.\n\nUnder no circumstances will corporate software be copied (other than for backups) or installed for personal use.\n\n\u003cVar keyName=\"companyName\"/\u003e will maintain a register of all licensed software within the organization and licensed copies of media such as DVDs.\n\nAsset management software will be used to keep track of all installed instances of software titles and regular audits will be carried out. Any user with unlicensed software installed will be asked to remove it; it is the responsibility of users to ensure that all the software on their computer equipment is licensed.","controls":null},{"name":"Software Installation","slug":"software-installation","body":"Licensed software will be installed by the \u003cVar keyName=\"companyName\"/\u003e IT Support or appropriate technical team or supplier upon request and once any required licenses have been purchased. In few cases (such as development tools), license keys would be supplied to specific users after \u003cVar keyName=\"companyName\"/\u003e has purchased the software for commercial usage. The trial version of the software may be used but the \u003cVar keyName=\"companyName\"/\u003e IT Support team should be informed. Upon expiry of the trial license, software components MUST stop using the software and should be uninstalled completely.\n\nThe software will not be installed before a valid license being ordered except for a trial license. However, this should be brought to the notice of \u003cVar keyName=\"companyName\"/\u003e IT Support before installation and usage.","controls":null},{"name":"Removal of Software","slug":"software-removal","body":"If a software program is no longer required the \u003cVar keyName=\"companyName\"/\u003e IT Support should be informed. The software will then be removed from the device in question and where possible the license will be re-used elsewhere within the organization.\n\nUsers should not remove licensed software from their devices without informing the \u003cVar keyName=\"companyName\"/\u003e IT Support as this potentially represents a waste of a corporate asset.","controls":null},{"name":"In-House Software Development","slug":"software-inhouse","body":"\u003cVar keyName=\"companyName\"/\u003e develops its software for particular purposes where a commercial package is not available or does not fulfill the identified requirements. In such cases, a structured development method will be used to ensure that software is developed to organizational standards and is tested and implemented in a managed way.\n\nAlterations to in-house developed software such as the addition of fields or screen changes may be requested through the change request process. This process is described in the Change Management Process document.\n\nChanges to in-house developed software must not be made without following the change management process.","controls":null}]}