{"name":"Systems Audit","slug":"systems-audit","body":"## Policy Statement\n\nAudit requirements, controls, effective security safeguards, and activities involving verification of operational systems shall be carefully planned and agreed upon, in order to minimize disruptions to business processes.\n\n#### Purpose\n\nRegular operational, process and security audits help to ensure that proper controls are sufficient and effective at providing information confidentiality, safeguarding data, ensuring system availability, and fostering a higher degree of data integrity.\n\n\u003cVar keyName=\"companyName\"/\u003e's reason for performing security systems audits is to protect against:\n\n- Security violations;\n- Network vulnerabilities and intrusions;\n- Unauthorized access to **Protected** or **Confidential** data;\n- Data Loss of **Protected** or **Confidential** data;\n- Performance problems and flaws in systems and applications;\n- Outdated or vulnerable software.\n\n#### Scope\n\nAll devices, systems, people, and processes that constitute \u003cVar keyName=\"companyName\"/\u003e information and cloud-based systems.\n\n### Types of Audits\n\n1. **Internal Audit:** \u003cVar keyName=\"companyName\"/\u003e will conduct these internal audits, or it can hire any other agency for the internal audit to assess the internal processes of the organization. In any framework such as ISO 27001, a schedule of annual internal audit is made.\n\n1. **Second-party Audit:** a customer conducts this type of audit on his supplier. In this audit, both organizations (or companies) have a business relationship.\n\n1. **Compliance Audit:** an external agency (or internal team) conducts this audit for certification. If the organization fulfills the criteria, then it becomes certified. The framework can be ISO 9001, 27001, or any benchmark that the organization considers.\n\n## Procedures\n\n\u003cProcedure slug=\"log-sources\"/\u003e\n\u003cProcedure slug=\"audit-preparing\"/\u003e\n\u003cProcedure slug=\"log-analysis\"/\u003e\n\u003cProcedure slug=\"log-storage\"/\u003e\n\u003cProcedure slug=\"log-disposal\"/\u003e\n\u003cProcedure slug=\"log-format\"/\u003e\n\u003cProcedure slug=\"audit-siem\"/\u003e\n\u003cProcedure slug=\"audit-tools\"/\u003e\n\u003cProcedure slug=\"audit-vulnerable\"/\u003e\n\u003cProcedure slug=\"audit-compromised\"/\u003e\n\n","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Audit Log Generation and Sources","slug":"log-sources","body":"All systems have one audit log. Described below are several types of audit activity that are captured in logs:\n\n1. User: user-level audit trails generally monitor and log all commands directly initiated by the user, all identification and authentication attempts, and files and resources accessed;\n1. Application/Database: application/database level audit trails generally monitor and log user activities, including data files opened and closed, specific actions defined in this procedure, and printing reports;\n1. System: system-level audit trails generally monitor and log user activities, applications accessed, and other system-defined specific actions;\n1. Network: network-level audit trails generally monitor what is operating, unauthorized access attempts, and vulnerabilities;\n1. Cloud: cloud-level audit trails generally monitor what is deployed, changed, or deleted from cloud environments.\n\n#### Log Sources\n\n1. Security Software\n     - Antimalware Software\n     - Intrusion Detection and Prevention System (IDPS)\n     - Remote Access Software (VPN and permit access)\n     - Web Proxies (and WAF)\n     - Vulnerability Management Software\n     - Authentication Servers (IdP or other services)\n     - Routers (hardware and virtual)\n     - Firewalls and Security Groups\n1. Operating Systems\n     - System Events\n     - Audit Records\n1. Applications\n     - Client requests and server responses\n     - Account information\n     - Usage information\n     - Significant operational actions","controls":null},{"name":"Preparing for Audit","slug":"audit-preparing","body":"\u003cVar keyName=\"companyName\"/\u003e uses an asset inventory solution to automatically retrieve assets details, users and groups details, relationships between assets, and access permissions.\n\nPreparing for an audit is perhaps the most time-consuming process, as the organization assesses its security needs and prepares plans for the audit. During this phase, the organizational security must be assessed and at the least, basic security measures are implemented (i.e. backups and offsite storage of critical data, ensuring controls on user accounts, ensuring remote access is secured and controlled).\n\nActivities:\n\n1. Designate an Audit Team\n1. Risk Assessment\n1. Pre-Audit Requirements\n1. Scope and Metrics\n1. Collecting Information for the Audit\n1. Log Management Infrastructure","controls":null},{"name":"Events and Log Analysis","slug":"log-analysis","body":"Logs can contain a wide variety of information on the events occurring within systems and networks. This section describes the following categories of logs of particular interest:\n\n- Security software logs primarily contain computer security-related information;\n- Operating system logs and application logs, typically contain a variety of information, including computer security-related data.\n\nThe logs must follow these rules:\n\n- Auditing logs are automatically analyzed and correlated by the monitoring solutions and/or centralized security information and event management system;\n- The systems are configured with rules/policies to identify suspicious activities, vulnerabilities, and misconfigurations;\n- Alerts are triggered upon identification of an issue based on the policy configuration;\n- The alerts are sent immediately to the responsible staff (e.g. security team) for analysis. The alerts may be sent via email, Microsoft Teams, PagerDuty, or a notification on a monitoring dashboard;\n- Analysis is prioritized based on alert severity. High severity alerts are typically reviewed within 24 hours;\n- The Incident response process is followed, as needed;\n- Patches and updates will be applied to all systems, promptly after an impact assessment is performed.","controls":[{"control":"aws-logging-2"},{"control":"aws-logging-3"},{"control":"aws-logging-4"},{"control":"aws-logging-6"},{"control":"aws-logging-7"},{"control":"aws-logging-9"},{"control":"aws-monitoring-1"},{"control":"aws-monitoring-2"},{"control":"aws-monitoring-3"},{"control":"aws-monitoring-4"},{"control":"aws-monitoring-5"},{"control":"aws-monitoring-6"},{"control":"aws-monitoring-7"},{"control":"aws-monitoring-8"},{"control":"aws-monitoring-9"},{"control":"aws-monitoring-10"},{"control":"aws-monitoring-11"},{"control":"aws-monitoring-12"},{"control":"aws-monitoring-13"},{"control":"aws-monitoring-14"},{"control":"aws-1-3-0-logging-10"},{"control":"aws-1-3-0-logging-11"},{"control":"aws-1-3-0-monitoring-15"},{"control":"gcp-iam-1"},{"control":"gcp-logging-1"},{"control":"gcp-logging-2"},{"control":"gcp-logging-3"},{"control":"gcp-logging-4"},{"control":"gcp-logging-5"},{"control":"gcp-logging-6"},{"control":"gcp-logging-7"},{"control":"gcp-logging-8"},{"control":"gcp-logging-9"},{"control":"gcp-logging-10"},{"control":"gcp-logging-11"},{"control":"gcp-networking-6"},{"control":"gcp-vm-3"},{"control":"gcp-storage-2"},{"control":"gcp-sql-4"},{"control":"gcp-kubernetes-1"},{"control":"gcp-1-1-0-logging-3"}]},{"name":"Log Storage","slug":"log-storage","body":"*Log rotation* is closing a log file and opening a new log file when the first file is considered to be complete. Log rotation is typically performed according to a schedule (e.g., hourly, daily, weekly) or when a log file reaches a certain size. The primary benefits of log rotation are preserving log entries and keeping the size of log files manageable.\n\n*Log archival* is retaining logs for an extended period, typically on cold storage (AWS Glacier), removable media, a storage area network (SAN), or a specialized log archival appliance or server. Logs often need to be preserved to meet legal or regulatory requirements.","controls":[{"control":"aws-logging-3"},{"control":"aws-logging-4"},{"control":"aws-logging-6"},{"control":"aws-logging-9"},{"control":"gcp-logging-1"},{"control":"gcp-logging-2"},{"control":"gcp-logging-3"},{"control":"gcp-networking-6"},{"control":"gcp-storage-2"},{"control":"gcp-kubernetes-1"},{"control":"gcp-1-1-0-logging-3"}]},{"name":"Log Disposal","slug":"log-disposal","body":"*Log clearing* is removing all entries that precede a certain date and time from a log. It is often performed to remove old log data that is no longer needed on a system because it is not of importance or has been archived.  removes logs after 1 year of storage.","controls":null},{"name":"Log Format","slug":"log-format","body":"- Message type, known as a facility. Examples of facilities include kernel messages, mail system messages, authorization messages, printer messages, and audit messages;\n- Severity. Each log message has a severity value assigned, from 0 (emergency) to 7 (debug).\n\n\u003e Example of log\n\n```\nMar 1 06:25:43 server1 sshd[23170]: Accepted publickey for server2 from\n172.30.128.115 port 21011 ssh2\nMar 1 07:16:42 server1 sshd[9326]: Accepted password for murugiah from 10.20.30.108\nport 1070 ssh2\nMar 1 07:16:53 server1 sshd[22938]: reverse mapping checking getaddrinfo for\nip10.165.nist.gov failed - POSSIBLE BREAKIN ATTEMPT!\nMar 1 07:26:28 server1 sshd[22572]: Accepted publickey for server2 from\n172.30.128.115 port 30606 ssh2\nMar 1 07:28:33 server1 su: BAD SU kkent to root on /dev/ttyp2\nMar 1 07:28:41 server1 su: kkent to root on /dev/ttyp2\n```","controls":[{"control":"aws-monitoring-1"},{"control":"aws-monitoring-2"},{"control":"aws-monitoring-3"},{"control":"aws-monitoring-4"},{"control":"aws-monitoring-5"},{"control":"aws-monitoring-6"},{"control":"aws-monitoring-7"},{"control":"aws-monitoring-8"},{"control":"aws-monitoring-9"},{"control":"aws-monitoring-10"},{"control":"aws-monitoring-11"},{"control":"aws-monitoring-12"},{"control":"aws-monitoring-13"},{"control":"aws-monitoring-14"},{"control":"aws-1-3-0-monitoring-15"},{"control":"gcp-logging-4"},{"control":"gcp-logging-5"},{"control":"gcp-logging-6"},{"control":"gcp-logging-7"},{"control":"gcp-logging-8"},{"control":"gcp-logging-9"},{"control":"gcp-logging-10"},{"control":"gcp-logging-11"},{"control":"gcp-1-1-0-logging-3"}]},{"name":"Security Information and Event Management Software (SIEM)","slug":"audit-siem","body":"Security information and event management (SIEM) software is a type of centralized logging software. Compared to Syslog, SIEM products have one or more log servers that perform log analysis, and one or more database servers that store the logs.\n\nSIEM products usually include several features to help log monitoring staff, such as the following:\n\n- Graphical user interfaces (GUI) that are specifically designed to assist analysts in identifying potential problems and reviewing all available data related to each problem;\n- A security knowledge base, with information on known vulnerabilities, the likely meaning of certain log messages, and other technical data;\n- Incident tracking and reporting capabilities, sometimes with robust workflow features;\n- Asset information storage and correlation (e.g., giving higher priority to an attack that targets a vulnerable OS or a more important host).\n\nMost SIEM products support two ways of collecting logs from log generators:\n\u001f- **Agentless.** The SIEM server receives data from the individual log generating hosts without needing to have any special software installed on those hosts. Some servers pull logs from the hosts, which is usually done by having the server authenticate to each host and retrieve its logs regularly. In other cases, the hosts push their logs to the server, which usually involves each host authenticating to the server and transferring its logs regularly.\n- **Agent-Based.** An agent program is installed on the log generating host to perform event filtering and aggregation and log normalization for a particular type of log, then transmit the normalized log data to a SIEM server, usually on a real-time or near-real-time basis for analysis and storage.","controls":[{"control":"aws-logging-1"},{"control":"aws-logging-2"},{"control":"aws-logging-3"},{"control":"aws-logging-4"},{"control":"aws-logging-6"},{"control":"aws-1-3-0-logging-10"},{"control":"aws-1-3-0-logging-11"},{"control":"aws-logging-7"},{"control":"gcp-logging-1"},{"control":"gcp-logging-5"}]},{"name":"Auditing and Assessment Tools","slug":"audit-tools","body":"\u003cVar keyName=\"companyName\"/\u003e selected assessment tools that are designed to detect vulnerabilities and intrusions. Without the explicit authorization of the Security Officer, scanning and auditing \u003cVar keyName=\"companyName\"/\u003e infrastructure is strictly prohibited.\n\n- Software scanners, both OSS and 3rd Party (acquired by \u003cVar keyName=\"companyName\"/\u003e);\n- Querying APIs from servers, endpoints, and cloud resources;\n- Network sniffers and scanners;\n- Sofware agents/clients installed on servers and endpoints;\n- Penetration tools.","controls":null},{"name":"Vulnerable Systems","slug":"audit-vulnerable","body":"If a system is detected as having a vulnerability, the owner or administrator of the system will be immediately notified. Information will be included regarding the remedy recommended for the system as well as the amount of time allowed to fix the problem. If the system is not repaired within the designated period, network access will be temporarily suspended until corrections and repairs are made.","controls":null},{"name":"Compromised Systems","slug":"audit-compromised","body":"If a system is detected as being compromised, IT will notify the registered owner or administrator. If possible, steps to correct the situation, as well as the amount of time they will be allowed to take corrective action will be included in the communication. Failure to correct or remedy the compromise in the specified period will result in the termination of network access for the system in question.\n\n| Level     | Time allowed                          | Description   |\n|-----------|---------------------------------------|---------------|\n| Critical  | Immediately terminate access to network | The system is in an active state being used for nefarious purposes (trying to scan or infect other systems, causing network problems, providing services to off-campus entities, etc.) |\n| High      | 24 hours                              | The system is compromised but is not actively being manipulated. However, it could become critical at any moment |\n| Medium    | 72 hours                              | The system has been compromised but cannot be elevated to a higher level of compromise. Impact of the compromise is minimal |","controls":null}]}