{"name":"Third Party Vendors and Due Diligence","slug":"vendor-management","body":"## Policy Statement\n\nDue care must be taken to ensure that the policies of \u003cVar keyName=\"companyName\"/\u003e are enforced and monitored where possible. Since access to most assets happens via the cloud provider's infrastructure, risks related to compliance is mitigated to an acceptable level by the Cloud Service Provider. \u003cVar keyName=\"companyName\"/\u003e also brings significant effort to assure that all 3rd Party organizations that are working with us are compliant and do not compromise the integrity, security, and privacy of \u003cVar keyName=\"companyName\"/\u003e's company, employees, customers, and even of other vendors.\n\n## Procedures\n\n\u003cProcedure slug=\"vendor-selection\"/\u003e\n\u003cProcedure slug=\"vendor-requirements\"/\u003e\n\u003cProcedure slug=\"vendor-monitoring\"/\u003e\n\u003cProcedure slug=\"vendor-risk-assessment\"/\u003e\n\u003cProcedure slug=\"vendor-audit\"/\u003e\n\u003cProcedure slug=\"vendor-ip\"/\u003e\n\u003cProcedure slug=\"vendor-escrow\"/\u003e\n\n","version":"1","isStandard":false,"enabled":true,"procedures":[{"name":"Selection of Subcontractors or Software Vendors","slug":"vendor-selection","body":"Standard procurement procedures should be used in the selection and engagement of appropriate subcontractors or software vendors (OEMs included). Use of these procedures should ensure that the subcontractor or software vendor:\n\n- Is capable of delivering the services to the required standard;\n- Can meet the required delivery timescales;\n- Represents the best value for the organization;\n- Can meet the specified security requirements.\n\nThe use of subcontractors by \u003cVar keyName=\"companyName\"/\u003e for any aspects of the development should be understood and an assessment of these subcontractors included before engagement.","controls":null},{"name":"Communication of Requirements","slug":"vendor-requirements","body":"The contract with the subcontractor or software vendor should require compliance with this policy and include a clear statement of the requirements for secure design, coding, and testing of the software. The subcontractor or vendor should also be required to establish a secure development environment under \u003cVar keyName=\"companyName\"/\u003e standards.\n\nRequirements definition should be carried out by \u003cVar keyName=\"companyName\"/\u003e so that a clear definition of the software to be created (including its security features) is agreed upon with the business and used as a contractual starting point. Whilst the subcontractor or software vendor may in some circumstances assist in the definition of requirements, the exercise should be led, managed, and ideally carried out by internal resources so that there is a clear separation between requirements and design/development.\n\nA comprehensive picture of the anticipated threat model faced by the software should be provided to the subcontractor or software vendor so that a clear understanding is gained of the types of vulnerabilities that must be avoided if the software is to be secure.","controls":null},{"name":"Supervision and Monitoring","slug":"vendor-monitoring","body":"Measures should be put in place to ensure adequate supervision of the activities of the subcontractor or software vendor and regular monitoring of progress.\n\nFor a large project with significant time gaps between deliverables, \u003cVar keyName=\"companyName\"/\u003e could introduce multiple points of verifications, and an agreed method of verifying interim progress should be in place so that early warning is given of delays.","controls":null},{"name":"Vendor Technology Risk Reviews and Acceptance","slug":"vendor-risk-assessment","body":"Review points should be established as part of the project planning process to verify progress and give the formal acceptance of the software deliverables created. These will involve appropriate testing activities and code reviews.\n\nThe subcontractor or software vendor should be required to provide evidence of the security testing activities carried out during the development, including tests for concealed malware, backdoors, and known vulnerabilities.\n\nWhere appropriate a security review of developed code may be engaged with a suitable 3rd Party with the relevant security expertise.\n\nConducting vendor risk assessments can be a long and tedious process. However, failing to do so could result in reputation damage, lost business, legal fees, and fines. If one of your vendors fails to comply with regulations (such as data privacy or safety standards), your company will face consequences, too.\n\n#### Steps for identifying risks\n\n1. Know the types of vendor risk\n1. Determine risk criteria\n1. Assess each product and service\n1. Get help from experts\n1. Assess every vendor\n1. Separate vendors by risk level\n1. Make a risk management plan\n1. Stay up to date on regulations\n1. Conduct annual assessments","controls":null},{"name":"Audit of Development Methods","slug":"vendor-audit","body":"\u003cVar keyName=\"companyName\"/\u003e should have the contractual right to undertake a second audit of the subcontractor or vendor. This may be used to review whether the development methods used comply with \u003cVar keyName=\"companyName\"/\u003e policies and whether all information provided to the supplier is protected by appropriate security controls.","controls":null},{"name":"Intellectual Property","slug":"vendor-ip","body":"Any software that is developed under an agreed contract with a subcontractor or vendor must be understood to be \u003cVar keyName=\"companyName\"/\u003e's intellectual property. Appropriate legal advice should be taken particularly if the outsourcer is based outside of \u003cVar keyName=\"companyName\"/\u003e's home country.","controls":null},{"name":"Escrow","slug":"vendor-escrow","body":"Arrangements should be made for \u003cVar keyName=\"companyName\"/\u003e to be able to legally access the source code of any developments undertaken if the subcontractor or vendor ceases trading for any reason. This should be the case during development and if appropriate after the code has been delivered.","controls":null}]}