{
  "body": "### Description:\n\nAPI Keys should only be used for services in cases where other authentication methods are unavailable. API keys are always at risk because they can be viewed publicly, such as from within a browser, or they can be accessed on a device where the key resides. It is recommended to restrict API keys to use (call) only APIs required by an application.\n\n### Rationale:\n\nSecurity risks involved in using API-Keys are below:\n• API keys are simple encrypted strings\n• API keys do not identify the user or the application making the API request\n• API keys are typically accessible to clients, making it easy to discover and steal an API key.\n\nIn light of these potential risks, Google recommends using the standard authentication flow instead of API-Keys. However, there are limited cases where API keys are more appropriate. For example, if there is a mobile application that needs to use the Google Cloud Translation API, but doesn't otherwise need a backend server, API keys are the simplest way to authenticate to that API.\n\nIn order to reduce attack surfaces by providing **least privileges**, API-Keys can be restricted to use (call) only APIs required by an application.\n\n\n### Impact:\n\nSetting API restrictions may break existing application functioning, if not done carefully.",
  "name": "Ensure API Keys are restricted to use by only APIs that application needs access to",
  "slug": "api-keys-not-restricted-to-specified-apis",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "APIKey"
      ],
      "query": "gcp-api-keys-restricted-apis"
    }
  ],
  "remediationDescription": "#### From Google Cloud Console:\n##### Leaving Keys in Place:\n\n1. Click on the `Open in Google Cloud`. \n2. Ensure the section Key restrictions parameter API restrictions is not set to `None` or is not set to `Google Cloud APIs`\n",
  "description": "API Keys without specified APIs",
  "severity": 3
}