{"name":"Ensure that Object-level logging for write events is enabled for S3 bucket","slug":"aws-1-3-0-logging-10","body":"S3 object-level API operations such as GetObject, DeleteObject, and PutObject are called data events. By default, CloudTrail trails don't log data events and so it is recommended to enable Object-level logging for S3 buckets.\n\n**Rationale**\n\nEnabling object-level logging will help you meet data compliance requirements within your organization, perform comprehensive security analysis, monitor specific patterns of user behavior in your AWS account or take immediate actions on any object-level API activity within your S3 Buckets using Amazon CloudWatch Events.","description":"","severity":1,"remediationDescription":"**From Console**\n\n1. Open the Amazon S3 console [S3](https://console.aws.amazon.com/s3/)\n2. Choose the required bucket from the bucket list.\n3. Choose **Properties** tab to see in detail bucket configuration.\n4. Navigate to `AWS CloudTrail data events` section to select the CloudTrail name for the recording activity.\n5. You can choose an existing Cloudtrail or create a new one by navigating to the Cloudtrail console link from S3.\n6. Once the Cloudtrail console, navigate to `Data events : S3`  section.\n7. If the current status for Object-level logging is set to Disabled, then object-level logging of write events for the selected s3 bucket is not set\n   - Select **Edit** to enable the `Write` event.\n   - You can choose to select `All current and future S3 buckets` or `Individual bucket`.\n8. Repeat steps 2 to 7 to enable object-level logging of read events for other S3 buckets.\n\n**From Command Line**\n\n1. To enable object-level data events logging for S3 buckets within your AWS account, run put-event-selectors command using the name of the trail that you want to reconfigure as identifier:\n\n```bash\naws cloudtrail put-event-selectors --region \u003cregion-name\u003e --trail-name \u003ctrail-name\u003e --event-selectors '[{ \"ReadWriteType\": \"WriteOnly\", \"IncludeManagementEvents\":true, \"DataResources\": [{ \"Type\": \"AWS::S3::Object\", \"Values\": [\"arn:aws:s3:::\u003cs3-bucket-name\u003e/\"] }] }]'\n```\n\n2. The command output will be object-level event trail configuration.\n3. If you want to enable it for all buckets at once then change Values parameter to `[\"arn:aws:s3\"]` in command given above.\n4. Repeat step 1 for each s3 bucket to update `object-level` logging of write events.\n5. Change the AWS region by updating the --region command parameter and perform the process for other regions.","rules":[{"cloudProviders":["aws"],"comparator":"eq","expectedResult":"[]","subjects":["Bucket"],"query":"aws-1-3-0-logging-10-object-level-logging-for-write-events-is-enabled-for-s3-bucket","returnPath":""}]}