{"name":"Ensure CloudTrail trails are integrated with CloudWatch Logs","slug":"aws-logging-4","body":"AWS CloudTrail is a web service that records AWS API calls made in a given AWS account. The recorded information includes the identity of the API caller, the time of the API call, the source IP address of the API caller, the request parameters, and the response elements returned by the AWS service. CloudTrail uses Amazon S3 for log file storage and delivery, so log files are stored durably. In addition to capturing CloudTrail logs within a specified S3 bucket for long term analysis, realtime analysis can be performed by configuring CloudTrail to send logs to CloudWatch Logs. For a trail that is enabled in all regions in an account, CloudTrail sends log files from all those regions to a CloudWatch Logs log group. It is recommended that CloudTrail logs be sent to CloudWatch Logs.\n\nNote: The intent of this recommendation is to ensure AWS account activity is being captured, monitored, and appropriately alarmed on. CloudWatch Logs is a native way to accomplish this using AWS services but does not preclude the use of an alternate solution.\n\n**Rationale**\n\nSending CloudTrail logs to CloudWatch Logs will facilitate real-time and historic activity logging based on user, API, resource, and IP address, and provides opportunity to establish alarms and notifications for anomalous or sensitivity account activity.","description":"","severity":2,"remediationDescription":"Perform the following to establish the prescribed state: \n\nVia the AWS management Console\n\n1. Sign in to the AWS Management Console and open the CloudTrail console at\nhttps://console.aws.amazon.com/cloudtrail/\n2. Under All Buckets, click on the target bucket you wish to evaluate\n3. Click Properties on the top right of the console\n4. Click `Trails` in the left menu\n5. Click on each trail where no `CloudWatch Logs` are defined\n6. Go to the `CloudWatch Logs` section and click on `Configure`\n7. Define a new or select an existing log group\n8. Click on `Continue`\n9. Configure IAM Role which will deliver CloudTrail events to CloudWatch Logs\n* Create/Select an `IAM Role` and `Policy Name`\n* Click `Allow` to continue\n\n**Via CLI**\n\n```bash\naws cloudtrail update-trail --name \u003ctrail_name\u003e --cloudwatch-logs-log-group- arn \u003ccloudtrail_log_group_arn\u003e --cloudwatch-logs-role-arn \u003ccloudtrail_cloudwatchLogs_role_arn\u003e\n```\n\n**Impact**\n\nNote: By default, CloudWatch Logs will store Logs indefinitely unless a specific retention period is defined for the log group. When choosing the number of days to retain, keep in mind the average days it takes an organization to realize they have been breached is 210 days (at the time of this writing). Since additional time is required to research a breach, a minimum 365 day retention policy allows time for detection and research. You may also wish to archive the logs to a cheaper storage service rather than simply deleting them. See the following AWS resource to manage CloudWatch Logs retention periods:\n\n1. http://docs.aws.amazon.com/AmazonCloudWatch/latest/DeveloperGuide/SettingLogRetention.html\n\n**References**\n\n1. https://aws.amazon.com/cloudtrail/ \n2. CCE-78916-4\n3. CIS CSC v6.0 #6.6, #14.6","rules":[{"cloudProviders":["aws"],"comparator":"eq","expectedResult":"[]","subjects":["Trail"],"query":"aws-logging-4-cloudtrail-trails-are-integrated-with-cloudwatch-logs","returnPath":""}]}