{
  "body": "A VPC comes with a default security group whose initial settings deny all inbound traffic, allow all outbound traffic, and allow all traffic between instances assigned to the security group. If you don't specify a security group when you launch an instance, the instance is automatically assigned to this default security group. Security groups provide stateful filtering of ingress/egress network traffic to AWS resources. It is recommended that the default security group restrict all traffic.\nThe default VPC in every region should have its default security group updated to comply. Any newly created VPCs will automatically contain a default security group that will need remediation to comply with this recommendation.\n\n**NOTE** When implementing this recommendation, VPC flow logging is invaluable in determining the least privilege port access required by systems to work properly because it can log all packet acceptances and rejections occurring under the current security groups. This dramatically reduces the primary barrier to least privilege engineering - discovering the minimum ports required by systems in the environment. Even if the VPC flow logging recommendation in this benchmark is not adopted as a permanent security measure, it should be used during any period of discovery and engineering for least privileged security groups.\n\n**Rationale**\n\nConfiguring all VPC default security groups to restrict all traffic will encourage least privilege security group development and mindful placement of AWS resources into security groups which will in-turn reduce the exposure of those resources.",
  "name": "Ensure the default security group of every VPC restricts all traffic",
  "slug": "aws-networking-3",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "aws"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "SecurityGroup"
      ],
      "query": "aws-networking-3-the-default-security-group-of-every-vpc-restricts-all-traffic",
      "returnPath": "",
      "applicableAssetsQuery": "query ($options: SecurityGroupOptions) {\n  securityGroups(options: $options, where: { groupName: \"default\" }) {\n    ...AssetFragment\n  }\n}",
      "isManual": false
    }
  ],
  "remediationDescription": "*Security Group Members*\n\nPerform the following to implement the prescribed state:\n\n1. Identify AWS resources that exist within the default security group\n2. Create a set of least privilege security groups for those resources\n3. Place the resources in those security groups\n4. Remove the resources noted in #1 from the default security group \n\n*Security Group State*\n\n1. Login to the AWS Management Console at\nhttps://console.aws.amazon.com/vpc/home\n2. Repeat the next steps for all VPCs - including the default VPC in each AWS region:\n3. In the left pane, click `Security Groups`\n4. For each default security group, perform the following:\n5. Select the `default` security group\n6. Click the `Inbound Rules` tab\n7. Remove any inbound rules\n8. Click the `Outbound Rules` tab\n9. Remove any outbound rules\n\n**Recommended**\n\nIAM groups allow you to edit the \"name\" field. After remediating default groups rules for all VPCs in all regions, edit this field to add text similar to \"DO NOT USE. DO NOT ADD RULES\"\n\n**Impact**\n\nImplementing this recommendation in an existing VPC containing operating resources requires extremely careful migration planning as the default security groups are likely to be enabling many ports that are unknown. Enabling VPC flow logging (of accepts) in an existing environment that is known to be breach free will reveal the current pattern of ports being used for each instance to communicate successfully.\n\n**References**\n\n1. CCE-79201-0\n2. http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/using-network-security.html\n3. https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-security-groups.html#default-security-group",
  "isEnabled": true,
  "description": "",
  "severity": 2
}
