{"name":"Ensure access keys are rotated every 90 days or less","slug":"aws-iam-4","body":"Access keys consist of an access key ID and secret access key, which are used to sign programmatic requests that you make to AWS. AWS users need their own access keys to make programmatic calls to AWS from the AWS Command Line Interface (AWS CLI), Tools for Windows PowerShell, the AWS SDKs, or direct HTTP calls using the APIs for individual AWS services. It is recommended that all access keys be regularly rotated.\n\n**Rationale**\n\nRotating access keys will reduce the window of opportunity for an access key that is associated with a compromised or terminated account to be used.\n\nAccess keys should be rotated to ensure that data cannot be accessed with an old key which might have been lost, cracked, or stolen.","description":"","severity":2,"remediationDescription":"Perform the following to rotate access keys:\n\n1. Go to the [Management Console](https://console.aws.amazon.com/iam)\n2. Click on `Users`\n3. For each affected user, click on `Security Credentials`\n4. As an Administrator, click on `Make Inactive` for keys that have not been rotated in 90 Days\n5. As an IAM User, click on `Make Inactive` or `Delete` for keys which have not been rotated or used in 90 Days\n6. Click on `Create access key`\n\n7. Update programmatic call with new Access Key credentials\n\n**Via CLI**\n\n1. While the first access key is still active, create a second access key, which is active by default. Run the following command:\n\n```bash\naws iam create-access-key\n```\n\nAt this point, the user has two active access keys.\n\n2.Update all applications and tools to use the new access key.\n3.Determine whether the first access key is still in use by using this command:\n\n```bash\naws iam get-access-key-last-used\n```\n\n4.One approach is to wait several days and then check the old access key for any use before proceeding.\n\nEven if step Step 3 indicates no use of the old key, it is recommended that you do not immediately delete the first access key. Instead, change the state of the first access key to Inactive using this command:\n\n```bash\naws iam update-access-key\n```\n\n5.Use only the new access key to confirm that your applications are working. Any applications and tools that still use the original access key will stop working at this point because they no longer have access to AWS resources. If you find such an application or tool, you can switch its state back to Active to reenable the first access key. Then return to step Step 2 and update this application to use the new key.\n6.After you wait some period of time to ensure that all applications and tools have been updated, you can delete the first access key with this command:\n\n```bash\naws iam delete-access-key\n```\n\n**References**\n\n1. CCE-78902-4","rules":[{"cloudProviders":["aws"],"comparator":"eq","expectedResult":"[]","subjects":["IAMUser"],"query":"aws-iam-4-access-keys-are-rotated-every-90-days-or-less","returnPath":""}]}