{"name":"Ensure that S3 Buckets are configured with 'Block public access (bucket settings)'","slug":"aws-1-3-0-iam-20","body":"Amazon S3 provides *Block public access (bucket settings)* and *Block public access (account settings)* to help you manage public access to Amazon S3 resources. By default, S3 buckets and objects are created with public access disabled. However with an IAM principle with sufficient S3 permissions can enable public access at the bucket and/or object level.\n\nWhile enabled, Block public access (bucket settings) prevents an individual bucket and its objects, from becoming publicly accessible.\nSimilarly, Block public access (account settings) prevents all buckets and it's objects in an account, from becoming publicly accessible.\n\nAmazon S3 *Block public access (bucket settings)* prevents the accidental or malicious public exposure of data contained within the respective bucket(s).\n\nAmazon S3 *Block public access (account settings)* prevents the accidental or malicious public exposure of data contained within all buckets of the respective AWS account.\n\nWhether blocking public access to all or some buckets is an organizational decision that should be based on data sensitivity, least privilege, and use case.\n\nWhen you apply Block Public Access settings to an account, the settings apply to all AWS Regions globally. The settings might not take effect in all Regions immediately or simultaneously, but they eventually propagate to all Regions.","description":"","severity":3,"remediationDescription":"**From Console**\n\nBy using Block Public Access (bucket settings):\n\n1. Login to AWS Management Console and open the [Amazon S3 console](https://console.aws.amazon.com/s3/).\n2. Click on the bucket name.\n3. Go to **Permissions** tab.\n4. Click **Edit** for `Block all public access (bucket setting)`.\n5. Ensure that block public access settings are set appropriately for this bucket.\n6. Repeat for all the buckets in your AWS account that contain sensitive data.\n\nBy using Block Public Access (account settings):\n\n1. Login to AWS Management Console and open the [Amazon S3 console](https://console.aws.amazon.com/s3/).\n2. In the left navigation pane, choose **Block Public Access settings for this account**\n3. Ensure that block public access settings are set appropriately for your AWS account.\n\n**From Command Line**\n\nTo set Block Public access settings for the buckets, run the following commands:\n\n1. List all of the S3 Buckets\n\n```bash\naws s3 ls\n```\n\n2. Set the public access to true on that bucket\n\n```bash\naws s3api put-public-access-block --bucket \u003cname-of-bucket\u003e --public-access- block-configuration \"BlockPublicAcls=true,IgnorePublicAcls=true,BlockPublicPolicy=true,RestrictPu blicBuckets=true\"\n```\n\nTo set Block Public access settings for the account, run the following command:\n\n```bash\naws s3control put-public-access-block --public-access-block-configuration BlockPublicAcls=true, IgnorePublicAcls=true, BlockPublicPolicy=true, RestrictPublicBuckets=true --account-id \u003cvalue\u003e\n```","rules":[{"cloudProviders":["aws"],"comparator":"eq","expectedResult":"[]","subjects":["Bucket"],"query":"aws-1-3-0-iam-20-s3-buckets-are-configured-with-block-public-access-bucket-settings","returnPath":""}]}