{
  "name": "Ensure hardware MFA is enabled for the \"root\" account (Hardware MFA)",
  "slug": "aws-iam-14",
  "body": "The root account is the most privileged user in an AWS account. MFA adds an extra layer of protection on top of a user name and password. With MFA enabled, when a user signs in to an AWS website, they will be prompted for their user name and password as well as for an authentication code from their AWS MFA device. For Level 2, it is recommended that the root account be protected with a hardware MFA.\n\n**Rationale**\n\nA hardware MFA has a smaller attack surface than a virtual MFA. For example, a hardware MFA does not suffer the attack surface introduced by the mobile smartphone on which a virtual MFA resides.\n\n**Note**: Using hardware MFA for many, many AWS accounts may create a logistical device management issue. If this is the case, consider implementing this Level 2 recommendation selectively to the highest security AWS accounts and the Level 1 recommendation applied to the remaining accounts.\n\nLink to order AWS compatible hardware MFA device: http://onlinenoram.gemalto.com/",
  "description": "",
  "severity": 2,
  "isEnabled": true,
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "remediationDescription": "Perform the following to establish a hardware MFA for the root account:\n\n1. Sign in to the AWS Management Console and open the IAM console at\nhttps://console.aws.amazon.com/iam/.\n\nNote: to manage MFA devices for the root AWS account, you must use your root account credentials to sign in to AWS. You cannot manage MFA devices for the root account using other credentials.\n\n2. Choose `Dashboard` , and under `Security Status` , expand `Activate MFA` on your root account.\n3. Choose `Activate MFA`\n4. In the wizard, choose `A hardware MFA` device and then choose `Next Step`.\n5. In the `Serial Number` box, enter the serial number that is found on the back of the MFA device.\n6. In the `Authentication Code 1` box, enter the six-digit number displayed by the MFA device. You might need to press the button on the front of the device to display the number. \n7. Wait 30 seconds while the device refreshes the code, and then enter the next six-digit number into the `Authentication Code 2` box. You might need to press the button on the front of the device again to display the second number.\n8. Choose `Next Step`. The MFA device is now associated with the AWS account. The next time you use your AWS account credentials to sign in, you must type a code from the hardware MFA device.\n\n**References**\n\n1. CCE-78911-5\n2. CIS CSC v6.0 #5.6, #11.4, #12.6, #16.11\n3. Order Hardware MFA: http://onlinenoram.gemalto.com/\n4. http://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_mfa_enable_virtual.html\n5. http://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_mfa_enable_physical.html#enable-hw-mfa-for-root\n\n**Notes**\n\nadded the CLI for audit based on the output of 'aws iam list-virtual-mfa-devices'\nRemediation should be only through the AWS Console.",
  "rules": [
    {
      "cloudProviders": ["aws"],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": ["CloudAccount"],
      "query": "aws-iam-14-hardware-mfa-is-enabled-for-the-root-account-hardware-mfa",
      "returnPath": ""
    }
  ]
}
