{"name":"Ensure all data in Amazon S3 has been discovered, classified and secured when required","slug":"aws-1-4-0-storage-1-4","body":"Amazon S3 buckets can contain sensitive data, that for security purposes should be discovered, monitored, classified and protected. Macie along with other 3rd party tools can automatically provide an inventory of Amazon S3 buckets.","description":"","severity":1,"remediationDescription":"Perform the steps below to enable and configure Amazon Macie\n**From Console**\n\n1. Log on to the Macie console at `https://console.aws.amazon.com/macie/`\n2. Click `Get started.`\n3. Click `Enable Macie`.\n\nSetup a repository for sensitive data discovery results\n\n1. In the Left pane, under Settings, click `Discovery results.`\n2. Make sure `Create bucket` is selected.\n3. Create a bucket, enter a name for the bucket. The name must be unique across all S3 buckets. In addition, the name must start with a lowercase letter or a number.\n4. Click on `Advanced`.5. Block all public access, make sure `Yes` is selected.\n6. KMS encryption, specify the AWS KMS key that you want to use to encrypt the results. The key must be a symmetric, customer master key (CMK) that's in the same Region as the S3 bucket.\n7. Click on `Save`\n\nCreate a job to discover sensitive data\n\n1. In the left pane, click `S3 buckets`. Macie displays a list of all the S3 buckets for your account.\n2. Select the `check box` for each bucket that you want Macie to analyze as part of the job\n3. Click `Create job`.\n4. Click `Quick create`.\n5. For the Name and description step, enter a name and, optionally, a description of the job.\n6. Then click `Next`.\n7. For the Review and create step, click `Submit`.\n\nReview your findings\n\n1. In the left pane, click `Findings`.\n2. To view the details of a specific finding, choose any field other than the check box for the finding.\n\nIf you are using a 3rd Party tool to manage and protect your s3 data, follow the Vendor documentation for implementing and configuring that tool.","rules":null}