{
  "slug": "aws-logging-1",
  "name": "Ensure CloudTrail is enabled in all regions",
  "body": "AWS CloudTrail is a web service that records AWS API calls for your account and delivers log files to you. The recorded information includes the identity of the API caller, the time of the API call, the source IP address of the API caller, the request parameters, and the response elements returned by the AWS service. CloudTrail provides a history of AWS API calls for an account, including API calls made via the Management Console, SDKs, command line tools, and higher-level AWS services (such as CloudFormation).\r\n\r\n**Rationale**\r\n\r\nThe AWS API call history produced by CloudTrail enables security analysis, resource change tracking, and compliance auditing. Additionally,\r\n* ensuring that a multi-regions trail or an organization trail exists will ensure that unexpected activity occurring in otherwise unused regions is detected\r\n* ensuring that a multi-regions trail or an organization trail exists will ensure that `Global Service Logging` is enabled for a trail by default to capture recording of events generated on AWS global services\r\n* for a multi-regions trail, ensuring that management events configured for all type of Read/Writes ensures recording of management operations that are performed on all resources in an AWS account\r\n",
  "description": "CloudTrail is not enabled in all regions.",
  "severity": 2,
  "remediationDescription": "***_NOTE:_*** In case you have a multi-region Trail,  make sure it is created in one of the selected regions. Otherwise, add the region with the Trail\n\nPerform the following to enable global (Multi-region) CloudTrail logging: Via the management Console\r\n\r\n1. Sign in to the AWS Management Console and open the IAM console at\r\nhttps://console.aws.amazon.com/cloudtrail\r\n2. Click on Trails on the left navigation pane\r\n3. Click Get `Started Now`, if presented\r\n* Click `Add new trail`\r\n* Enter a trail name in the `Trail name` box\r\n* Set the `Apply trail to all regions` option to Yes\r\n* Specify an S3 bucket name in the `S3 bucket` box\r\n* Click `Create`\r\n4. If 1 or more trails already exist, select the target trail to enable for global logging\r\n5. Click the edit icon (pencil) next to `Apply trail to all regions`, Click `Yes` and\r\nClick `Save`.\r\n6. Click the edit icon (pencil) next to `Management Events` click `All` for setting\r\n`Read/Write Events` and Click `Save`.\r\n\r\nVia CLI\r\n\r\n```bash\r\naws cloudtrail create-trail --name <trail_name> --bucket-name <s3_bucket_for_cloudtrail> --is-multi-region-trail\r\naws cloudtrail update-trail --name <trail_name> --is-multi-region-trail\r\n    \r\n\r\n```\r\n\r\nNote: Creating CloudTrail via CLI without providing any overriding options configures `Management Events` to set `All` type of `Read/Writes` by default.\r\n\r\n**Impact**\r\nS3 lifecycle features can be used to manage the accumulation and management of logs over time. See the following AWS resource for more information on these features:\r\n\r\n1. http://docs.aws.amazon.com/AmazonS3/latest/dev/object-lifecycle-mgmt.html\r\n\r\n**Default Value**\r\n\r\nNot Enabled\r\n\r\n**References**\r\n\r\n1. CCE-78913-1\r\n2. CIS CSC v6.0 #14.6\r\n3. https://docs.aws.amazon.com/awscloudtrail/latest/userguide/cloudtrail-concepts.html#cloudtrail-concepts-management-events\r\n4. https://docs.aws.amazon.com/awscloudtrail/latest/userguide/logging-management-and-data-events-with-cloudtrail.html?icmpid=docs_cloudtrail_console#logging-management-events\r\n5. https://docs.aws.amazon.com/awscloudtrail/latest/userguide/cloudtrail-supported-services.html#cloud-trail-supported-services-data-events",
  "rules": [
    {
      "cloudProviders": [
        "aws"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "query": "aws-multi-region-trails-with-logging-enabled",
      "subjects": [
        "Connector"
      ]
    }
  ]
}