{
  "alertForSecondaryOnly": false,
  "name": "Ensure ECS task definitions do not share the host's process namespace",
  "severity": 3,
  "remediationDescription": "PID mode should not be set to `host`.\n\nPID mode is the process namespace to use for the containers in the task. The valid values are `host` or `task`. If `host` is specified, all containers within the tasks that specified the host PID mode on the same container instance share the same process namespace with the host Amazon EC2 instance. If `task` is specified, all containers within the specified task share the same process namespace. If no value is specified, the default is a private namespace.\n\nIf the `host` PID mode is used, there's a heightened risk of undesired process namespace exposure.\n\nTo configure the pidMode on a task definition, see [Task definition parameters](https://docs.aws.amazon.com/AmazonECS/latest/developerguide/task_definition_parameters.html#task_definition_pidmode) in the Amazon Elastic Container Service Developer Guide.\n",
  "body": "A process ID (PID) namespace provides separation between processes. It prevents system processes from being visible, and allows PIDs to be reused, including PID 1. If the host's PID namespace is shared with containers, it would allow containers to see all of the processes on the host system. This reduces the benefit of process level isolation between the host and the containers. These circumstances could lead to unauthorized access to processes on the host itself, including the ability to manipulate and terminate them. Customers shouldn't share the host's process namespace with containers running on it. This control only evaluates the in-use (RUNNING Task) revision of an Amazon ECS task definition.",
  "slug": "aws-ecs-3-process-names-pace",
  "rules": [
    {
      "cloudProviders": ["aws"],
      "comparator": "eq",
      "expectedResult": "[]",
      "query": "aws-ecs-3-process-name-space-query",
      "subjects": ["ECSTaskDefinition"]
    }
  ]
}
