{
  "slug": "aws-iam-16",
  "name": "Ensure a support role has been created to manage incidents with AWS Support",
  "body": "AWS provides a support center that can be used for incident notification and response, as well as technical support and customer services. Create an IAM Role to allow authorized users to manage incidents with AWS Support.\r\n\r\n**Rationale**\r\n\r\nBy implementing least privilege for access control, an IAM Role will require an appropriate IAM Policy to allow Support Center Access in order to manage Incidents with AWS Support.",
  "description": "A support role that manages incidents with AWS support does not exist.",
  "severity": 1,
  "remediationDescription": "Using the Amazon unified command line interface:\r\n\r\n* Create an IAM role for managing incidents with AWS:\r\n\r\n    * Create a trust relationship policy document that allows <iam_user> to\r\nmanage AWS incidents, and save it locally as /tmp/TrustPolicy.json:\r\n\r\n```json\r\n{\r\n  \"Version\": \"2012-10-17\",\r\n  \"Statement\": [\r\n    {\r\n      \"Effect\": \"Allow\",\r\n      \"Principal\": {\r\n        \"AWS\": \"<span style=\"font-style: italic;\"><iam_user></span>\"\r\n      },\r\n      \"Action\": \"sts:AssumeRole\"\r\n    }\r\n] }\r\n```\r\n- Create the IAM role using the above trust policy:\r\n\r\n```bash\r\naws iam create-role --role-name <aws_support_iam_role> --assume-role- policy-document file:///tmp/TrustPolicy.json\r\n```\r\n- Attach `AWSSupportAccess` managed policy to the created IAM role:\r\n\r\n```bash\r\naws iam attach-role-policy --policy-arn <iam_policy_arn> --role-name <aws_support_iam_role>\r\n```\r\n\r\n**Impact**\r\n\r\nAll AWS Support plans include an unlimited number of account and billing support cases, with no long-term contracts. Support billing calculations are performed on a per-account basis for all plans. Enterprise Support plan customers have the option to include multiple enabled accounts in an aggregated monthly billing calculation. Monthly charges for the Business and Enterprise support plans are based on each month's AWS usage charges, subject to a monthly minimum, billed in advance.\r\n\r\n**References**\r\n\r\n1. http://docs.aws.amazon.com/IAM/latest/UserGuide/access_policies_managed-vs-inline.html\r\n2. https://aws.amazon.com/premiumsupport/pricing/\r\n3. http://docs.aws.amazon.com/cli/latest/reference/iam/list-policies.html\r\n4. http://docs.aws.amazon.com/cli/latest/reference/iam/attach-role-policy.html\r\n5. http://docs.aws.amazon.com/cli/latest/reference/iam/list-entities-for-policy.html",
  "rules": [
    {
      "cloudProviders": ["aws"],
      "comparator": "eq",
      "expectedResult": "[]",
      "query": "aws-iampolicies-with-support-role",
      "subjects": ["Connector"],
      "returnPath": ""
    }
  ]
}
