{
  "name": "Make sure that Amazon ECS task definitions include secure networking modes and user definitions.",
  "slug": "aws-ecs-1",
  "body": "Amazon Elastic Container Service (ECS) [task definitions](https://docs.aws.amazon.com/AmazonECS/latest/developerguide/task_definitions.html) are JSON files that describe how a Docker container should be launched within an ECS cluster.\n\nThis control verifies if an active Amazon ECS task definition, configured with the `host` network mode, exhibits unexpected privilege escalation on the host container.\n\nIf the `privileged` parameter is set to `true` or the `user` parameter is set to `root` or any other highly privileged user, it can lead to security concerns. These containers have elevated privileges, enabling them to access resources and perform operations that are typically restricted.",
  "remediationDescription": "To remediate this issue, identify the task definitions with the `host` network mode and elevated privileges, and update their parameters accordingly. You can achieve this by creating a new task definition revision using the following steps:\n\n1. Open the Amazon ECS classic [console](https://console.aws.amazon.com/ecs/).\n2. Choose the region that contains your task definition.\n3. In the navigation pane, select \"task definitions.\"\n4. On the task definitions page, select the checkbox next to the task definition that needs revision, and choose **Create new revision**.\n5. Update the `privileged` parameter to `false` and/or change the `user` parameter to a low-privileged user.\n6. If your task definition is used in a service, update your service with the updated task definition. For more information, refer to the [AWS documentation](https://docs.aws.amazon.com/AmazonECS/latest/developerguide/update-service-console-v2.html).",
  "severity": 3,
  "rules": [
    {
      "subjects": [
        "ECSTaskDefinition"
      ],
      "query": "ecs-task-definitions-secure-privileges",
      "expectedResult": "[]",
      "comparator": "eq",
      "cloudProviders": [
        "aws"
      ]
    }
  ],
  "alertForSecondaryOnly": false
}