{"name":"Ensure IAM policies that allow full \"*:*\" administrative privileges are not created","slug":"aws-iam-17","body":"IAM policies are the means by which privileges are granted to users, groups, or roles. It is recommended and considered a standard security advice to grant *least privilege* - that is, granting only the permissions required to perform a task. Determine what users need to do and then craft policies for them that let the users perform only those tasks, instead of allowing full administrative privileges.\n\n**Rationale**\n\nIt's more secure to start with a minimum set of permissions and grant additional permissions as necessary, rather than starting with permissions that are too lenient and then trying to tighten them later.\n\nProviding full administrative privileges instead of restricting to the minimum set of permissions that the user is required to do exposes the resources to potentially unwanted actions.\n\nIAM policies that have a statement with \"Effect\": \"Allow\" with \"Action\": \"\\*\" over \"Resource\": \"*\" should be removed.","description":"","severity":1,"remediationDescription":"Using the GUI, perform the following to detach the policy that has full administrative privileges:\n\n1. Sign in to the AWS Management Console and open the IAM console at https://console.aws.amazon.com/iam/.\n2. In the navigation pane, click Policies and then search for the policy name found in the audit step.\n3. Select the policy that needs to be deleted.\n4. In the policy action menu, select first `Detach`\n5. Select all Users, Groups, Roles that have this policy attached\n6. Click `Detach Policy`\n7. In the policy action menu, select `Detach`\n\nUsing the CLI, perform the following to detach the policy that has full administrative privileges as found in the audit step:\n\n1. Lists all IAM users, groups, and roles that the specified managed policy is attached to.\n\n```bash\naws iam list-entities-for-policy --policy-arn \u003cpolicy_arn\u003e\n```\n\n2. Detach the policy from all IAM Users:\n\n```bash\naws iam detach-user-policy --user-name \u003ciam_user\u003e --policy-arn \u003cpolicy_arn\u003e\n```\n\n3. Detach the policy from all IAM Groups:\n\n```bash\naws iam detach-group-policy --group-name \u003ciam_group\u003e --policy-arn \u003cpolicy_arn\u003e\n```\n\n4. Detach the policy from all IAM Roles:\n\n```bash\naws iam detach-role-policy --role-name \u003ciam_role\u003e --policy-arn \u003cpolicy_arn\u003e\n```\n\nReferences:\n\n1. http://docs.aws.amazon.com/IAM/latest/UserGuide/best-practices.html\n2. http://docs.aws.amazon.com/IAM/latest/UserGuide/access_policies_managed-vs-inline.html\n3. CCE-78912-3\n4. http://docs.aws.amazon.com/cli/latest/reference/iam/index.html#cli-aws-iam","rules":[{"cloudProviders":["aws"],"comparator":"eq","expectedResult":"[]","subjects":["IAMPolicy"],"query":"aws-iam-17-iam-policies-that-allow-full--administrative-privileges-are-not-created","returnPath":""}]}