{
  "name": "Ensure Storage logging is Enabled for Blob Service for 'Read', 'Write', and 'Delete' requests",
  "slug": "azure-log-blob-read-write-delete",
  "body": "The Storage Blob service provides scalable, cost-efficient objective storage in the cloud. Storage Logging happens server-side and allows details for both successful and failed requests to be recorded in the storage account. These logs allow users to see the details of 'Read', 'Write', and 'Delete' operations against the blobs. Storage Logging logs entries that contain the following information about individual requests: timing information such as start time, end-to-end latency, and server latency; authentication details; concurrency information; the sizes of the request and response messages.\n\n**Rationale**\n\nStorage Analytics logs contain detailed information about successful and failed requests to a storage service. This information can be used to monitor each individual request to a storage service for increased security and diagnostics. Requests are logged on a best-effort basis.\n\nStorage Analystics logging is not enabled by default for your storage account.\n\n**Impact**\n\nEnabling this setting can have a high impact on the cost of data storage used for logging more data per each request. Do not enable this without determining your need for this level of logging or forget to check in on data usage and projected cost.",
  "severity": 1,
  "remediationDescription": "**From Azure Console:**\n\n1. Go to `Storage Accounts`.\n2. Select the specific Storage Account.\n3. Click the `Diagnostics settings` blade under the `Monitoring` section in the left column.\n4. Select the `blob` tab indented below the storage account.\n5. Click `+ Add diagnostic setting`.\n6. Write a diagnostic setting name.\n7. Select `StorageRead`, `StorageWrite` and `StorageDelete` options under the `Logging` section to enable Storage Logging for Blob service.\n8. Select a destination for your logs to be sent to.\n\n**Using Azure Command Line Interface**\n\nUse the below command to enable the Storage Logging for Blob service.\n\n```bash\naz storage logging update --account-name <StorageAccountName> --account-key <StorageAccountKey> --services b --log rwd --retention 90\n```\n\n**Default Value**\n\nBy default, storage account blob service logging is disabled for read, write, an delete operations\n\n**References**\n\n1. [https://docs.microsoft.com/en-us/rest/api/storageservices/about-storage-analytics-logging](https://docs.microsoft.com/en-us/rest/api/storageservices/about-storage-analytics-logging)\n2. [https://docs.microsoft.com/en-us/cli/azure/storage/logging?view=azure-cli-latest](https://docs.microsoft.com/en-us/cli/azure/storage/logging?view=azure-cli-latest)\n3. [https://docs.microsoft.com/en-us/security/benchmark/azure/security-controls-v3-logging-threat-detection#lt-3-enable-logging-for-security-investigation](https://docs.microsoft.com/en-us/security/benchmark/azure/security-controls-v3-logging-threat-detection#lt-3-enable-logging-for-security-investigation)\n\n**Additional Information**\n\nBy the nature and intent of having blobs, audit log requirements cannot be generalized for every blob. This recommendation may be applicable to storage account blob services where the security is paramount.",
  "rules": [
    {
      "cloudProviders": [
        "azure"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "BlobContainer"
      ],
      "query": "azure-1-3-0-storage-10-storage-logging-is-enabled-for-blob-service-for-read-write-and-delete-requests"
    }
  ]
}