{
  "body": "Verify identities without MFA that can log in to a privileged virtual machine using separate login credentials. An adversary can leverage the access to move laterally and perform actions with the virtual machine's managed identity. Ensure the virtual machine only has necessary permissions, and revoke the admin-level permissions according to the least privileges principle.\n\n### Rationale\n\nIntegrating multi-factor authentication (MFA) as part of organizational policy can greatly reduce the risk of an identity gaining control of valid credentials that may be used for additional tactics such as initial access, lateral movement, and information collection. MFA can also be used to restrict access to cloud resources and APIs.\n\nAn Adversary may log into accessible cloud services within a compromised environment using Valid Accounts that are synchronized to move laterally and perform actions with the virtual machine's managed identity. The adversary may perform management actions or access cloud-hosted resources as the logged-on managed identity.\n\n### Impact\n\nThis recommendation requires Entra ID P2.\n\nEnsure that identities provisioned to a virtual machine utilize an RBAC/ABAC group and are allocated a role using Azure PIM. The Role settings require MFA or another third-party PAM solution for accessing Virtual Machines.",
  "name": "Ensure only MFA enabled identities can access privileged Virtual Machine",
  "slug": "azure-compute-mfa-privileged-vms",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "isManual": false,
      "cloudProviders": [
        "azure"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "VM"
      ],
      "query": "azure-privileged-vms-accessible-by-users-without-mfa"
    }
  ],
  "remediationDescription": "**Remediate from Azure Portal**\n\n1. Log in to the Azure portal.\n2. This can be remediated by enabling MFA for users, Removing user access, or Reducing access to managed identities attached to virtual machines.\n\n- Case I: Enable MFA for users having access to virtual machines.\n\t1. Navigate to `Entra ID` from the left pane and select `Users` from the `Manage` section.\n\t2. Click on `Per-User MFA` from the top menu options and select each user with `MULTI-FACTOR AUTH STATUS` as `Disabled` and can log in to virtual machines:\n\t\t* From `quick steps` on the right side, select `enable`.\n\t\t* Click on `enable multi-factor auth` and share the link with the user to set up MFA as required.\n\n- Case II: Removing user access on a virtual machine.\n\t1. Select the `Subscription`, then click on `Access control (IAM)`.\n\t2. Select `Role assignments` and search for `Virtual Machine Administrator Login` or `Virtual Machine User Login` or any role that provides access to log into virtual machines.\n\t3. Click on `Role Name`, Select `Assignments`, and remove identities with no MFA configured.\n\n- Case III: Reducing access to managed identities attached to virtual machines.\n\t1. Select the `Subscription`, then click on `Access control (IAM)`.\n\t2. Select `Role Assignments` from the top menu and apply filters on `Assignment type` as `Privileged administrator roles` and `Type` as `Virtual Machines`.\n\t3. Click on `Role Name`, Select `Assignments`, and remove identities' access. Make sure this follows the least privileges principle.",
  "isEnabled": true,
  "severity": 2
}
