{
  "body": "Azure Database for PostgreSQL servers should be created with 'infrastructure double encryption' enabled.\n\n**NOTE:** This recommendation currently only applies to Single Server, not Flexible Server. See the additional information below for details about the planned retirement of Azure PostgreSQL Single Server.\n\n### Rationale\n\nIf Double Encryption is enabled, another layer of encryption is implemented at the hardware level before the storage or network level. Information will be encrypted before it is even accessed, preventing interception of data in motion if the network layer encryption is broken and data is at rest in system resources such as memory or processor cache. Encryption will also be in place for any backups taken of the database so that the key will secure access to the data in all forms. For the most secure implementation of key-based encryption, it is recommended to use a Customer-managed asymmetric RSA 2048 Key in Azure Key Vault.\n\n### Impact\n\nThe read and write speeds to the database will be impacted if both default encryption and Infrastructure Encryption are checked, as a secondary form of encryption requires more resource overhead for the cryptography of information. This cost is justified for information security.\n\nCustomer-managed keys are recommended for the most secure implementation, leading to the overhead of key management. The key will also need to be backed up in a secure location, as losing the key will mean losing the information in the database.\n\n### Default Value\n\nBy default, Double Encryption is disabled.\n\n### Additional Information\n\n**RETIREMENT of Azure PostgreSQL Single Server:** Azure PostgreSQL Single Server is slated for retirement by March 25, 2025. Please use these resources to consider and prepare for migration:\n- [https://learn.microsoft.com/en-us/azure/postgresql/single-server/whats-happening-to-postgresql-single-server](https://learn.microsoft.com/en-us/azure/postgresql/single-server/whats-happening-to-postgresql-single-server)\n- [https://learn.microsoft.com/en-us/azure/postgresql/migrate/concepts-single-to-flexible](https://learn.microsoft.com/en-us/azure/postgresql/migrate/concepts-single-to-flexible)",
  "name": "[LEGACY] Ensure 'Infrastructure double encryption' for PostgreSQL single server is 'Enabled'",
  "slug": "azure-postgres-single-server-infrastructure-encryption",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "isManual": false,
      "cloudProviders": ["azure"],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": ["PostgreSQLServer"],
      "query": "azure-single-servers-without-infra-encryption"
    }
  ],
  "remediationDescription": "It is not possible to enable 'infrastructure double encryption' on an existing Azure Database for PostgreSQL server.\n\nThe remediation steps detail creating a new Azure Database for PostgreSQL server with 'infrastructure double encryption' enabled.\n\n**Remediate from Azure Portal**\n\n1. Go through the normal process of database creation.\n2. On step 2 titled `Additional settings` ensure that `Infrastructure double encryption enabled` is checked.\n3. Acknowledge that you understand this will impact database performance.\n4. Finish database creation as normal.\n\n**Remediate from Azure CLI**\n\n```bash\naz postgres server create --resource-group <resourcegroup> --name <servername>  --location <location> --admin-user <adminusername> --admin-password <server_admin_password> --sku-name GP_Gen4_2 --version 11 --infrastructure-encryption Enabled\n```",
  "isEnabled": true,
  "description": "",
  "severity": 2
}
