{
  "body": "Network security groups should be periodically evaluated for port misconfigurations. Where certain ports and protocols may be exposed to the Internet, they should be evaluated for necessity and restricted wherever they are not explicitly required.\n\n**Rationale**\n\nThe potential security problem with broadly exposing UDP services over the Internet is that attackers can use DDoS amplification techniques to reflect spoofed UDP traffic from Azure Virtual Machines. The most common types of these attacks use exposed DNS, NTP, SSDP, SNMP, CLDAP and other UDP-based services as amplification sources for disrupting services of other machines on the Azure Virtual Network or even attack networked devices outside of Azure.",
  "name": "Ensure UDP access from the Internet is evaluated and restricted",
  "slug": "azure-restrict-udp",
  "isInsight": false,
  "alertForSecondaryOnly": true,
  "rules": [
    {
      "cloudProviders": [
        "azure"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "SecurityGroup"
      ],
      "query": "azure-nsgs-allowing-udp-traffic",
      "isManual": false
    }
  ],
  "remediationDescription": "Where UDP is not explicitly required and narrowly configured for resources attached to the Network Security Group, Internet-level access to your Azure resources should be restricted or eliminated.\n\n**From Azure Console**\n\n1. Go to `Virtual Machines`\n2. For each virtual machine you want to restrict SSH for, under `Settings`, go to `Networking`\n3. In the list of inbound port rules, delete any `Allow` rule with protocol `UDP` and with `Source` as `Any`, `Internet` or `0.0.0.0/0`. Review all `Allow` rules with protocol `UDP` that have static IPs and remove the ones that are not necessary.\n\nFor internal access to relevant resources, configure an encrypted network tunnel such as:\n\n- [ExpressRoute](https://docs.microsoft.com/en-us/azure/expressroute/)  \n- [Site-to-site VPN](https://docs.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-howto-site-to-site-resource-manager-portal) \n- [Point-to-site VPN](https://docs.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-howto-point-to-site-resource-manager-portal)",
  "isEnabled": true,
  "severity": 2
}
