{"name":"Ensure Storage logging is enabled for Table service for read, write, and delete requests","slug":"azure-1-3-0-storage-11","body":"The Storage Table storage is a service that stores structure NoSQL data in the cloud, providing a key/attribute store with a schema less design. Storage Logging happens server-side and allows details for both successful and failed requests to be recorded in the storage account. These logs allow users to see the details of read, write, and delete operations against the tables. Storage Logging log entries contain thefollowing information about individual requests: Timing information such as start time, end-to-end latency, and server latency, authentication details , concurrency information and the sizes of the request and response messages.\n\n**Rationale**\n\nStorage Analytics logs contain detailed information about successful and failed requests to a storage service. This information can be used to monitor individual requests and to diagnose issues with a storage service. Requests are logged on a best-effort basis.\n\n**Impact**\n\nEnabling storage account table service logging does have a cost implication.","description":"","severity":1,"remediationDescription":"**From Azure Console**\n\n1. Go to `Storage Accounts`.\n2. Select the specific Storage Account.\n3. Click the `Diagnostics settings (classic)` blade from `Monitoring (classic)` section.\n4. Set the `Status` to `On`, if set to `Off`.\n5. Select `Table properties`.\n6. Select `Read`, `Write` and `Delete` options under the `Logging` section to enable Storage Logging for Table service.\n\n**Using Azure Command Line Interface**\n\nUse the below command to enable the Storage Logging for Table service.\n\n```bash\naz storage logging update --account-name \\\u003cstorageAccountName\\\u003e --account-key \\\u003cstorageAccountKey\\\u003e --services t --log rwd --retention 90\n```\n\n**Default Value**\n\nBy default, storage account table service logging is disabled for read, write, andelete operations\n\n**References**\n\n1. [https://docs.microsoft.com/en-us/rest/api/storageservices/about-storage-analytics-logging](https://docs.microsoft.com/en-us/rest/api/storageservices/about-storage-analytics-logging)\n2. [https://docs.microsoft.com/en-us/cli/azure/storage/logging?view=azure-cli-latest](https://docs.microsoft.com/en-us/cli/azure/storage/logging?view=azure-cli-latest)\n3. [https://docs.microsoft.com/en-us/azure/security/benchmarks/security-controls-v2-logging-threat-detection#lt-4-enable-logging-for-azure-resources](https://docs.microsoft.com/en-us/azure/security/benchmarks/security-controls-v2-logging-threat-detection#lt-4-enable-logging-for-azure-resources)\n\n**Additional Information**\n\nBy the nature and intent of having tables, practically we cannot generalize detailed audit log requirement for every table. This recommendation may be applicable to storage account table service where the security is paramount.","rules":null}