{
  "body": "Periodically, newer versions are released for Python software either due to security flaws or to include additional functionality. Using the latest Python version for web apps is recommended in order to take advantage of security fixes, if any, and/or new functionalities of the newer version.\n\n### Rationale\n\nNewer versions may contain security enhancements and additional functionality. Using the latest version is recommended in order to take advantage of enhancements and new capabilities. With each software installation, organizations need to determine if a given update meets their requirements. They must also verify the compatibility and support provided for any additional software against the update revision that is selected.\n\n### Impact\n\nIf your app is written using version-dependent features or libraries, they may not be available on the latest version. If you wish to upgrade, research the impact thoroughly. Upgrading may have unforeseen consequences that could result in downtime.\n\n### Default value\n\nYou have to select a version during app creation.",
  "name": "Ensure that 'Python version' is the latest, if used to run the web app",
  "slug": "azure-latest-python-version",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "azure"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "Site"
      ],
      "query": "azure-apps-with-unsupported-python-version",
      "isManual": false
    }
  ],
  "remediationDescription": "### From Azure Console\n\n1. Open the web app using the `Open in Azure` button.\n2. Select `Configuration`\n3. Go to `General settings`\n4. Under the `Stack settings`, for Python, select for `Major version` and `Minor version` the latest stable and supported release\n\n### Using Azure Command Line Interface\n\nTo see the list of supported runtimes:\n\n```bash\naz webapp list-runtimes\n```\n\nTo set the latest Python version for an existing app, run the following command:\n\n```bash\naz webapp config set --resource-group <resourceGroup> --name <applicationName> [--linux-fx-version <pythonRuntimeVersion>] [--windows-fx-version <pythonRuntimeVersion>] \n```",
  "isEnabled": true,
  "severity": 2
}
