{
  "body": "Application Insights within Azure act as an Application Performance Monitoring solution, providing valuable data into how well an application performs and additional information when responding to incidents. The types of log data collected include application metrics, telemetry data, and application trace logging data, which provide organizations with detailed information about application activity and transactions. Both data sets help organizations adopt proactive and retroactive means to handle security and performance-related metrics within their modern applications.\n\n### Rationale\n\nConfiguring Application Insights provides additional data not found elsewhere within Azure as part of a much more extensive logging and monitoring program within an organization's Information Security practice. The types and contents of these logs will act as both a potential cost-saving measure (application performance) and a means to potentially confirm the source of a potential incident (trace logging). Metrics and Telemetry data provide organizations with a proactive approach to cost savings by monitoring an application's performance, while the trace logging data provides necessary details in a reactive incident response scenario by helping organizations identify the potential source of an incident within their application.\n\n### Impact\n\nBecause Application Insights relies on a Log Analytics Workspace, an organization will incur additional expenses when using this service.\n\n### Default Value\n\nApplication Insights are not enabled by default.",
  "name": "Ensure Application Insights are Configured",
  "slug": "azure-application-insights-are-configured",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "isManual": false,
      "cloudProviders": [
        "azure"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "Connector"
      ],
      "query": "azure-subscriptions-without-app-insights"
    }
  ],
  "remediationDescription": "### Remediate from Azure Portal\n\n1. Navigate to `Application Insights`.\n2. Under the `Basics` tab within the `PROJECT DETAILS` section, select the `Subscription`.\n3. Select the `Resource group`.\n4. Within the `INSTANCE DETAILS`, enter a `Name`.\n5. Select a `Region`.\n6. Next to `Resource Mode`, select `Workspace-based`.\n7. Within the `WORKSPACE DETAILS`, select the `Subscription` for the log analytics workspace.\n8. Select the appropriate `Log Analytics Workspace`.\n9. Click `Next:Tags >`.\n10. Enter the appropriate `Tags` as `Name`, `Value` pairs.\n11. Click `Next:Review+Create`.\n12. Click `Create`.\n\n### Remediate from Azure CLI\n\n```bash\naz monitor app-insights component create --app <app_name> --resource-group <resource_group_name> --location <location> --kind \"web\" --retention-time <days_to_retain_logs> --workspace <log_analytics_workspace_ID> --subscription <subscription_ID>\n```\n\n### Remediate from PowerShell\n\n```powershell\nNew-AzApplicationInsights -Kind \"web\" -ResourceGroupName <rg_name> -Name <app insights name> -location <location> -RetentionInDays <INT days to retain logs> -SubscriptionID <subscription ID> -WorkspaceResourceId <log analytics workspace ID>\n```",
  "isEnabled": true,
  "severity": 1
}
