{
  "body": "The Azure Storage blobs contain data like ePHI and financial information, which can be secret or personal. Data that is erroneously modified or deleted accidentally by an application or other storage account user can cause data loss or unavailability.\n\nIt is recommended that Azure Containers with attached Blob Storage and standalone containers with Blob Storage be made recoverable by enabling the soft delete configuration. This saves and recovers data when blobs or blob snapshots are deleted.\n\n### Rationale\n\nContainers and Blob Storage data can be incorrectly deleted. An attacker or malicious user may do this deliberately to cause disruption. Deleting an Azure Storage blob causes immediate data loss. Enabling this configuration for Azure storage ensures that even if blobs/data were deleted from the storage account, the objects are recoverable for a particular time, which is the retention period, ranging from 7 to 365 days.\n\n### Impact\n\nAdditional storage costs may be incurred as snapshots are retained.\n\n### Default Value\n\nWhen a new storage account is created, soft delete for containers and blob storage are disabled by default.\n\n### References\n\n1. [https://docs.microsoft.com/en-us/azure/storage/blobs/storage-blob-soft-delete](https://docs.microsoft.com/en-us/azure/storage/blobs/storage-blob-soft-delete)\n2. [https://docs.microsoft.com/en-us/azure/storage/blobs/soft-delete-container-overview](https://docs.microsoft.com/en-us/azure/storage/blobs/soft-delete-container-overview)\n3. [https://docs.microsoft.com/en-us/azure/storage/blobs/soft-delete-container-enable?tabs=azure-portal](https://docs.microsoft.com/en-us/azure/storage/blobs/soft-delete-container-enable?tabs=azure-portal)",
  "name": "Ensure Soft Delete is Enabled for Azure Containers and Blob Storage",
  "slug": "azure-soft-delete-containers-blobs",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "azure"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "StorageAccount"
      ],
      "query": "azure-storage-accounts-without-soft-delete",
      "isManual": false
    }
  ],
  "remediationDescription": "### Azure portal\n\n1. Open the storage account in the Azure Portal using the `Open in Azure` button.\n2. Navigate to the `Data Protection` blade under `Data Management`\n3. Select `Enable soft delete for blobs` and `Enable soft delete for containers`.\n4. Enter the number of days you want to retain soft deleted data (between 7 and 365).\n\n### Azure CLI\n\nFor blobs:\n\n```bash\naz storage blob service-properties delete-policy update --days-retained <days> --account-name <storageAccountName> --enable true\n```\n\nFor containers:\n\n```bash\naz storage account blob-service-properties update --enable-container-delete-retention true --container-delete-retention-days <days> --account-name <storageAccountName> --resource-group <resourceGroup> --account-key <accountKey>\n ```",
  "isEnabled": true,
  "severity": 2
}
