{
  "name": " Ensure Key Vaults are Recoverable",
  "body": "Key vaults contain object keys, secrets and certificates. Accidental unavailability of a key vault can cause immediate data loss or loss of security functions (authentication, validation, verification, non-repudiation, etc.) supported by the key vault objects.\n\nIt is recommended that the key vault be made recoverable by enabling the \"Do Not Purge\" and \"Soft Delete\" functions. This is in order to prevent loss of encrypted data, including storage accounts, SQL databases, and/or dependent services provided by key vault objects (Keys, Secrets, Certificates) etc. This may happen in the case of accidental deletion by a user or from disruptive activity by a malicious user.\n\nWARNING: A current limitation of the soft-delete feature across all Azure services is role assignments disappearing when the Key Vault is deleted. All role assignments will need to be recreated after recovery.\n\n**Rationale**\n\nThere could be scenarios where users accidently run delete/purge commands on a key vault or a malicious user does it deliberately to cause disruption. Deleting or purging a Key Vault leads to immediate data loss as encrypted data and secrets and certificates allowing access to services will become non-accessible. There are 2 Key vault properties that play a role in the permanent unavailability of a key vault.\n\n1. `enableSoftDelete`:\n\nSetting this parameter to `true` for a key vault ensures that even if it is deleted, the key vault itself or its objects remain recoverable for the next 90 days. Key Vaults can be either recovered or purged (deleted permanently) during those 90 days. If no action is taken, the Key Vault and its objects will be purged.\n \n2. `enablePurgeProtection`:\n\n`enableSoftDelete` only ensures that the key vault is not deleted permanently and will be recoverable for 90 days from date of deletion. However, there are chances that the key vault and/or its objects are accidentally purged and hence will not be recoverable. Setting `enablePurgeProtection` to `true` ensures that the key vault and its objects cannot be purged.\n\nEnabling both the parameters on key vaults ensures that key vaults and their objects cannot be deleted/purged permanently.\n\n**Impact**\n\nOnce purge-protection and soft-delete aew enabled for a key vault, the action is irreversible.",
  "slug": "azure-key-vault-recoverable",
  "severity": 3,
  "rules": [
    {
      "cloudProviders": [
        "azure"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "KMSVault"
      ],
      "query": "azure-1-3-0-security-4-the-key-vault-is-recoverable"
    }
  ],
  "remediationDescription": "**From Azure Portal**\n\n1. Go to `Key vaults`\n2. For each `Key Vault`, under `Settings`, select `Properties`\n3. Ensure that the status of `Soft-delete` is `Soft delete has been enabled on this key vault`\n4. For `Purge protection`, select `Enable purge protection (enforce a mandatory retention period for deleted vaults and vault objects)`\n\n**Using Azure CLI**\n\n```bash\naz resource update --id <resourceID> --set properties.enablePurgeProtection=true properties.enableSoftDelete=true\n```\n\n**Using Azure PowerShell**\n\n```powershell\nUpdate-AzKeyVault -VaultName <vaultName> -ResourceGroupName <resourceGroupName> -EnablePurgeProtection\n```\n\n\n**Default Value**\n\nWhen a new key vault is created, both parameters `enableSoftDelete` and `enablePurgeProtection` are set to `null`, disabling both features.\n\n**References**\n\n1. [https://docs.microsoft.com/en-us/azure/key-vault/key-vault-soft-delete-cli](https://docs.microsoft.com/en-us/azure/key-vault/key-vault-soft-delete-cli)\n2. [https://blogs.technet.microsoft.com/kv/2017/05/10/azure-key-vault-recovery-options/](https://blogs.technet.microsoft.com/kv/2017/05/10/azure-key-vault-recovery-options/)\n3. [https://docs.microsoft.com/en-us/security/benchmark/azure/security-controls-v3-governance-strategy#gs-8-define-and-implement-backup-and-recovery-strategy](https://docs.microsoft.com/en-us/security/benchmark/azure/security-controls-v3-governance-strategy#gs-8-define-and-implement-backup-and-recovery-strategy)\n4. [https://docs.microsoft.com/en-us/security/benchmark/azure/security-controls-v3-data-protection#dp-8-ensure-security-of-key-and-certificate-repository](https://docs.microsoft.com/en-us/security/benchmark/azure/security-controls-v3-data-protection#dp-8-ensure-security-of-key-and-certificate-repository)\n\n**Additional Information**\n\nWhen a key is used for SQL server TDE (Transparent Data Encryption) or for encrypting a storage account, both features \"Do Not Purge\" and \"Soft Delete\" are enabled for the corresponding key vault by default by Azure Backend."
}