{"name":"Ensure that VHD's are encrypted","slug":"azure-1-3-0-vm-7","body":"VHD (Virtual Hard Disks) are stored in BLOB storage and are the old style disks that were attached to Virtual Machines, and the BLOB VHD was then leased to the VM. By Default storage accounts are not encrypted, and Azure Defender(Security Centre) would then recommend that the OS disks should be encrypted. Storage accounts can be encrypted as a whole using PMK or CMK and this should be turned on for storage accounts containing VHD's.\n\n**Rationale**\n\nWith the changes that have been made that recommend using managed disks that are encrypted by default, we need to also have a recommendation that \"legacy\" disk that may for a number of reasons need to be left as VHD's should also be encrypted to protect the data content.\n\n**Impact**\n\nDepending on how the encryption is implemented will change the size of the impact, if provider managed keys(PMK) are utilised the impact is relatively low, but processes need to be put in place to regularly rotate the keys. If Customer managed keys(CMK) are utilised a key management process needs to be implemented to store and manage key rotation and thus the impact is medium to high depending on user maturity with key management.","description":"","severity":3,"remediationDescription":"**From Azure Portal**\n\n1. Navigate to the `storage account` that you wish to encrypt\n2. Select the `encryption` option\n3. Select the `key type` that you wish to use\n\nIf you wish to use an azure managed key (the default), you can save at this point and encryption will be applied to the account.\n\nIf you select customer managed key it will ask for the location of the key (The default is an Azure Keyvault) and the key name.\n\nOnce these arecaptured, save the configuration and the account will be encrypted using the provided key.\n\n**Using Azure Command Line Interface**\n\n**Create the Keyvault**\n\n\u003e`az keyvault create --name \"myKV\" --resource-group \"myResourceGroup\" --location eastus --enabled-for-disk-encryption`\n\n**Encrypt the disk and store the key in keyvault**\n\n\u003e`az vm encryption enable -g MyResourceGroup --name MyVM --disk-encryption-keyvault myKV`\n\n**Using Azure Powershell**\n\nThis process uses a keyvault to store the keys\n\n**Create the Keyvault**\n\n\u003e`New-AzKeyvault -name MyKV -ResourceGroupName myResourceGroup -Location EastUS -EnabledForDiskEncryption`\n\n**Encrypt the disk and store the key in keyvault**\n\n\u003e`$KeyVault = Get-AzKeyVault -VaultName MyKV -ResourceGroupName MyResourceGroup`\n\u003e`Set-AzVMDiskEncryptionExtension -ResourceGroupName MyResourceGroup -VMName MyVM -DiskEncryptionKeyVaultUrl $KeyVault.VaultUri -DiskEncryptionKeyVaultId $KeyVault.ResourceId`\n\n**Default Value**\n\nThe default value for encryption is \"NO Encryption\" \n\n**References**\n\n1. CLI: [https://docs.microsoft.com/en-us/azure/virtual-machines/windows/disk-encryption-cli-quickstart](https://docs.microsoft.com/en-us/azure/virtual-machines/windows/disk-encryption-cli-quickstart)\n2. Powershell: [https://docs.microsoft.com/en-us/azure/virtual-machines/windows/disk-encryption-powershell-quickstart](https://docs.microsoft.com/en-us/azure/virtual-machines/windows/disk-encryption-powershell-quickstart)\n3. [https://docs.microsoft.com/en-us/azure/security/benchmarks/security-controls-v2-data-protection#dp-5-encrypt-sensitive-data-at-rest](https://docs.microsoft.com/en-us/azure/security/benchmarks/security-controls-v2-data-protection#dp-5-encrypt-sensitive-data-at-rest)\n","rules":null}