{
  "body": "### Description\n\n\r\n\r\nMulti-Factor Authentication (MFA) adds an extra layer of protection on top of a username and password. With MFA enabled, when a user logs in to Alibaba Cloud, they will be  prompted for their username and password, followed by an authentication code from their  virtual MFA device. It is recommended that MFA is enabled for all users that have a console password.\n\n\r\n\r\n\r\n### Rationale\n\n\r\n\r\nMFA requires users to verify their identities by entering two authentication factors. When MFA is enabled, an attacker faces at least two different authentication mechanisms. The additional security makes it harder for an attacker to gain access to protected resources or data.\n\n\r\n### References\n\n\r\n\r\n1. [http://tools.ietf.org/html/rfc6238](http://tools.ietf.org/html/rfc6238)\r\n2. [https://www.alibabacloud.com/help/doc-detail/93720.htm](https://www.alibabacloud.com/help/doc-detail/93720.htm)\r\n3. [https://www.alibabacloud.com/help/doc-detail/119555.htm](https://www.alibabacloud.com/help/doc-detail/119555.htm)",
  "name": "Ensure that multi-factor authentication is enabled for all RAM users that have a console password",
  "slug": "cis-alibaba-1-0-0-iam-4",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "alibaba"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "IAMUser"
      ],
      "query": "cis-alibaba-1-0-0-iam-4-multi-factor-authentication-is-enabled-for-all-ram-users-that-have-a-console-password",
      "returnPath": ""
    }
  ],
  "remediationDescription": "**Via the management console**\n\n\r\n\r\n1. Login to the [`RAM Console`](https://ram.console.aliyun.com/overview)\r\n2. Under `Identities`, choose `Users`\r\n3. In the `User Logon Name/Display Name`` column, click the username of each RAM user\r\n4. In the `Console Logon Management` section, click `Modify Logon Settings`\r\n5. Select `Enabled for Console Password Logon`, and `Required for Enable MFA`\r\n\r\nNote: After you select Enabled for Console Password Logon, and Required for Enable MFA when modifying the logon settings of a RAM user, the user can go to step 7 when logging on to the RAM console for the first time.\r\n\r\n6. In the MFA Device section, click `Enable the device`\r\n7. Download and install Google Authenticator on your mobile phone.\n\n\r\n\r\n    o For iOS: Install Google Authenticator from the App Store.\n\n\r\n\r\n    o For Android: Install Google Authenticator from the Google Play Store.\n\n\r\n\r\nNote: You need to install a QR code scanner from the Google Play Store for Google Authenticator to identify QR codes.\n\n\r\n\r\n8. Open Google Authenticator and tap `BEGIN SETUP`\n\n\r\n\r\n    o Tap Scan barcode and scan the QR code displayed on the `Scan the code` tab in the console.\n\n\r\n\r\n    o Tap `Manual entry`, enter the username and key, and then tap the check mark (√) icon.\n\n\r\n\r\nNote: You can obtain the username and key from the `Retrieval manually enter information` tab in the console.\n\n\r\n\r\n9. On the `Scan the code` tab, enter the two consecutive security codes obtained from Google Authenticator and click `Enable`.\n\n\r\n\r\nNote: The security code is refreshed at an interval of 30 seconds. For more information, see `Enable an MFA device for a RAM user`\r\n",
  "description": "",
  "severity": 2
}