{
  "alertForSecondaryOnly": false,
  "isEnabled": true,
  "isInsight": false,
  "name": "Ensure Image Vulnerability Scanning using Amazon ECR  image scanning or a third party provider",
  "slug": "ecr-ensure-scan-on-push-is-enabled",
  "body": "Scan images being deployed to Amazon EKS for vulnerabilities.\n\n**Rationale**\n\nVulnerabilities in software packages can be exploited by hackers or malicious users to \r\nobtain unauthorized access to local cloud resources. Amazon ECR and other third party \r\nproducts allow images to be scanned for known vulnerabilities.\n\n**Impact**\n\nIf you are utilizing AWS ECR\r\nThe following are common image scan failures. You can view errors like this in the \r\nAmazon ECR console by displaying the image details or through the API or AWS CLI by \r\nusing the DescribeImageScanFindings API.\r\nUnsupportedImageError You may get an UnsupportedImageError error when \r\nattempting to scan an image that was built using an operating system that Amazon ECR \r\ndoesn't support image scanning for. Amazon ECR supports package vulnerability \r\nscanning for major versions of Amazon Linux, Amazon Linux 2, Debian, Ubuntu, \r\nCentOS, Oracle Linux, Alpine, and RHEL Linux distributions. Amazon ECR does not \r\nsupport scanning images built from the Docker scratch image.\r\nAn UNDEFINED severity level is returned You may receive a scan finding that has a \r\nseverity level of UNDEFINED. The following are the common causes for this:\r\nThe vulnerability was not assigned a priority by the CVE source.\r\nThe vulnerability was assigned a priority that Amazon ECR did not recognize.\r\nTo determine the severity and description of a vulnerability, you can view the CVE \r\ndirectly from the source.\n\n**Audit**\n\nPlease follow AWS ECS or your 3rd party image scanning provider's guidelines for \r\nenabling Image Scanning\n\n```bash\r\naws ecr describe-repositories --repository-names $REPO_NAME --region \r$REGION_CODE\r\n```",
  "severity": 2,
  "remediationDescription": "To utilize AWS ECR for Image scanning please follow the steps below:\n\n\r\nTo create a repository configured for scan on push (AWS CLI)\n```bash\r\nws ecr create-repository --repository-name $REPO_NAME --image-scanning-configuration scanOnPush=true --region $REGION_CODE\r\n```\n\nTo edit the settings of an existing repository (AWS CLI)\n```bash\r\naws ecr put-image-scanning-configuration --repository-name $REPO_NAME --\rimage-scanning-configuration scanOnPush=true --region $REGION_CODE\r\n```\n\nUse the following steps to start a manual image scan using the AWS Management \r\nConsole.\r\n1. Open the Amazon ECR console at \r\nhttps://console.aws.amazon.com/ecr/repositories.\r\n2. From the navigation bar, choose the Region to create your repository in.\r\n3. In the navigation pane, choose Repositories.\r\n4. On the Repositories page, choose the repository that contains the image to scan.\r\n5. On the Images page, select the image to scan and then choose Scan.\n\n**References**\n\n1. [https://docs.aws.amazon.com/AmazonECR/latest/userguide/image-scanning.html](https://docs.aws.amazon.com/AmazonECR/latest/userguide/image-scanning.html)\n\r"
}