{
  "body": "Microsoft Azure provides a Global Banned Password policy for Azure administrative and normal user accounts. This is not applied to user accounts synced from an on-premise Active Directory unless Azure AD Connect is used, and you enable `EnforceCloudPasswordPolicyForPasswordSyncedUsers`. Please see the list of default values on the specifics of this policy. To further password security, it is recommended to further define a custom banned password policy. Organizational-specific terms can be added to the custom banned password list, such as the following examples:\n\n- Brand names\n- Product names\n- Locations, such as company headquarters\n- Company-specific internal terms\n- Abbreviations that have specific company meaning\n- Months and weekdays with your company's local languages\n\n### Rationale\n\nEnabling this gives your organization further customization on what secure passwords are allowed. Setting a bad password list enables your organization to fine-tune its password policy further, depending on your needs. Removing easy-to-guess passwords increases the security of access to your Azure resources.\n\n### Impact\n\nIncreasing the needed password complexity might increase the overhead of the administration of user accounts. The licensing requirements for the Global Banned Password List and Custom Banned Password list require Microsoft Entra ID P1 or P2. On-premises Active Directory Domain Services users not synchronized to Microsoft Entra ID also benefit from Microsoft Entra ID Password Protection based on existing licensing for synchronized users.\n\n### Default Value\n\nBy default, the custom bad password list is not 'Enabled'. The default Azure bad password policy is described [here](https://learn.microsoft.com/en-us/entra/identity/authentication/concept-password-ban-bad-combined-policy#microsoft-entra-password-policies).",
  "name": "Ensure that a Custom Bad Password List is set to 'Enforce' for your Organization",
  "slug": "entra-custom-bad-password-list",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "entra"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "Connector"
      ],
      "query": "entra-no-custom-password-policy"
    }
  ],
  "remediationDescription": "1. Open the [Security | Authentication methods | Password protection](https://portal.azure.com/#view/Microsoft_AAD_IAM/AuthenticationMethodsMenuBlade/~/PasswordProtection).\n2. Set the `Enforce custom list` option to `Yes`.\n3. Add the terms to the `Custom banned password list`.",
  "isEnabled": true,
  "severity": 1
}
