{
  "body": "Microsoft Entra ID Conditional Access allows an organization to configure `Named locations` and configure whether those locations are trusted or untrusted. These settings provide organizations the means to specify `Geographical locations` for use in conditional access policies, or define actual IP addresses and IP ranges and whether or not those IP addresses and/or ranges are trusted by the organization.\n\n### Rationale\n\nDefining trusted source IP addresses or ranges helps organizations create and enforce Conditional Access policies around those trusted or untrusted IP addresses and ranges. Users authenticating from trusted IP addresses and/or ranges may have fewer access restrictions or access requirements when compared to users who try to authenticate to Azure Active Directory from untrusted locations or untrusted source IP addresses/ranges.\n\n### Impact\n\nWhen configuring `Named locations`, the organization can create locations using Geographical location data or by defining source IP addresses or ranges. Configuring Named locations using a Country location does not provide the organization the ability to mark those locations as trusted, and any Conditional Access policy relying on those `Countries location` settings will not be able to use the `All trusted locations` setting within the Conditional Access policy. Instead, they will have to rely on the `Select locations` setting. This may add additional resource requirements when configuring and will require thorough organizational testing.\n\nIn general, Conditional Access policies may completely prevent users from authenticating to Azure Active Directory, and thorough testing is recommended. To avoid a complete lockout, a 'Break Glass' account with full Global Administrator rights is recommended in the event all other administrators are locked out of authenticating to Azure Active Directory. This 'Break Glass' account should be excluded from Conditional Access Policies and should be configured with the longest pass phrase feasible. This account should only be used in the event of an emergency and complete administrator lockout.\n\n### Default Value\n\nNo trusted locations are configured by default.",
  "name": "Ensure Trusted Locations Are Defined",
  "slug": "entra-trusted-locations",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "entra"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "Connector"
      ],
      "query": "entra-tenants-without-trusted-locations",
      "isManual": false
    }
  ],
  "remediationDescription": "### From Azure Portal\n\n1. Open [Conditional Access | Named locations](https://portal.azure.com/#view/Microsoft_AAD_ConditionalAccess/ConditionalAccessBlade/~/NamedLocations/fromNav/)\n3. Click on `IP ranges location`.\n4. Enter a name for this location setting in the `Name` text box.\n5. Click on the `+` sign.\n6. Add an IP Address Range in CIDR notation inside the text box that appears.\n7. Click on the `Add` button.\n8. Repeat steps 5 through 7 for each IP Range that needs to be added.\n9. If the information entered is trusted ranges, select the `Mark as trusted location` check box.\n10. Once finished, click on `Create`.\n\n### From PowerShell\n\nCreate a new trusted IP-based Named location policy:\n\n```bash\n[System.Collections.Generic.List`1[Microsoft.Open.MSGraph.Model.IpRange]]$ipR anges = @()\n$ipRanges.Add(\"<first IP range in CIDR notation>\")\n$ipRanges.Add(\"<second IP range in CIDR notation>\")\n$ipRanges.Add(\"<third IP range in CIDR notation>\") New-AzureADMSNamedLocationPolicy -OdataType \"#microsoft.graph.ipNamedLocation\" -DisplayName \"<name of IP Named location policy> -IsTrusted $true -IpRanges $ipRanges\n```\n\nSet an existing IP-based Named location policy to trusted:\n\n```bash\nSet-AzureADMSNamedLocationPolicy -PolicyId \"<ID of the policy>\" -OdataType \"#microsoft.graph.ipNamedLocation\" -IsTrusted $true\n```",
  "isEnabled": true,
  "severity": 1
}
