{
  "alertForSecondaryOnly": false,
  "isEnabled": true,
  "isInsight": false,
  "name": "Ensure Guest Users Are Reviewed on a Regular Basis (Manual)",
  "slug": "entra-review-guest-users",
  "body": "Microsoft Entra ID is extended to include Azure AD B2B collaboration, allowing you to invite people outside your organization to be guest users in your cloud account and sign in with their work, school, or social identities. Guest users allow you to share your company's applications and services with users from any other organization while maintaining control over your corporate data.\n\nWork with external partners, large or small, even if they don't have Azure AD or an IT department. A simple invitation and redemption process lets partners use their credentials to access your company's resources as guest users.\n\nGuest users in every subscription should be reviewed regularly to ensure that inactive and unneeded accounts are removed.\n\n### Rationale\n\nGuest users in the Microsoft Entra ID are generally required for collaboration purposes in Office 365 and may also be required for Azure functions in enterprises with multiple Azure tenants. Guest users are typically added outside your employee onboarding/offboarding process and could be overlooked indefinitely, leading to a potential vulnerability. To prevent this, guest users should be reviewed regularly. During this audit, guest users should also be determined not to have administrative privileges.\n\n### Impact\n\nBefore removing guest users, determine their use and scope. Like removing any user, there may be unforeseen consequences to systems if it is deleted.\n\n### Default Value\n\nBy default, there are no guest users.\n\n### Additional Information\n\nIt is good practice to use a dynamic security group to manage guest users.\n\nTo create the dynamic security group:\n\n1. Navigate to the `Microsoft Entra ID` blade in the Azure Portal\n2. Select the `Groups` item\n3. Create new\n4. Type of `dynamic`\n5. Use the following dynamic selection rule. `(user.userType -eq \"Guest\")`\n6. Once the group has been created, select access reviews option and create a new access review with a monthly period, and send it to relevant administrators for review.",
  "severity": 2,
  "remediationDescription": "The [Cyscale identity dashboard](https://app.cyscale.com/identity/persons) can simplify your review process.\n\n### From Azure Portal\n\n1. Open the [Entra ID Users page](https://portal.azure.com/#view/Microsoft_AAD_UsersAndTenants/UserManagementMenuBlade/~/AllUsers)\n4. Click on `Add filter`\n5. Select `User type`\n6. Select `Guest` from the Value drop-down\n7. Click `Apply`\n8. Delete all `Guest` users that are no longer required or are inactive\n\n### From Azure CLI\n\nBefore deleting the user, set it to inactive using the ID from the Audit Procedure to determine if there are any dependent systems.\n\n```bash\naz ad user update --id <exampleaccountid@domain.com> --account-enabled {false}\n```\n\nAfter determining that there are no dependent systems, delete the user.\n\n```bash\nRemove-AzureADUser -ObjectId <exampleaccountid@domain.com>\n```\n\n### From Azure PowerShell\n\nBefore deleting the user, set it to inactive using the ID from the Audit Procedure to determine if there are any dependent systems.\n\n```bash\nSet-AzureADUser -ObjectId \"<exampleaccountid@domain.com>\" -AccountEnabled false\n```\n\nAfter determining that there are no dependent systems, delete the user.\n\n```bash\nPS C:\\>Remove-AzureADUser -ObjectId <exampleaccountid@domain.com>\n```"
}
