{"name":"Ensure Stackdriver Monitoring is set to Enabled on Kubernetes Engine Clusters","slug":"gcp-kubernetes-2","body":"Stackdriver Monitoring to monitor signals and build operations in your Kubernetes Engine clusters. Stackdriver Monitoring can access metrics about CPU utilization, some disk traffic metrics, network traffic, and uptime information. Stackdriver Monitoring uses the Monitoring agent to access additional system resources and application services in virtual machine instances.\n\n**Rationale**\n\nBy Enabling Stackdriver Monitoring you will have system metrics and custom metrics. System metrics are measurements of the cluster's infrastructure, such as CPU or memory usage. For system metrics, Stackdriver creates a Deployment that periodically connects to each node and collects metrics about its Pods and containers, then sends the metrics to Stackdriver. Metrics for usage of system resources are collected from the CPU, Memory, Evictable memory, Non-evictable memory, and Disk sources.","description":"","severity":2,"remediationDescription":"**Using Console**\n\n1. Go to Kubernetes GCP Console by visiting [https://console.cloud.google.com/kubernetes/list?](https://console.cloud.google.com/kubernetes/list?)\n2. Select reported Kubernetes clusters for which monitoring is disabled\n3. Click on EDIT button and Set 'Stackdriver Monitoring' to Enabled\n\n**Using Command Line**\n\nTo enable monitoring for an existing cluster, run the following command:\n\n```bash\ngcloud container clusters update \\[CLUSTER_NAME\\] --zone \\[COMPUTE_ZONE\\] --monitoring-service monitoring.googleapis.com\n```\n\n**Impact**\n\nYou are charged for the accrued storage costs when you export logs to another Google Cloud Platform service, such as BigQuery. Exporting logs from Stackdriver has no Stackdriver charge.\n\n**Default Value**\n\nBy default, Stackdriver Monitoring is enabled when you create a new cluster using the gcloud command-line tool or Google Cloud Platform Console.\n\n**References**\n\n1. https://cloud.google.com/kubernetes-engine/docs/how-to/creating-a-container-cluster\n2. https://cloud.google.com/kubernetes-engine/docs/how-to/monitoring?hl=en_US\n3. https://cloud.google.com/monitoring/agent/\n\n**Notes**\n\nIf you are using Stackdriver Logging, Stackdriver Error Reporting, Debugging, or Stackdriver Trace, and you are not using any services from Stackdriver Monitoring, then you do not have to associate your GCP project with a Stackdriver account and you do not have to select a service tier. By default, Stackdriver limits the features available to your project to those features in the Basic Tier of service.","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-2-stackdriver-monitoring-is-set-to-enabled-on-kubernetes-engine-clusters","returnPath":""}]}