{"name":"Ensure that RDP access is restricted from the internet","slug":"gcp-networking-4","body":"GCP `Firewall Rules` are specific to a `VPC Network`. Each rule either `allows` or `denies` traffic when its conditions are met. Its conditions allow you to specify the type of traffic, such as ports and protocols, and the source or destination of the traffic, including IP addresses, subnets, and instances. Firewall rules are defined at the VPC network level, and are specific to the network in which they are defined. The rules themselves cannot be shared among networks. Firewall rules only support IPv4 traffic. When specifying a source for an ingress rule or a destination for an egress rule by address, you can only use an `IPv4` address or `IPv4 block in CIDR` notation. Generic `(0.0.0.0/0)` incoming traffic from internet to VPC or VM instance using `RDP` on `Port 3389` can be avoided.\n\n**Rationale**\n\nGCP `Firewall Rules` within a `VPC Network`. These rules apply to outgoing (egress) traffic from instances and incoming (ingress) traffic to instances in the network. Egress and ingress traffic are controlled even if the traffic stays within the network (for example, instance-to-instance communication). For an instance to have outgoing Internet access, the network must have a valid Internet gateway route or custom route whose destination IP is specified. This route simply defines the path to the Internet, to avoid the most general `(0.0.0.0/0)` destination `IP Range` specified from Internet through `RDP` with default `Port 3389`. We need to restrict generic access from Internet to specific IP Range.","description":"","severity":3,"remediationDescription":"**From Console**\n\n1. Go to `VPC Network`.\n2. Go to the `Firewall Rules`.\n3. Click the `Firewall Rule` you want to modify.\n4. Click `Edit`.\n5. Modify `Source IP ranges` to specific `IP`.\n6. Click `Save`.\n\n**Via CLI gcloud **\n\n1. Update Firewall rule with new `SOURCE_RANGE` from below command: \n\n```bash\ngcloud compute firewall-rules update FirewallName --allow=[PROTOCOL[:PORT[-PORT]]] --source-range=[CIDR_RANGE]\n```\n\n**Impact**\n\nAll RDP connections from outside of the network to the concerned VPC(s) will be blocked. There could be a business need where rdp access is required from outside of the network to access resources associated with the VPC. In that case, specific source IP(s) should be mentioned in firewall rules to white-list access to RDP port for the concerned VPC(s).\n\n**References**\n\n1. https://cloud.google.com/vpc/docs/firewalls#blockedtraffic\n\n**Notes**\n\nCurrently GCP VPC only supports IPV4 however, Google is already working on adding IPV6 support for VPC. In that case along with source IP range `0.0.0.0`, rule should be checked for IPv6 equivalent `::0` as well.","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Firewall"],"query":"gcp-networking-4-rdp-access-is-restricted-from-the-internet","returnPath":""}]}