{"name":"Ensure Kubernetes Cluster is created with Alias IP ranges enabled","slug":"gcp-kubernetes-13","body":"Google Cloud Platform Alias IP Ranges lets you assign ranges of internal IP addresses as aliases to a virtual machine's network interfaces. This is useful if you have multiple services running on a VM and you want to assign each service a different IP address.\n\n**Rationale**\n\nWith Alias IPs ranges enabled, Kubernetes Engine clusters can allocate IP addresses from a CIDR block known to Google Cloud Platform. This makes your cluster more scalable and allows your cluster to better interact with other GCP products and entities. Using Alias IPs has several benefits:\n\n- Pod IPs are reserved within the network ahead of time, which prevents conflict with other compute resources.\n- The networking layer can perform anti-spoofing checks to ensure that egress traffic is not sent with arbitrary source IPs.\n- Firewall controls for Pods can be applied separately from their nodes.\n- Alias IPs allow Pods to directly access hosted services without using a NAT gateway.","description":"","severity":1,"remediationDescription":"**Using Console**\n\n1. Go to Kubernetes GCP Console by visiting\nhttps://console.cloud.google.com/kubernetes/list?\n2. Click on `CREATE CLUSTER`\n3. Choose required name/value for cluster fields\n4. Click on `More`\n5. Set `VPC native (using alias IP)` to `Enabled`\n6. Click on `Create`\n\n**Using Command Line**\n\nTo enable Alias IP for an existing cluster, run the following command:\n\n```bash\ngcloud container clusters create \\[CLUSTER_NAME\\] --zone \\[COMPUTE_ZONE\\] --enable-ip-alias\n```\n\n**Impact**\n\nYou cannot currently migrate an existing cluster that uses routes for Pod routing to a cluster that uses Alias IPs. Cluster IPs for internal Services remain only available from within the cluster. If you want to access a Kubernetes Service from within the VPC, but from outside of the cluster, use an internal load balancer.\n\n**Default Value**\n\nBy default, VPC native (using alias IP) is enabled when you create a new cluster.\n\n**References**\n\n1. https://cloud.google.com/kubernetes-engine/docs/how-to/alias-ips\n2. https://cloud.google.com/vpc/docs/alias-ip\n","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-13-kubernetes-cluster-is-created-with-alias-ip-ranges-enabled","returnPath":""}]}