{
  "body": "Enabling the `log_disconnections` setting logs the end of each session, including the session duration.\n\n**Rationale**\n\nPostgreSQL does not log attempted connections by default. Enabling the `log_disconnections` setting will create log entries at the end of each session, which can be useful in troubleshooting issues and to determine any unusual connection attempts to the server. The `log_disconnections` and `log_connections` flags work hand in hand and, generally, the pair would be enabled/disabled together. This recommendation is applicable to PostgreSQL database instances.\n\n**Impact**\n\nTurning on logging will increase the required storage over time. Mismanaged logs may cause your storage costs to increase. Setting custom flags via command line on certain instances will cause all omitted flags to be reset to defaults. This may cause you to lose custom flags and could result in unforeseen complications or instance restarts. Because of this, it is recommended you apply these flags changes during a period of low usage.",
  "name": "Ensure the 'log_disconnections' database flag for Cloud SQL PostgreSQL instance is set to 'On'",
  "slug": "gcp-log-disconnections-db-flag-postgresql",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "query": "gcp-1-1-0-sql-2-3-the-log-disconnections-database-flag-for-cloud-sql-postgresql-instance-is-set-to-on",
      "subjects": [
        "CloudSQLInstance"
      ],
      "isManual": false,
      "applicableAssetsQuery": "query ($options: CloudSQLInstanceOptions, $failedAssetsIdentifiers: [ID!]) {\n  cloudSqlInstances(\n    options: $options\n    where: {\n      NOT: { identifier_IN: $failedAssetsIdentifiers }\n      engine: \"postgresql\"\n    }\n  ) {\n    ...AssetFragment\n  }\n}"
    }
  ],
  "remediationDescription": "**From Google Cloud Console**\n\n1. Go to the `Cloud SQL Instances` page in the Google Cloud Console by visiting https://console.cloud.google.com/sql/instances\n2. Select the PostgreSQL instance where the database flag needs to be enabled\n3. Click `EDIT`\n4. Scroll down to the `Flags` section\n5. To set a flag that has not been set on the instance before, click `ADD A DATABASE FLAG`, choose the flag `log_disconnections` from the drop-down menu, and set its value to `on`\n6. Click `SAVE`\n7. Confirm the changes under `Flags` on the `Overview` page\n\n**Using Google Cloud CLI**\n\nConfigure the `log_disconnections` database flag for every Cloud SQL PostgreSQL database instance using the below command.\n\n```bash\ngcloud sql instances patch <instanceName> --database-flags log_disconnections=on\n```\n\nNote: This command will overwrite all database flags that were previously set. To keep those and add new ones, include the values for all flags to be set on the instance; any flag not specifically included is set to its default value. For flags that do not take a value, specify the flag name followed by an equals sign (\"=\").\n\n**Default Value**\n\nBy default `log_disconnections` is `off`.\n\n**References**\n\n1. [https://cloud.google.com/sql/docs/postgres/flags](https://cloud.google.com/sql/docs/postgres/flags)\n2. [https://www.postgresql.org/docs/9.6/runtime-config-logging.html#RUNTIME-CONFIG-LOGGING-WHAT](https://www.postgresql.org/docs/9.6/runtime-config-logging.html#RUNTIME-CONFIG-LOGGING-WHAT)\n\n**Additional information**\n\nWARNING: This patch modifies database flag values, which may require the instance to be restarted. Check the list of supported flags https://cloud.google.com/sql/docs/postgres/flags - to see if your instance will be restarted when this patch is submitted.\n\nNote: Some database flag settings can affect instance availability or stability, and remove the instance from the Cloud SQL SLA. For information about these flags, see Operational Guidelines.\n\nNote: Configuring the above flag restarts the Cloud SQL instance.",
  "isEnabled": true,
  "severity": 1
}
