{
  "body": "Storage Access Logging generates a log that contains access records for each request made to the Storage bucket. An access log record contains details about the request, such as the request type, the resources specified in the request worked, and the time and date the request was processed. Cloud Storage offers access logs and storage logs in the form of CSV files that can be downloaded and used for analysis/incident response. Access logs provide information for all of the requests made on a specified bucket and are created hourly, while the daily storage logs provide information about the storage consumption of that bucket for the last day. The access logs and storage logs are automatically created as new objects in a bucket that you specify. An access log record contains details about the request, such as the request type, the resources specified in the request worked, and the time and date the request was processed. While storage Logs helps to keep track the amount of data stored in the bucket. It is recommended that storage Access Logs and Storage logs are enabled for every Storage Bucket.\n\n**Rationale**\n\nBy enabling access and storage logs on target Storage buckets, it is possible to capture all events which may affect objects within target buckets. Configuring logs to be placed in a separate bucket allows access to log information which can be useful in security and incident response workflows.\n\nIn most cases, Cloud Audit Logging is the recommended method for generating logs that track API operations performed in Cloud Storage:\n\n- Cloud Audit Logging tracks access on a continuous basis.\n- Cloud Audit Logging produces logs that are easier to work with.\n- Cloud Audit Logging can monitor many of your Google Cloud Platform services, not just Cloud Storage.\n\nIn some cases, you may want to use access & storage logs instead. \n\nYou most likely want to use access logs if:\n\n- You want to track access for public objects.\n- You use Access Control Lists (ACLs) to control access to your objects.\n- You want to track changes made by the Object Lifecycle Management feature.\n- You want your logs to include latency information, or the request and response size of individual HTTP requests.\n\nYou most likely want to use storage logs if:\n\n- You want to track the amount of data stored in your buckets.",
  "name": "Ensure that logging is enabled for Cloud Storage buckets",
  "slug": "gcp-storage-2",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "Bucket"
      ],
      "query": "gcp-storage-2-logging-is-enabled-for-cloud-storage-buckets",
      "returnPath": ""
    }
  ],
  "remediationDescription": "**Using Gsutils**\n\nTo set Storage Access Logs and Storage logs for a bucket run:\n\n`﻿``bash\ngsutil logging set on -b gs://<bucketName for a bucket used to store logs> gs://<your bucket name>\n```\n\n**Default Value**\n\nBy Default, Access logs and storage logs are not enabled for storage buckets.\n\n**References**\n\n1. https://cloud.google.com/storage/docs/access-logs",
  "description": "",
  "severity": 2
}