{"name":"Ensure Container-Optimized OS (cos) is used for Kubernetes Engine Clusters Node image","slug":"gcp-kubernetes-9","body":"Container-Optimized OS is an operating system image for your Compute Engine VMs that is optimized for running Docker containers. With Container-Optimized OS, you can bring up your Docker containers on Google Cloud Platform quickly, efficiently, and securely.\n\n**Rationale**\n\nThe Container-Optimized OS node image is based on a recent version of the Linux kernel and is optimized to enhance node security. It is backed by a team at Google that can quickly patch it for security and iterate on features. The Container-Optimized OS image provides better support, security, and stability than previous images. Container-Optimized OS requires Kubernetes version 1.4.0 or higher.\n\nEnabling Container-Optimized OS provides the following benefits:\n\n- Run Containers Out of the Box: Container-Optimized OS instances come pre- installed with the Docker runtime and cloud-init. With a Container-Optimized OS instance, you can bring up your Docker container at the same time you create your VM, with no on-host setup required.\n- Smaller attack surface: Container-Optimized OS has a smaller footprint, reducing your instance's potential attack surface.\n- Locked-down by default: Container-Optimized OS instances include a locked-down firewall and other security settings by default.\n- Automatic Updates: Container-Optimized OS instances are configured to automatically download weekly updates in the background; only a reboot is necessary to use the latest updates.","description":"","severity":1,"remediationDescription":"**Using Console**\n\n1. Go to Kubernetes GCP Console by visiting\nhttps://console.cloud.google.com/kubernetes/list?\n2. Select Kubernetes clusters for which Container-Optimized OS (cos) is not used\n3. Click on EDIT button and Set Node image to Container-Optimized OS under Node\nPools section\n\n**Using Command Line**\n\nTo enable Automatic node upgrades for an existing cluster's node pool, run the following command:\n\n```bash\ngcloud container clusters upgrade --image-type cos \\[CLUSTER_NAME\\] --zone \\[COMPUTE_ZONE\\] --node-pool \\[POOL_NAME\\]\n```\n\n**Impact**\n\nUpgrade operation is long-running and will block other operations on the cluster (including delete) until it has run to completion.\n\n**Default Value**\n\nContainer-Optimized OS is the default option for a cluster node image.\n\n**References**\n\n1. https://cloud.google.com/kubernetes-engine/docs/concepts/node-images 2. https://cloud.google.com/container-optimized-os/docs/\n\n**Notes**\n\nContainer-Optimized OS is still under active development, and some of the features and limitations below are subject to change by Google, and functionality should improve in future versions.","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-9-container-optimized-os-cos-is-used-for-kubernetes-engine-clusters-node-image","returnPath":""}]}