{"name":"Ensure that IP forwarding is not enabled on Instances","slug":"gcp-vm-5","body":"Compute Engine instance cannot forward a packet unless the source IP address of the packet matches the IP address of the instance. Similarly, GCP won't deliver a packet whose destination IP address is different than the IP address of the instance receiving the packet. However, both capabilities are required if you want to use instances to help route packets.\n\nForwarding of data packets should be disabled to prevent data loss or information disclosure.\n\n**Rationale**\n\nCompute Engine instance cannot forward a packet unless the source IP address of the packet matches the IP address of the instance. Similarly, GCP won't deliver a packet whose destination IP address is different than the IP address of the instance receiving the packet. However, both capabilities are required if you want to use instances to help route packets. To enable this source and destination IP check, disable the canIpForward field, which allows an instance to send and receive packets with non-matching destination or source IPs.","description":"","severity":2,"remediationDescription":"**Using Console**\n\n1. Go to the `Compute Engine`\n2. Go to `VM Instances`\n3. Select the `VM Instance`.\n4. Click `Delete` button.\n\n**Via CLI gcloud **\n\n```bash\ngcloud compute instances delete `\u003cVM_Name\u003e`\n```\n\nAs you can only set the `canIpForward` field at instance creation time. After an instance is created, the field becomes read-only. Therefore delete the VM instance where `canIpForward` is set to `true`.\n\nAnd create a new VM Instance with IP forwarding is set to Off\n\n1. Go to `Compute Engine`\n2. Click the `Create instance` button.\n3. Click Management, disk, networking, SSH keys.\n4. Click `Networking`.\n5. Click on the specific `Network interfaces`\n6. Ensure `IP forwarding` is set to `off`.\n7. Specify any other instance parameters you desire.\n8. Click Create.\n\n**Impact**\n\nDeleting instance(s) acting as routers/packet forwarders may break the network connectivity.\n\n**References**\n\n1. https://cloud.google.com/compute/docs/networking#canipforward\n\n**Notes**\n\nYou can only set the `canIpForward` field at instance creation time. After an instance is created, the field becomes read-only.\n","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["VM"],"query":"gcp-vm-5-ip-forwarding-is-not-enabled-on-instances","returnPath":""}]}