{
  "alertForSecondaryOnly": false,
  "isInsight": false,
  "name": "Ensure 'user options' database flag for Cloud SQL SQL Server instance is not configured",
  "slug": "gcp-user-options-flag-db-sqlserver",
  "body": "It is recommended that the `user options` database flag for a Cloud SQL SQL Server instance is not configured.\n\n**Rationale**\n\nThe `user options` flag specifies global defaults for all users. A list of default query processing options is established for the duration of a user's work session. The `user options` option allows you to change the default values of the SET options (if the server's default settings are not appropriate).\n\nA user can override these defaults by using the SET statement. You can configure user options dynamically for new logins. After you change the setting of user options, new login sessions use the new setting; current login sessions are not affected. This recommendation is applicable to SQL Server database instances.\n\n**Impact**\n\nSetting custom flags via command line on certain instances will cause all omitted flags to be reset to defaults. This may cause you to lose custom flags and could result in unforeseen complications or instance restarts. Because of this, it is recommended you apply these flags changes during a period of low usage.",
  "severity": 2,
  "remediationDescription": "**From Google Cloud Console**\n\n1. Go to the `Cloud SQL Instances` page in the Google Cloud Console by visiting https://console.cloud.google.com/sql/instances\n2. Select the SQL Server instance where the database flag needs to be enabled\n3. Click `EDIT`\n4. Scroll down to the `Flags` section\n5. Click the bin icon next to the `user options` flag to remove it\n6. Click `SAVE`\n7. Confirm the changes under `Flags` on the `Overview` page\n\n**Using Google Cloud CLI**\n\n1. List all Cloud SQL database instances:\n\n```bash\ngcloud sql instances list\n```\n\n2. Clear the `user options` database flag for every Cloud SQL SQL Server instance using either of the commands below:\n\n2.1 Clear all flags to their default value\n\n```bash\ngcloud sql instances patch <instanceName> --clear-database-flags\n```\n\nOR\n\n2.2 To clear only the `user options` database flag, configure the database flags and override the `user options`. Exclude the `user options` flag and its value, and keep all other flags you want to configure.\n\n```bash\ngcloud sql instances patch <instanceName> --database-flags [FLAG1=VALUE1,FLAG2=VALUE2]\n```\n\nThis command will overwrite all database flags previously set. To keep those and add new ones, include the values for all flags you want set on the instance; any flag not specifically included is set to its default value. For flags that do not take a value, specify the flag name followed by an equals sign (\"=\").\n\n**Default Value**\n\nBy default 'user options' is not configured.\n\n**References**\n\n1. [https://cloud.google.com/sql/docs/sqlserver/flags](https://cloud.google.com/sql/docs/sqlserver/flags)\n2. [https://docs.microsoft.com/en-us/sql/database-engine/configure-windows/configure-the-user-connections-server-configuration-option?view=sql-server-ver15](https://docs.microsoft.com/en-us/sql/database-engine/configure-windows/configure-the-user-connections-server-configuration-option?view=sql-server-ver15)\n3. [https://www.stigviewer.com/stig/ms_sql_server_2016_instance/2018-03-09/finding/V-79119](https://www.stigviewer.com/stig/ms_sql_server_2016_instance/2018-03-09/finding/V-79119)\n\n**Additional information**\n\nWARNING: This patch modifies database flag values, which may require the instance to be restarted. Check the list of supported flags https://cloud.google.com/sql/docs/sqlserver/flags - to see if your instance will be restarted when this patch is submitted.\n\nNote: Configuring the above flag restarts the Cloud SQL instance.",
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "CloudSQLInstance"
      ],
      "query": "gcp-query-user-options-flag-db-sqlserver"
    }
  ]
}