{
  "body": "Flow Logs is a feature that enables you to capture information about the IP traffic going to and from network interfaces in your VPC Subnets. After you've created a flow log, you can view and retrieve its data in Stackdriver Logging. It is recommended that Flow Logs be enabled for every business critical VPC subnet.\n\n**Rationale**\n\nVPC networks and subnetworks provide logically isolated and secure network partitions where you can launch GCP resources. When Flow Logs is enabled for a subnet, VMs within subnet starts reporting on all TCP and UDP flows. Each VM samples the TCP and UDP flows it sees, inbound and outbound, whether the flow is to or from another VM, a host in your on-premises datacenter, a Google service, or a host on the Internet. If two GCP VMs are communicating, and both are in subnets that have VPC Flow Logs enabled, both VMs report the flows.\n\nFlow Logs supports following use cases:\n\n- Network monitoring\n- Understanding network usage and optimizing network traffic expenses\n- Network forensics\n- Real-time security analysis\n\nFlow Logs provide visibility into network traffic for each VM inside the subnet and can be used to detect anomalous traffic or insight during security workflows.\n\nThe Flow Logs must be configured such that all network traffic is logged, the interval of logging is granular to provide detailed information on the connections, no logs are filtered, and metadata to facilitate investigations are included.\n\nNote: Subnets reserved for use by internal HTTP(S) load balancers do not support VPC flow logs.\n\n**Impact**\n\nStandard pricing for Stackdriver Logging, BigQuery, or Cloud Pub/Sub applies. VPC Flow Logs generation will be charged starting in GA as described in reference: [https://cloud.google.com/vpc/](https://cloud.google.com/vpc/)",
  "name": "Ensure VPC Flow logs is enabled for every subnet in a VPC Network",
  "slug": "gcp-networking-6",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "VPC"
      ],
      "query": "gcp-networking-6-vpc-flow-logs-is-enabled-for-every-subnet-in-a-vpc-network",
      "returnPath": ""
    }
  ],
  "remediationDescription": "**Using Console**\n\n1. Go to VPC network: [https://console.cloud.google.com/networking/networks/list](https://console.cloud.google.com/networking/networks/list)\n2. Navigate to the `SUBNETS IN CURRENT PROJECT` tab, and select a subnet to go to its `Subnet details` page\n3. Click on the `EDIT` button\n4. Set Flow Logs to `On`\n5﻿. Expand the `Configure Logs` section\n6﻿. Set the `Aggregation Interval` to `5 SEC`\n7﻿. Check the `Include metadata ` checkbox\n8﻿. Set the `Sample rate` to `100`\n9. Click on `SAVE`\n\nNote: It is not possible to configure a Log filter from the console.\n\n**Using Command Line**\n\nTo enable VPC Flow Logs for a network subnet, run the following command:\n\n```bash\ngcloud compute networks subnets update [subnetName] --region [region] --enable-flow-logs --logging-aggregation-interval=interval-5-sec --loggingflow-sampling=1 --logging-metadata=include-all\n```\n\n**Default Value**\n\nBy default, `Flow Logs` is set to `Off` when you create a new VPC network subnet.\n\n**References**\n\n1. [https://cloud.google.com/vpc/docs/using-flow-logs#enabling_vpc_flow_logging] (https://cloud.google.com/vpc/docs/using-flow-logs#enabling_vpc_flow_logging)\n2. [https://cloud.google.com/vpc/](https://cloud.google.com/vpc/)",
  "description": "",
  "severity": 2
}