{"name":"Ensure Private Google Access is set on Kubernetes Engine Cluster Subnets","slug":"gcp-kubernetes-16","body":"Private Google Access enables your cluster hosts, which have only private IP addresses, to communicate with Google APIs and services using an internal IP address rather than an external IP address. External IP addresses are routable and reachable over the Internet. Internal (private) IP addresses are internal to Google Cloud Platform and are not routable or reachable over the Internet. You can use Private Google Access to allow VMs without Internet access to reach Google APIs, services, and properties that are accessible over HTTP/HTTPS.\n\n**Rationale**\n\nVPC networks and subnetworks provide logically isolated and secure network partitions where you can launch GCP resources. When Private Google Access is enabled, VM instances in a subnet can reach the Google Cloud and Developer APIs and services without needing an external IP address. Instead, VMs can use their internal IP addresses to access Google managed services. Instances with external IP addresses are not affected when you enable the ability to access Google services from internal IP addresses. These instances can still connect to Google APIs and managed services.\n","description":"","severity":2,"remediationDescription":"**Using Console**\n\n1. Go to Kubernetes GCP Console visiting\nhttps://console.cloud.google.com/kubernetes/list\n2. From the list of clusters, for each clusters note the `Subnet` name\n3. Go to VPC network GCP Console visiting\nhttps://console.cloud.google.com/networking/networks/list\n4. Click noted subnet, The `Subnet details` page is displayed\n5. Click on Edit button\n6. Set `Private Google access` to `On`\n7. Click on Save\n\n**Using Command Line**\n\nTo set Private Google access for a network subnet, run the following command:\n\n```bash\ngcloud compute networks subnets update \\[SUBNET_NAME\\] --region \\[REGION\\] --enable-private-ip-google-access\n```\n\n**Impact**\n\nInstances with external IP addresses are not affected when you enable the ability to access Google services from internal IP addresses. These instances can still connect to Google APIs and managed services.\n\n**Default Value**\n\nBy default, Private Google access is set to Off when you create a new cluster/cluster subnetwork.\n\n**References**\n\n1. https://cloud.google.com/vpc/docs/configure-private-google-access\n2. https://cloud.google.com/vpc/docs/private-google-access","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-16-private-google-access-is-set-on-kubernetes-engine-cluster-subnets","returnPath":""}]}