{
  "alertForSecondaryOnly": false,
  "slug": "gcp-dnssec-enabled-cloud-dns",
  "body": "Cloud Domain Name System (DNS) is a fast, reliable and cost-effective domain name system that powers millions of domains on the internet. Domain Name System Security Extensions (DNSSEC) in Cloud DNS enables domain owners to take easy steps to protect their domains against DNS hijacking and man-in-the-middle and other attacks.\n\n**Rationale**\n\nDomain Name System Security Extensions (DNSSEC) adds security to the DNS protocol by enabling DNS responses to be validated. Having a trustworthy DNS that translates a domain name like www.example.com into its associated IP address is an\nincreasingly important building block of today's web-based applications. Attackers can hijack this process of domain/IP lookup and redirect users to a malicious site through DNS hijacking and man-in-the-middle attacks. DNSSEC helps mitigate the risk of such attacks by cryptographically signing DNS records. As a result, it prevents attackers from issuing fake DNS responses that may misdirect browsers to nefarious websites.\n",
  "name": "Ensure DNSSEC is enabled for Cloud DNS",
  "severity": 2,
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "ManagedZone"
      ],
      "query": "gcp-1-1-0-networking-3-dnssec-is-enabled-for-cloud-dns"
    }
  ],
  "remediationDescription": "**From Google Cloud Console**\n\n1. Go to Cloud DNS by visiting https://console.cloud.google.com/netservices/dns/zones.\n2. For each zone of `Type Public`, set `DNSSEC` to `On`.\n\n**Using Google Cloud CLI**\n\nUse the below command to enable DNSSEC for Cloud DNS Zone Name.\n\n```bash\ngcloud dns managed-zones update <zoneName> --dnssec-state on\n```\n\n**Default value**\n\nBy default DNSSEC is not enabled.\n\n**References**\n\n1. [https://cloudplatform.googleblog.com/2017/11/DNSSEC-now-available-in-Cloud-DNS.html](https://cloudplatform.googleblog.com/2017/11/DNSSEC-now-available-in-Cloud-DNS.html)\n2. [https://cloud.google.com/dns/dnssec-config#enabling](https://cloud.google.com/dns/dnssec-config#enabling)\n3. [https://cloud.google.com/dns/dnssec](https://cloud.google.com/dns/dnssec)"
}