{
  "alertForSecondaryOnly": false,
  "name": "Ensure ‘skip_show_database’ database flag for Cloud SQL MySQL instance is set to ‘On’",
  "slug": "gcp-skip-show-db-flag-mysql",
  "severity": 1,
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "CloudSQLInstance"
      ],
      "query": "gcp-query-local-infile-db-flag-mysql"
    }
  ],
  "body": "It is recommended to set the `skip_show_database` database flag for a Cloud SQL MySQL instance to `on`.\n\n**Rationale**\n\nThe `skip_show_database` flag prevents users from using the SHOW DATABASES statement if they do not have the SHOW DATABASES privilege. This can improve security if you have concerns about users being able to see databases belonging to other users. Its effect depends on the SHOW DATABASES privilege: If the variable value is ON, the SHOW DATABASES statement is permitted only to users who\nhave the SHOW DATABASES privilege, and the statement displays all database names. If the value is OFF, SHOW DATABASES is permitted to all users, but displays the names of only those databases for which the user has the SHOW DATABASES or other privilege. This recommendation is applicable to MySQL database instances.",
  "remediationDescription": "**From Google Cloud Console**\n\n1. Go to the `Cloud SQL Instances` page in the Google Cloud Console by visiting https://console.cloud.google.com/sql/instances.\n2. Select the MySQL instance where the database flag needs to be enabled.\n3. Click `Edit`.\n4. Scroll down to the `Flags` section.\n5. To set a flag that has not been set on the instance before, click `Add item`, choose the flag `skip_show_database` from the drop-down menu, and set its value to `on`.\n6. Click Save.\n7. Confirm the changes under `Flags` on the `Overview` page\n\n**Using Google Cloud CLI**\n\n1. List all Cloud SQL database instances using the following command:\n\n```bash\ngcloud sql instances list\n```\n\n2. Configure the `skip_show_database` database flag for every Cloud SQL Mysql database instance using the below command:\n\n```bash\ngcloud sql instances patch <instanceName> --database-flags skip_show_database=on\n```\n\nNote: This command will overwrite all database flags that were previously set. To keep those and add new ones, include the values for all flags to be set on the instance; any flag not specifically included is set to its default value. For flags that do not take a value, specify the flag name followed by an equals sign (\"=\").\n\n**Default Value**\n\nBy default `skip_show_database` is `off`.\n\n**References**\n\n1. [https://cloud.google.com/sql/docs/mysql/flags](https://cloud.google.com/sql/docs/mysql/flags)\n2. [https://dev.mysql.com/doc/refman/5.7/en/server-system-variables.html#sysvar_skip_show_database](https://dev.mysql.com/doc/refman/5.7/en/server-system-variables.html#sysvar_skip_show_database)\n\n**Additional information**\n\nWARNING: This patch modifies database flag values, which may require the instance to be restarted. Check the list of supported flags https://cloud.google.com/sql/docs/mysql/flags - to see if your instance will be restarted when this patch is submitted.\n\nNote: Some database flag settings can affect instance availability or stability, and remove the instance from the Cloud SQL SLA. For information about these flags, see Operational Guidelines.\n\nNote: Configuring the above flag restarts the Cloud SQL instance."
}