{
  "body": "It is recommended to set `cross db ownership chaining` database flag for Cloud SQL Server instance to off.\n\n**Rationale**\n\nUse the `cross db ownership chaining` option to configure cross-database ownership chaining for an instance of Microsoft SQL Server. This server option allows you to control cross-database ownership chaining at the database level or to allow crossdatabase ownership chaining for all databases. Enabling `cross db ownership` is not recommended unless all of the databases hosted by the instance of SQL Server must participate in cross-database ownership chaining and you are aware of the security implications of this setting. This recommendation is applicable to SQL Server database instances.\n\n**Impact**\n\nUpdating flags may cause the database to restart. This may cause it to unavailable for a short amount of time, so this is best done at a time of low usage. You should also determine if the tables in your databases reference another table without using credentials for that database, as turning off cross database ownership will break this relationship.",
  "name": "Ensure the 'cross db ownership chaining' database flag for Cloud SQL on the SQL Server instance is set to 'Off'",
  "slug": "gcp-cross-db-ownership-chaining-db-flag-sqlserver",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "CloudSQLInstance"
      ],
      "query": "gcp-1-1-0-sql-3-1-the-cross-db-ownership-chaining-database-flag-for-cloud-sql-on-the-sql-server-instance-is-set-to-off",
      "applicableAssetsQuery": "query ($options: CloudSQLInstanceOptions, $failedAssetsIdentifiers: [ID!]) {\n  cloudSqlInstances(\n    options: $options\n    where: {\n      NOT: { identifier_IN: $failedAssetsIdentifiers }\n      engine: \"sqlserver\"\n    }\n  ) {\n    ...AssetFragment\n  }\n}",
      "isManual": false
    }
  ],
  "remediationDescription": "**From Google Cloud Console**\n\n1. Go to the `Cloud SQL Instances` page in the Google Cloud Console by visiting https://console.cloud.google.com/sql/instances\n2. Select the SQL SERVER instance where the database flag needs to be enabled\n3. Click `EDIT`\n4. Scroll down to the `Flags` section\n5. To set a flag that has not been set on the instance before, click `ADD A DATABASE FLAG`, choose the flag `cross db ownership chaining` from the drop-down menu, and set its value to `off`\n6. Click `SAVE`\n7. Confirm the changes under `Flags` on the `Overview` page\n\n**Using Google Cloud CLI**\n\nConfigure the `cross db ownership chaining` database flag for every Cloud SQL SQL SERVER database instance using the below command.\n\n```bash\ngcloud sql instances patch <instanceName> --database-flags \"cross db ownership chaining=off\"\n```\n\nNote: This command will overwrite all database flags that were previously set. To keep those and add new ones, include the values for all flags to be set on the instance; any flag not specifically included is set to its default value. For flags that do not take a value, specify the flag name followed by an equals sign (\"=\").\n\n**Default Value**\n\nAs you have to manually turn on this flag, the default value for this is 'On'. Though you would have had to design your database schema from the start to include this feature, it often is not enabled.\n\n**References**\n\n1. [https://cloud.google.com/sql/docs/sqlserver/flags](https://cloud.google.com/sql/docs/sqlserver/flags)\n2. [https://docs.microsoft.com/en-us/sql/database-engine/configure-windows/cross-db-ownership-chaining-server-configuration-option?view=sql-server-ver15](https://docs.microsoft.com/en-us/sql/database-engine/configure-windows/cross-db-ownership-chaining-server-configuration-option?view=sql-server-ver15)\n\n**Additional information**\n\nWARNING: This patch modifies database flag values, which may require the instance to be restarted. Check the list of supported flags https://cloud.google.com/sql/docs/sqlserver/flags - to see if your instance will be restarted when this patch is submitted.\n\nNote: Some database flag settings can affect instance availability or stability, and remove the instance from the Cloud SQL SLA. For information about these flags, see Operational Guidelines.\n\nNote: Configuring the above flag restarts the Cloud SQL instance.",
  "isEnabled": true,
  "severity": 2
}
