{"name":"Ensure 'Enable connecting to serial ports' is not enabled for VM Instance","slug":"gcp-vm-4","body":"Interacting with a serial port is often referred to as the serial console, which is similar to using a terminal window, in that input and output is entirely in text mode and there is no graphical interface or mouse support.\n\nIf you enable the interactive serial console on an instance, clients can attempt to connect to that instance from any IP address. Therefore interactive serial console support should be disabled.\n\n**Rationale**\n\nA virtual machine instance has four virtual serial ports. Interacting with a serial port is similar to using a terminal window, in that input and output is entirely in text mode and there is no graphical interface or mouse support. The instance's operating system, BIOS, and other system-level entities often write output to the serial ports, and can accept input such as commands or answers to prompts. Typically, these system-level entities use the first serial port (port 1) and serial port 1 is often referred to as the serial console.\n\nThe interactive serial console does not support IP-based access restrictions such as IP whitelists. If you enable the interactive serial console on an instance, clients can attempt to connect to that instance from any IP address. This allows anybody to connect to that instance if they know the correct SSH key, username, project ID, zone, and instance name.\n\nTherefore interactive serial console support should be disabled.","description":"","severity":3,"remediationDescription":"**Using Console**\n\n1. Login to Google Cloud console\n2. Go to Computer Engine\n3. Go to VM instances\n4. Click on the Specific VM\n5. Click EDIT\n6. Unselect `Enable connecting to serial ports` below `Remote access` block.\n7. Click `Save`\n\n**Via CLI gcloud **\n\nUse the below command to disable\n\n```bash\ngcloud compute instances add-metadata `\u003cvmName\u003e` --zone=`\u003cregion\u003e` --metadata=serial-port-enable=false\n```\n\nOR\n\n```bash\ngcloud compute instances add-metadata `\u003cvmName\u003e` --zone=`\u003cregion\u003e` --metadata=serial-port-enable=0\n```\n\n**References**\n\n1. https://cloud.google.com/compute/docs/instances/interacting-with-serial-console?hl=en\\_US\u0026\\_ga=2.176763621.-1799987798.1507876265","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["VM"],"query":"gcp-vm-4-enable-connecting-to-serial-ports-is-not-enabled-for-vm-instance","returnPath":""}]}