{
  "name": "Ensure that corporate login credentials are used instead of Gmail accounts",
  "slug": "gcp-iam-1",
  "body": "Use corporate login credentials instead of personal accounts, such as Gmail accounts.\r\n\r\n\n### Rationale\n\nIt is recommended fully-managed corporate Google accounts be used for increased visibility, auditing, and controlling access to Cloud Platform resources. Email accounts based outside of the user's organization, such as personal accounts, should not be used for business purposes.",
  "description": "",
  "severity": 2,
  "remediationDescription": "Follow the documentation and setup corporate login accounts.\n\n### Prevention\n\nTo ensure that no email addresses outside the organization can be granted IAM permissions to its Google Cloud projects, folders or organization, turn on the Organization Policy for `Domain Restricted Sharing`. Learn more at: [https://cloud.google.com/resource-manager/docs/organization-policy/restrictingdomains](https://cloud.google.com/resource-manager/docs/organization-policy/restrictingdomains) (Page 16)\n\n### Impact\n\nThere will be increased overhead as maintaining accounts will now be required. For smaller organizations, this will not be an issue, but will balloon with size.\n\n### Default Value\n\nBy default, no email addresses outside the organization's domain have access to its Google Cloud deployments, but any user email account can be added to the IAM policy for Google Cloud Platform projects, folders, or organizations.\n\n### References\n\n1. https://cloud.google.com/docs/enterprise/best-practices-for-enterprise-organizations#use_corporate_login_credentials\n2. https://support.google.com/work/android/answer/6371476",
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "IAMUser",
        "IAMServiceAccount"
      ],
      "query": "gcp-iam-1-corporate-login-credentials-are-used-instead-of-gmail-accounts",
      "returnPath": ""
    }
  ],
  "alertForSecondaryOnly": false
}