{"name":"Ensure Kubernetes Clusters are configured with Labels","slug":"gcp-kubernetes-5","body":"A cluster label is a key-value pair that helps you organize your Google Cloud Platform resources, such as clusters. You can attach a label to each resource, then filter the resources based on their labels. Information about labels is forwarded to the billing system, so you can break down your billing charges by the label.\n\n**Rationale**\n\nConfigured Labels can be used to organize and to select subsets of objects. Labels can be attached to objects at creation time and subsequently added and modified at any time. Each object can have a set of key/value labels defined. Each Key must be unique for a given object. Labels enable users to map their own organizational structures onto system objects in a loosely coupled fashion, without requiring clients to store these mappings. Labels can also be used to apply specific security settings and 'auto configure' objects at creation.\nAudit:","description":"","severity":1,"remediationDescription":"**Using Console**\n\n1. Go to Kubernetes GCP Console by visiting\nhttps://console.cloud.google.com/kubernetes/list?\n2. Select reported Kubernetes clusters for which Master authorized networks is disabled\n3. Click on EDIT button and Set 'Master authorized networks (beta)' to Enabled\n\n**Using Command Line**\n\nTo configure Labels for an existing cluster, run the following command:\n\n```bash\ngcloud container clusters update \\[CLUSTER_NAME\\] --zone \\[COMPUTE_ZONE\\] --update-labels \\[Key\\]=\\[Value\\]\n```\n\n**Impact**\n\nAny labels you apply to your clusters propagate via a background process that runs hourly. It can take up to one hour for a label to appear on all resources associated with a given cluster.\n\n**Default Value**\n\nBy default, Labels are not configured when you create a new cluster using the gcloud command-line tool or Google Cloud Platform Console.\n\n**References**\n\n1. https://cloud.google.com/kubernetes-engine/docs/how-to/creating-managing-labels?hl=en_US\n\n**Notes**\n\nThe value of these labels is cloud provider specific and is not guaranteed to be reliable. For example, the value of kubernetes.io/hostname may be the same as the Node name in some environments and a different value in other environments.","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-5-kubernetes-clusters-are-configured-with-labels","returnPath":""}]}