{"name":"Ensure Stackdriver Logging is set to Enabled on Kubernetes Engine Clusters","slug":"gcp-kubernetes-1","body":"**Description: **\n\nStackdriver Logging is part of the Stackdriver suite of products in Google Cloud Platform. It includes storage for logs, a user interface called the Logs Viewer, and an API to manage logs programmatically. Stackdriver Logging lets you have Kubernetes Engine automatically collect, process, and store your container and system logs in a dedicated, persistent datastore. Container logs are collected from your containers. System logs are collected from the cluster's components, such as docker and kubelet. Events are logs about activity in the cluster, such as the scheduling of Pods.\n\n**Rationale**\n\nBy Enabling you will have container and system logs, Kubernetes Engine deploys a per- node logging agent that reads container logs, adds helpful metadata, and then stores them. The logging agent checks for container logs in the following sources:\n\n- Standard output and standard error logs from containerized processes\n- kubelet and container runtime logs\n- Logs for system components, such as VM startup scripts\n\nFor events, Kubernetes Engine uses a Deployment in the kube-system namespace which automatically collects events and sends them to Stackdriver Logging.\n\nStackdriver Logging is compatible with JSON and glog formats. Logs are stored for up to 30 days.","description":"","severity":2,"remediationDescription":"**Using Console**\n\n1. Go to Kubernetes GCP Console by visiting https://console.cloud.google.com/kubernetes/list?\n2. Select reported Kubernetes clusters for which logging is disabled\n3. Click on EDIT button and Set 'Stackdriver Logging' to Enabled\n\n**Using Command Line**\n\nTo enable logging for an existing cluster, run the following command:\n\n```bash\ngcloud container clusters update \\[CLUSTER_NAME\\] --zone \\[COMPUTE_ZONE\\] --logging-service logging.googleapis.com\n```\n\n**Impact**\n\nYou are charged for the accrued storage costs when you export logs to another Google Cloud Platform service, such as BigQuery. Exporting logs from Stackdriver has no Stackdriver charge.\n\n**Default Value**\n\nBy default, Stackdriver Logging is enabled when you create a new cluster using the gcloud command-line tool or Google Cloud Platform Console.\n\n**References**\n\n1. https://cloud.google.com/kubernetes-engine/docs/how-to/creating-a-container-cluster\n2. https://cloud.google.com/kubernetes-engine/docs/how-to/logging?hl=en_US\n3. https://cloud.google.com/logging/docs/basic-concepts","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-1-stackdriver-logging-is-set-to-enabled-on-kubernetes-engine-clusters","returnPath":""}]}