{"name":"Ensure that Separation of duties is enforced while assigning KMS related roles to users","slug":"gcp-iam-7","body":"It is recommended that the principle of 'Separation of Duties' is enforced while assigning KMS related roles to users.\n\n**Rationale**\n\nBuilt-in/Predefined IAM role `Cloud KMS Admin` allows user/identity to create, delete, and manage service account(s). Built-in/Predefined IAM role `Cloud KMS CryptoKey Encrypter/Decrypter` allows user/identity (with adequate privileges on concerned resources) to encrypt and decrypt data at rest using encryption key(s). Built-in/Predefined IAM role `Cloud KMS CryptoKey Encrypter` allows user/identity (with adequate privileges on concerned resources) to encrypt data at rest using encryption key(s). Built- in/Predefined IAM role `Cloud KMS CryptoKey Decrypter` allows user/identity (with adequate privileges on concerned resources) to decrypt data at rest using encryption key(s).\n\nSeparation of duties is the concept of ensuring that one individual does not have all necessary permissions to be able to complete a malicious action. In Cloud KMS, this could be an action such as using a key to access and decrypt data that that user should not normally have access to. Separation of duties is a business control typically used in larger organizations, meant to help avoid security or privacy incidents and errors. It is considered best practice.\n\nAny user(s) should not have `Cloud KMS Admin` and any of the `Cloud KMS CryptoKey Encrypter/Decrypter, Cloud KMS CryptoKey Encrypter, Cloud KMS CryptoKey Decrypter` roles assigned at a time.\n","description":"","severity":2,"remediationDescription":"**From Console**\n\n1. Go to `IAM \u0026 Admin/IAM` using https://console.cloud.google.com/iam-admin/iam\n2. For member having `Cloud KMS Admin` and any of the `Cloud KMS CryptoKeyEncrypter/Decrypter, Cloud KMS CryptoKey Encrypter, Cloud KMS CryptoKey Decrypter` roles granted/assigned, click on the `Delete Bin` icon to remove role from member.\n\nNote: Removal of a roles should be done as per the business requirement.\n\n**Impact**\n\nRemoved roles should be assigned to some other user, as per business needs.\n\n**References**\n\n1. https://cloud.google.com/kms/docs/separation-of-duties \n\n**Notes**\n\nUsers granted with Owner (roles/owner) and Editor (roles/editor) have privileges equivalent to `Cloud KMS Admin` and `Cloud KMS CryptoKey Encrypter/Decrypter`. To avoid the misuse, Owner and Editor roles should be granted to very limited users and Use of these primitive privileges should be minimal. These requirements are addressed in separate recommendations.","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["IAMUser"],"query":"gcp-iam-7-separation-of-duties-is-enforced-while-assigning-kms-related-roles-to-users","returnPath":""}]}