{"name":"Ensure Automatic node repair is enabled for Kubernetes Clusters","slug":"gcp-kubernetes-7","body":"Kubernetes Engine's node auto-repair feature helps you keep the nodes in your cluster in a healthy, running state. When enabled, Kubernetes Engine makes periodic checks on the health state of each node in your cluster. If a node fails consecutive health checks over an extended time period, Kubernetes Engine initiates a repair process for that node. If you disable node auto-repair at any time during the repair process, the in-progress repairs are not cancelled and still complete for any node currently under repair.\n\n**Rationale**\n\nKubernetes Engine uses the node's health status to determine if a node needs to be repaired. A node reporting a Ready status is considered healthy. Kubernetes Engine triggers a repair action if a node reports consecutive unhealthy status reports for a given time threshold. An unhealthy status can mean:\n\n- A node reports a NotReady status on consecutive checks over the given time threshold (approximately 10 minutes).\n- A node does not report any status at all over the given time threshold (approximately 10 minutes).\n- A node's boot disk is out of disk space for an extended time period (approximately 30 minutes).\n\nYou can enable node auto-repair on a per-node pool basis. When you create a cluster, you can enable or disable auto-repair for the cluster's default node pool. If you create additional node pools, you can enable or disable node auto-repair for those node pools, independent of the auto-repair setting for the default node pool. Kubernetes Engine generates an entry in its operation logs for any automated repair event. You can check the logs by using the gcloud container operations list command.","description":"","severity":2,"remediationDescription":"**From Console**\n\n1. Go to Kubernetes GCP Console by visiting https://console.cloud.google.com/kubernetes/list?\n2. Select reported Kubernetes clusters for which `Automatic node repair` is disabled\n3. Click on EDIT button and Set `Automatic node repair` to Enabled\n\n**Using Command line**\n\nTo enable `Automatic node repair` for an existing cluster with `node pool`, run the following command:\n\n```bash\ngcloud container node-pools update \\[POOL_NAME\\] --cluster \\[CLUSTER_NAME\\] --zone \\[COMPUTE_ZONE\\] --enable-autorepair\n```\n\nNote: Node auto-repair is only available for nodes that use Container-Optimized OS as their node image. Node auto-repair is not available on Alpha Clusters.\n\n**Impact**\n\nIf multiple nodes require repair, Kubernetes Engine might repair them in parallel. Kubernetes Engine limits number of repairs depending on the size of the cluster (bigger clusters have a higher limit) and the number of broken nodes in the cluster (limit decreases if many nodes are broken)\n\n**References**:\n\n1. https://cloud.google.com/kubernetes-engine/docs/concepts/node-auto-repair","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-7-automatic-node-repair-is-enabled-for-kubernetes-clusters","returnPath":""}]}