{"name":"Ensure oslogin is enabled for a Project","slug":"gcp-vm-3","body":"Enabling OS login binds SSH certificates to IAM users and facilitates effective SSH certificate management.\n\n**Rationale**\n\nEnabling osLogin ensures that SSH keys used to connect to instances are mapped with IAM users. Revoking access to IAM user will revoke all the SSH keys associated with that particular user. It facilitates centralized and automated SSH key pair management which is useful in handling cases like response to compromised SSH key pairs and/or revocation of external/third-party/Vendor users.","description":"","severity":2,"remediationDescription":"**Using Console**\n\n1. Go to the VM compute metadata page using https://console.cloud.google.com/compute/metadata?).\n2. Click `Edit`.\n3. Add a metadata entry where the key is `enable-oslogin` and the value is `TRUE`.\n4. Click `Save` to apply the changes.\n\n**Via CLI gcloud**\n\n```bash\ngcloud compute project-info add-metadata --metadata enable-oslogin=TRUE\n```\n\n**Impact**\n\nEnabling OS Login on project disables metadata-based SSH key configurations on all instances from a project. Disabling OS Login restores SSH keys that you have configured in project or instance meta-data.\n\n**Default Value**\nBy default, parameter` enable-oslogin` is `not set` which is equivalent to setting it to `FALSE`. \n\n**References**\n\n1. https://cloud.google.com/compute/docs/instances/managing-instance-access\n2. https://cloud.google.com/compute/docs/instances/managing-instance-\naccess#enable_oslogin\n\n**Notes**\n\n1. In order to use osLogin, instance using Custom Images must have the latest version of the Linux Guest Environment installed. The following image families do not yet support OS Login:\n```\nProject cos-cloud (Container-Optimized OS) image family cos-stable. \nAll project coreos-cloud (CoreOS) image families\nProject suse-cloud (SLES) image family sles-11\nAll Windows Server and SQL Server image families\n```\n\n2. Project enable-oslogin can be over-ridden by setting enable-oslogin parameter to an instance metadata individually.","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Project"],"query":"gcp-vm-3-oslogin-is-enabled-for-a-project","returnPath":""}]}