{
  "body": "It is recommended to use Instance-specific SSH key(s) instead of using common/shared project-wide SSH key(s) to access Instances.\n\n**Rationale**\n\nProject-wide SSH keys are stored in Compute/Project-meta-data. Project wide SSH keys can be used to login into all the instances within project. Using project-wide SSH keys eases the SSH key management but, if compromised, poses a security risk which can impact all the instances within project. It is recommended to use Instance-specific SSH keys which can limit the attack surface if the SSH keys are compromised.\n\n**Impact**\n\nUsers already having Project-wide ssh key pairs and using third party SSH clients will lose access to the impacted Instances. For Project users using gcloud or GCP Console based SSH option, no manual key creation and distribution is required and will be handled by GCE (Google Compute Engine) itself. To access Instance using third party SSH clients Instance specific SSH key pairs need to be created and distributed to the required users.",
  "name": "Ensure \"Block Project-wide SSH keys\" is enabled for VM instances",
  "slug": "gcp-vm-2",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "VM"
      ],
      "query": "gcp-vm-2-block-project-wide-ssh-keys-is-enabled-for-vm-instances",
      "returnPath": ""
    }
  ],
  "remediationDescription": "**Using Console**\n\n1. Go to the VM instances page: https://console.cloud.google.com/compute/instances\n2. Click on the name of the impacted instance\n3. Click `EDIT` in the toolbar\n4. Under `SSH Keys`, check the `Block project-wide SSH keys` checkbox\n5. Click `SAVE` at the bottom of the page\n6. Repeat the steps for every impacted instance\n\n**Using Google Cloud CLI**\n\nTo block project-wide public SSH keys, set the metadata value to TRUE:\n\n```bash\ngcloud compute instances add-metadata <instanceName> --metadata block-project-ssh-keys=TRUE \n```\n\nwhere instanceName is the name of the instance that you want to block project-wide public SSH keys for.\n\n**Default Value**\n\nBy default, `Block Project-wide SSH keys` is not enabled. \n\n**References**\n\n1. [https://cloud.google.com/compute/docs/instances/adding-removing-ssh-keys](https://cloud.google.com/compute/docs/instances/adding-removing-ssh-keys)\n2. [https://cloud.google.com/sdk/gcloud/reference/topic/formats](https://cloud.google.com/sdk/gcloud/reference/topic/formats)\n\n**Additional Information**\n\nIf OS Login is enabled, SSH keys in instance metadata are ignored, and therefore blocking project-wide SSH keys is not necessary.",
  "description": "",
  "severity": 2
}