{"name":"Ensure Automatic node upgrades is enabled on Kubernetes Engine Clusters nodes","slug":"gcp-kubernetes-8","body":"Node auto-upgrades help you keep the nodes in your cluster or node pool up to date with the latest stable version of Kubernetes. Auto-Upgrades use the same update mechanism as manual node upgrades.\n\n**Rationale**\n\nNode pools with auto-upgrades enabled are automatically scheduled for upgrades when a new stable Kubernetes version becomes available. When the upgrade is performed, the node pool is upgraded to match the current cluster master version. Some benefits of using enabling auto upgrades are:\n\n- Lower management overhead: You don't have to manually track and update to the latest version of Kubernetes.\n- Better security: Sometimes new binaries are released to fix a security issue. With auto-upgrades, Kubernetes Engine automatically ensures that security updates are applied and kept up to date.\n- Ease of use: Provides a simple way to keep your nodes up to date with the latest Kubernetes features.","description":"","severity":2,"remediationDescription":"**Using Console**\n\n1. Go to Kubernetes GCP Console by visiting\nhttps://console.cloud.google.com/kubernetes/list?\n2. Select reported Kubernetes clusters for which Automatic node upgrades is disabled\n3. Click on EDIT button and Set Automatic node upgrades to Enabled\n\n**Using Command Line**\n\nTo enable Automatic node upgrades for an existing cluster's node pool, run the following command:\n\n```bash\ngcloud container node-pools update \\[NODE_POOL\\] --cluster \\[CLUSTER_NAME\\] --zone \\[COMPUTE_ZONE\\] --enable-autoupgrade\n```\n\n**Impact**\n\nEnabling auto-upgrades does not cause your nodes to upgrade immediately. Automatic upgrades occur at regular intervals at the discretion of the Kubernetes Engine team.\n\n**Default Value**\n\nBy default, subsequent node pools do not have auto-upgrades enabled.\n\n**References**\n\n1. https://cloud.google.com/kubernetes-engine/docs/concepts/node-auto-upgrades \n\n**Notes**\n\nNode auto-upgrades is not available for Alpha Clusters or clusters running the Ubuntu node image.","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-8-automatic-node-upgrades-is-enabled-on-kubernetes-engine-clusters-nodes","returnPath":""}]}