{"name":"Ensure Kubernetes Clusters are created with limited service account Access scopes for Project access","slug":"gcp-kubernetes-18","body":"Access scopes are the legacy method of specifying permissions for your instance. Before the existence of IAM roles, access scopes were the only mechanism for granting permissions to service accounts. By default, your node service account has access scopes.\n\n**Rationale**\n\nIf you are not creating a separate service account for your nodes, you should limit the scopes of the node service account to reduce the possibility of a privilege escalation in an attack. This ensures that your default service account does not have permissions beyond those necessary to run your cluster. While the default scopes are limited, they may include scopes beyond the minimally required scopes needed to run your cluster.","description":"","severity":1,"remediationDescription":"**Using Console**\n\n1. Go to Kubernetes GCP Console by visiting\nhttps://console.cloud.google.com/kubernetes/list?\n2. Click on `CREATE CLUSTER`\n3. Choose required name/value for cluster fields\n4. Click on `More`\n5. Under `Access scopes` select `Set access for each API` and choose minimal API access as you desired\n6. Click on `Create`\n\n**Using Command Line**\n\nTo create a cluster with least privileged/Custom Access scopes:, run the following command:\n\n```bash\ngcloud container clusters create \\[CLUSTER_NAME\\] --zone \\[COMPUTE_ZONE\\] --scopes=\\[CUSTOM_SCOPES\\]\n```\n\nNOTE: The default scopes for the nodes in Kubernetes Engine are devstorage.read_only, logging.write, monitoring, service.management.readonly, servicecontrol, and trace.append. When setting scopes, these are specified as gke-default. If you are accessing private images in Google Container Registry, the minimally required scopes are only logging.write, monitoring, and devstorage.read_only.\n\n**Default Value**\n\nBy default, 'Allow default access' is chosen under Access scopes when you create a new cluster.\n\n**References**\n\n1. https://cloud.google.com/compute/docs/access/service-accounts?hl=en_US#the_default_service_account\n","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-18-kubernetes-clusters-are-created-with-limited-service-account-access-scopes-for-project-access","returnPath":""}]}