{"name":"Ensure user-managed/external keys for service accounts are rotated every 90 days or less","slug":"gcp-iam-5","body":"Service Account keys consist of a key ID (Private_key_Id) and Private key, which are used to sign programmatic requests that you make to Google cloud services accessible to that particular Service account. It is recommended that all Service Account keys are regularly rotated.\n\n**Rationale**\n\nRotating Service Account keys will reduce the window of opportunity for an access key that is associated with a compromised or terminated account to be used. Service Account keys should be rotated to ensure that data cannot be accessed with an old key which might have been lost, cracked, or stolen.\n\nEach service account is associated with a key pair, which is managed by Google Cloud Platform (GCP). It is used for service-to-service authentication within GCP. Google rotates the keys daily.\n\nGCP provides option to create one or more user-managed (also called as external key pairs) key pairs for use from outside GCP (for example, for use with Application Default Credentials). When a new key pair is created, user is enforced download the private key (which is not retained by Google). With external keys, users are responsible for security of the private key and other management operations such as key rotation. External keys can be managed by the IAM API, gcloud command-line tool, or the Service Accounts page in the Google Cloud Platform Console. GCP facilitates up to 10 external service account keys per service account to facilitate key rotation.\n","description":"","severity":2,"remediationDescription":"**From Console**\n\n**Delete external (user managed) Service Account Key older than 90 days**\n\n1. Go to `APIs \u0026 Services\\Credentials` using https://console.cloud.google.com/apis/credentials\n2. In Section `Service Account Keys`, for every external (user managed) Service account key with `creation date` is more than or equal to past 90 days click `Delete Bin Icon` to `Delete Service Account key`\n\n**Create New external (user managed) Service Account Key for a Service Account**\n\n1. Go to `APIs \u0026 Services\\Credentials` using https://console.cloud.google.com/apis/credentials\n2. Click `Create Credentials` and `Select Service Account Key`\n3. Choose Service account in drop-down list for which External (user managed)\nService Account key needs to be created\n4. Select desired key type format among `JSON` or `P12`\n5. Click `Create`. It will download `private key`. Keep it safe.\n6. Click `Close` if prompted\n7. It will redirect to `APIs \u0026 Services\\Credentials` page. Make a note of New `ID`\ndisplayed in section `Service account keys`\n\n**Impact**\n\nRotating service account key will break communication for depending applications. Dependent applications needs to configured manually with new key `id` displayed in section `Service account` keys and `private key` downloaded by user.\n\n**Default Value**\n\nGCP does not provides automation option for External (user managed) Service key rotation.\n\nReferences:\n\n1. https://cloud.google.com/iam/docs/understanding-service-accounts#managing_service_account_keys\n2. https://cloud.google.com/sdk/gcloud/reference/iam/service-accounts/keys/list \n3. https://cloud.google.com/iam/docs/service-accounts\n\n**Notes**\n\nFor user-managed Service Account key(s), key management is entirely users responsibility.","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["IAMServiceAccountKey"],"query":"gcp-iam-5-user-managedexternal-keys-for-service-accounts-are-rotated-every-90-days-or-less","returnPath":""}]}