{"name":"Ensure Kubernetes Cluster is created with Private cluster enabled","slug":"gcp-kubernetes-15","body":"A private cluster is a cluster that makes your master inaccessible from the public internet. In a private cluster, nodes do not have public IP addresses, so your workloads run in an environment that is isolated from the internet. Nodes have addressed only in the private RFC 1918 address space. Nodes and masters communicate with each other privately using VPC peering.\n\n**Rationale**\n\nWith a Private cluster enabled, VPC network peering gives you several advantages over using external IP addresses or VPNs to connect networks, including:\n\n- Network Latency: Public IP networking suffers higher latency than private networking.\n- Network Security: Service owners do not need to have their services exposed to the public Internet and deal with its associated risks.\n- Network Cost: GCP charges egress bandwidth pricing for networks using external IPs to communicate even if the traffic is within the same zone. If however, the networks are peered they can use internal IPs to communicate and save on those egress costs. Regular network pricing still applies to all traffic.","description":"","severity":2,"remediationDescription":"**Using Console**\n\n1. Go to Kubernetes GCP Console by visiting\nhttps://console.cloud.google.com/kubernetes/list?\n2. Click on `CREATE CLUSTER`\n3. Choose required name/value for cluster fields\n4. Click on `More`\n5. From the `Private cluster` drop-down menu, select `Enabled`\n6. Verify that `VPC native (alias IP)` is set to `Enabled`\n7. Set `Master IP range` to as per your required IP range\n8. Click on `Create`\n\n**Using Command Line**\n\nTo create cluster with Private cluster enabled, run the following command:\n\n```bash\ngcloud beta container clusters create \\[CLUSTER_NAME\\] --zone \\[COMPUTE_ZONE\\] --private-cluster --master-ipv4-cidr 172.16.0.16/28 --enable-ip-alias --create-subnetwork \"\"\n```\n\nNOTE: When you create a private cluster, you must specify a /28 CIDR range for the VMs that run the Kubernetes master components. You also need to enable Alias IPs. The range you specify for the masters must not overlap with any subnet in your cluster's VPC.\n\n**Default Value**\n\nBy default, Private cluster is disabled when you create a new cluster.\n\n**References**\n\n1. https://cloud.google.com/kubernetes-engine/docs/how-to/private-clusters \n\n**Notes**\n\nThis is a Beta release of private clusters. This feature is not covered by any SLA or deprecation policy and might be subject to backward-incompatible changes.","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-15-kubernetes-cluster-is-created-with-private-cluster-enabled","returnPath":""}]}