{
  "name": "Ensure Cloud Audit Logging is configured properly across all services and all users from a project",
  "slug": "gcp-logging-1",
  "body": "It is recommended that Cloud Audit Logging is configured to track all Admin activities and read, write access to user data.\n\n**Rationale**\n\nCloud Audit Logging maintains two audit logs for each project and organization: Admin Activity and Data Access.\n\n1. Admin Activity logs contain log entries for API calls or other administrative actions that modify the configuration or metadata of resources. Admin Activity audit logs are enabled for all services and cannot be configured.\n2. Data Access audit logs record API calls that create, modify, or read user-provided data. These are disabled by default and should be enabled.\n\nThere are three kinds of Data Access audit log information:\n- Admin read: Records operations that read metadata or configuration information. Admin Activity audit logs record writes of metadata and configuration information which cannot be disabled.\n- Data read: Records operations that read user-provided data.\n- Data write: Records operations that write user-provided data.\n\nIt is recommended to have effective default audit config configured in such a way that:\n\n1. logtype is set to DATA_READ (to logs user activity tracking) and DATA_WRITES (to log changes/tampering to user data)\n2. audit config is enabled for all the services supported by Data Access audit logs feature\n3. Logs should be captured for all users. i.e. there are no exempted users in any of the audit config section. This will ensure overriding audit config will not contradict the requirement.",
  "description": "",
  "severity": 1,
  "remediationDescription": "**Using Command Line**\n\n1. To Read project's IAM policy and store it in a file run a command:\n\n```bash\ngcloud projects get-iam-policy \\[PROJECT_ID\\] \u003e /tmp/policy.yaml\n```\n\n2. Edit policy in /tmp/policy.yaml, adding or changing only the audit logs configuration to:\n\n```yaml\nauditConfigs:\n- auditLogConfigs:\n  - logType: DATA_WRITE\n  - logType: DATA_READ\n  service: allServices\n```\n\n**Note**: `exemptedMembers`: is not set as audit logging should be enabled for all the users \n\n3. To write new IAM policy run command:\n\n```bash\ngcloud projects set-iam-policy \\[PROJECT_ID\\] /tmp/policy.yaml\n```\n\nIf the preceding command reports a conflict with another change, then repeat these steps, starting with the first step.\n\n**Impact**\n\nThere is no charge for Admin Activity audit logs. Enabling the Data Access audit logs might result in your project being charged for the additional logs usage.\n\n**Default Value**\n\nAdmin Activity logs are always enabled. They cannot be disabled. Data Access audit logs are disabled by default because they can be quite large.\n\n**References**\n\n1. https://cloud.google.com/logging/docs/audit/\n2.https://cloud.google.com/logging/docs/audit/https://cloud.google.com/logging/docs/audit/configure-data-access\n\n**Notes**\n\n- Log type `DATA_READ` is equally important to that of `DATA_WRITE` to track detailed user activities.\n- BigQuery Data Access logs are handled differently from other Data Access logs. BigQuery logs are enabled by default and cannot be disabled. They do not count against logs allotment and cannot result in extra logs charges.",
  "rules": [
    {
      "cloudProviders": ["gcp"],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": ["Connector"],
      "query": "gcp-logging-1-cloud-audit-logging-is-configured-properly-across-all-services-and-all-users-from-a-project",
      "returnPath": ""
    }
  ]
}
