{
  "alertForSecondaryOnly": false,
  "name": "Ensure KMS encryption keys are rotated within a period of 90 days",
  "slug": "gcp-kms-keys-rotated-90-days",
  "severity": 2,
  "body": "Google Cloud Key Management Service stores cryptographic keys in a hierarchical structure designed for useful and elegant access control management.\n\nThe format for the rotation schedule depends on the client library that is used. For the gcloud command-line tool, the next rotation time must be in ISO or RFC3339 format, and the rotation period must be in the form INTEGER[UNIT], where units can be one of seconds (s), minutes (m), hours (h) or days (d).\n\n**Rationale**\n\nSet a key rotation period and starting time. A key can be created with a specified rotation period, which is the time between when new key versions are generated automatically. A key can also be created with a specified next rotation time. A key is a named object representing a cryptographic key used for a specific purpose. The key material, the actual bits used for encryption, can change over time as new key versions are created.\n\nA key is used to protect some corpus of data. A collection of files could be encrypted with the same key and people with decrypt permissions on that key would be able to decrypt those files. Therefore, it's necessary to make sure the rotation period is set to a specific time\n\n**Impact**\n\nAfter a successful key rotation, the older key version is required in order to decrypt the data encrypted by that previous key version.",
  "remediationDescription": "**From Google Cloud Console**\n\n1. Go to Cryptographic Keys by visiting: https://console.cloud.google.com/security/kms.\n2. Click on the specific key ring\n3. From the list of keys, choose the specific key and click on the right side, on the 3 dots.\n4. Click on `Edit rotation period`.\n5. On the pop-up window, select a new rotation period in days which should be less than 90 and then choose the `Starting on` date (date from which the rotation period begins).\n\n**Using Google Cloud CLI**\n\nUpdate and schedule rotation for each key:\n\n```bash\ngcloud kms keys update new --keyring=<keyRing> --location=<location> --nextrotation-time=<nextRotationTime> --rotation-period=<rotationPeriod>\n```\n\n**Default value**\n\nBy default, KMS encryption keys are rotated every 90 days.\n\n**References**\n\n1. [https://cloud.google.com/kms/docs/key-rotation#frequency_of_key_rotation](https://cloud.google.com/kms/docs/key-rotation#frequency_of_key_rotation)\n2. [https://cloud.google.com/kms/docs/re-encrypt-data](https://cloud.google.com/kms/docs/re-encrypt-data)\n\n**Additional information**\n\nKey rotation does NOT re-encrypt already encrypted data with the newly generated key version. If you suspect unauthorized use of a key, you should reencrypt the data protected by that key and then disable or schedule destruction of the prior key version.\n\nIt is not recommended to rely solely on irregular rotation, but rather to use irregular rotation if needed in conjunction with a regular rotation schedule.",
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "KMSKey"
      ],
      "query": "gcp-1-1-0-iam-10-kms-encryption-keys-are-rotated-within-a-period-of-90-days"
    }
  ]
}