{
  "alertForSecondaryOnly": false,
  "slug": "gcp-rsasha1-ksk-cloud-dns",
  "name": "Ensure RSASHA1 is not used for the key-signing key in Cloud DNS DNSSEC",
  "body": "NOTE: Currently, the SHA1 algorithm has been removed from general use by Google, and, if being used, needs to be whitelisted on a project basis by Google and will also, therefore, require a Google Cloud support contract. \n\nDNSSEC algorithm numbers in this registry may be used in CERT RRs. Zone signing (DNSSEC) and transaction security mechanisms (SIG(0) and TSIG) make use of particular subsets of these algorithms. The algorithm used for key signing should be a recommended one and it should be strong.\n\n**Rationale**\n\nDomain Name System Security Extensions (DNSSEC) algorithm numbers in this registry may be used in CERT RRs. Zone signing (DNSSEC) and transaction security mechanisms (SIG(0) and TSIG) make use of particular subsets of these algorithms. \n\nThe algorithm used for key signing should be a recommended one and it should be strong. When enabling DNSSEC for a managed zone, or creating a managed zone with DNSSEC, the user can select the DNSSEC signing algorithms and the denial-ofexistence type. Changing the DNSSEC settings is only effective for a managed zone if DNSSEC is not already enabled. If there is a need to change the settings for a managed zone where it has been enabled, turn DNSSEC off and then re-enable it with different settings.\n",
  "severity": 2,
  "remediationDescription": "**Using Google Cloud CLI**\n\n1. If it is necessary to change the settings for a managed zone where it has been enabled, NSSEC must be turned off and re-enabled with different settings. To turn off DNSSEC, run the following command:\n\n```bash\ngcloud dns managed-zones update <zoneName> --dnssec-state off\n```\n\n2. To update key-signing for a reported managed DNS Zone, run the following command:\n\n```bash\ngcloud dns managed-zones update <zoneName> --dnssec-state on --ksk-algorithm <KSKAlgorithm> --ksk-key-length <KSKLength> --zsk-algorithm <ZSKAlgorithm> --zsk-key-length <ZSKKeyLength> --denial-of-existence <denialOfExistence>\n```\n\n**References**\n\n1. [https://cloudplatform.googleblog.com/2017/11/DNSSEC-now-available-in-Cloud-DNS.html](https://cloudplatform.googleblog.com/2017/11/DNSSEC-now-available-in-Cloud-DNS.html)\n2. [https://cloud.google.com/dns/dnssec-config#enabling](https://cloud.google.com/dns/dnssec-config#enabling)\n3. [https://cloud.google.com/dns/dnssec](https://cloud.google.com/dns/dnssec)\n\n**Additional Information**\n\n1. RSASHA1 key-signing support may be required for compatibility reasons.\n2. Remediation CLI works well with gcloud-cli version 221.0.0 and later.",
  "rules": [
    {
      "cloudProviders": [
        "gcp"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "ManagedZone"
      ],
      "query": "gcp-1-1-0-networking-4-rsasha1-is-not-used-for-the-key-signing-key-in-cloud-dns-dnssec"
    }
  ]
}