{"name":"Ensure Network policy is enabled on Kubernetes Engine Clusters","slug":"gcp-kubernetes-11","body":"A network policy is a specification of how groups of pods are allowed to communicate with each other and other network endpoints. NetworkPolicy resources use labels to select pods and define rules which specify what traffic is allowed to the selected pods. The Kubernetes Network Policy API allows the cluster administrator to specify what pods are allowed to communicate with each other.\n\n**Rationale**\n\nBy default, pods are non-isolated; they accept traffic from any source. Pods become isolated by having a NetworkPolicy that selects them. Once there is any NetworkPolicy in a namespace selecting a particular pod, that pod will reject any connections that are not allowed by any NetworkPolicy. (Other pods in the namespace that are not selected by any NetworkPolicy will continue to accept all traffic.)","description":"","severity":2,"remediationDescription":"**Using Console**\n\n1. Go to Kubernetes GCP Console by visiting\nhttps://console.cloud.google.com/kubernetes/list?\n2. Select Kubernetes clusters for which Network policy is disabled\n3. Click on EDIT button and Set Network policy for master and Network policy for\nnodes to Enabled under Cluster section\n\n**Using Command Line**\n\nTo enable Network policy for an existing cluster, run the following command:\n\n```bash\ngcloud container clusters update \\[CLUSTER_NAME\\] --zone \\[COMPUTE_ZONE\\] -- enable-network-policy\n```\n\n**Impact**\n\nEnabling/Disabling Network Policy causes a rolling update of all cluster nodes, similar to performing a cluster upgrade. This operation is long-running and will block other operations on the cluster (including delete) until it has run to completion.\n\n**Default Value**\n\nBy default, Network Policy is disabled when you create a new cluster.\n\n**References**\n\n1. https://kubernetes.io/docs/concepts/services-networking/network-policies/#the- networkpolicy-resource\n2. https://kubernetes.io/docs/reference/generated/kubernetes- api/v1.10/#networkpolicy-v1-networking\n\n**Notes**\n\nGoogle Kubernetes Engine has partnered with Tigera to provide Project Calico to enforce network policies within your cluster. So all above remediation works well only with the same.","rules":[{"cloudProviders":["gcp"],"comparator":"eq","expectedResult":"[]","subjects":["Cluster"],"query":"gcp-kubernetes-11-network-policy-is-enabled-on-kubernetes-engine-clusters","returnPath":""}]}