{
  "body": "\nThe default service account should not be used to ensure that rights granted to\napplications can be more easily audited and reviewed.\n\n**Rationale**\n\nKubernetes provides a default service account which is used by cluster workloads\nwhere no specific service account is assigned to the pod.\n\nWhere access to the Kubernetes API from a pod is required, a specific service account should be created for that pod, and rights granted to that service account.\n\nThe default service account should be configured such that it does not provide a service account token and does not have any explicit rights assignments.\n\n**Impact**\n\nAll workloads which require access to the Kubernetes API will require an explicit service account to be created.\n\n**Audit**\n\nFor each namespace in the cluster, review the rights assigned to the default service account and ensure that it has no roles or cluster roles bound to it apart from the\ndefaults.\n\nAdditionally ensure that the `automountServiceAccountToken: false` setting is in place for each default service account.",
  "name": "Ensure that default service accounts are not actively used",
  "slug": "k8s-service-account-default",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": [
        "k8s"
      ],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": [
        "ServiceAccount"
      ],
      "query": "query-k8s-rbac-default-service-accounts"
    }
  ],
  "remediationDescription": "Create explicit service accounts wherever a Kubernetes workload requires specific\naccess to the Kubernetes API server.\n\nModify the configuration of each default service account to include this value\n```bash\nautomountServiceAccountToken: false\n```\n\n**Default Value**\n\nBy default the default service account allows for its service account token to be\nmounted in pods in its namespace.\n\n\n**References**\n1.  [https://kubernetes.io/docs/tasks/configure-pod-container/configure-service-account/](https://kubernetes.io/docs/tasks/configure-pod-container/configure-service-account/)",
  "isEnabled": true,
  "severity": 1
}