{
  "body": "Multi-factor authentication (MFA) is an important tool in protecting corporate resources. MFA, also called 2-step verification (2SV), requires users to verify their identity through something they know (such as a password) plus something they have (such as a physical key or access code).\n",
  "name": "Users Should Have Multi-Factor Authentication (MFA/2SV)",
  "slug": "users-without-mfa",
  "isInsight": false,
  "alertForSecondaryOnly": false,
  "rules": [
    {
      "cloudProviders": ["aws"],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": ["IAMUser"],
      "query": "aws-iam-2-multi-factor-authentication-mfa-is-enabled-for-all-iam-users-that-have-a-console-password"
    },
    {
      "cloudProviders": ["gcp"],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": ["IAMUser"],
      "query": "gcp-iam-users-no-mfa"
    },
    {
      "cloudProviders": ["azure"],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": ["User"],
      "query": "azure-users-without-mfa"
    },
    {
      "cloudProviders": ["alibaba"],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": ["IAMUser"],
      "query": "cis-alibaba-1-0-0-iam-4-multi-factor-authentication-is-enabled-for-all-ram-users-that-have-a-console-password"
    },
    {
      "cloudProviders": ["entra"],
      "comparator": "eq",
      "expectedResult": "[]",
      "subjects": ["User"],
      "query": "entra-users-without-mfa"
    }
  ],
  "remediationDescription": "Make sure these users have MFA activated. Depending on the provider and the service you use, check out the following resources:\n\n## AWS\n\nPerform the following to enable MFA:\n\n1. Sign in to the AWS Management Console and open the IAM console at https://console.aws.amazon.com/iam/.\n2. In the navigation pane, choose Users.\n3. In the User Name list, choose the name of the intended MFA user.\n4. Choose the Security Credentials tab, and then choose Manage MFA Device.\n5. In the Manage MFA Device wizard, choose A virtual MFA device, and then choose\nNext Step.\n\nIAM generates and displays configuration information for the virtual MFA device, including a QR code graphic. The graphic is a representation of the 'secret configuration key' that is available for manual entry on devices that do not support QR codes.\n\n6. Open your virtual MFA application. (For a list of apps that you can use for hosting virtual MFA devices, see [Virtual MFA Applications](http://aws.amazon.com/iam/details/mfa/#Virtual_MFA_Applications).) If the virtual MFA application supports multiple accounts (multiple virtual MFA devices), choose the option to create a new account (a new virtual MFA device).\n7. Determine whether the MFA app supports QR codes, and then do one of the following:\n\n- Use the app to scan the QR code. For example, you might choose the camera icon or choose an option similar to Scan code, and then use the device's camera to scan the code.\n- In the Manage MFA Device wizard, choose Show secret key for manual configuration, and then type the secret configuration key into your MFA application.\n\nWhen you are finished, the virtual MFA device starts generating one-time passwords.\n8. In the Manage MFA Device wizard, in the Authentication Code 1 box, type the one-time password that currently appears in the virtual MFA device. Wait up to 30 seconds for the device to generate a new one-time password. Then type the second one-time password into the Authentication Code 2 box. Choose Active Virtual MFA.\n\n### Forced IAM User Self-Service Remediation\n\nAmazon has published a pattern that forces users to self-service setup MFA before they have access to their complete permissions set. Until they complete this step, they cannot access their full permissions. This pattern can be used on new AWS accounts. It can also be used on existing accounts - it is recommended users are given instructions and a grace period to accomplish MFA enrollment before active enforcement on existing AWS accounts.\n\n[How to Delegate Management of Multi-Factor Authentication to AWS IAM Users](http://blogs.aws.amazon.com/security/post/Tx2SJJYE082KBUK/How-to-Delegate-Management-of-Multi-Factor-Authentication-to-AWS-IAM-Users)\n\n### References:\n\n1. http://tools.ietf.org/html/rfc6238\n2. http://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_mfa.html\n3. CCE-78901-6\n4. CIS CSC v6.0 #5.6, #11.4, #12.6, #16.11\n\n---\n\n## Azure\n\nFollow [Microsoft Azure documentation](https://learn.microsoft.com/en-us/entra/identity/authentication/tutorial-enable-azure-mfa) and enable multi-factor authentication in your environment.\n\nEnabling and configuring MFA is a multi-step process. Here are some additional resources on the process within Microsoft Entra ID:\n\n- [Common Conditional Access policy: Require MFA for administrators](https://learn.microsoft.com/en-us/entra/identity/conditional-access/howto-conditional-access-policy-admin-mfa)\n- [Plan a Microsoft Entra multifactor authentication deployment](https://learn.microsoft.com/en-us/entra/identity/authentication/howto-mfa-getstarted#enable-multi-factor-authentication-with-conditional-access)\n- [Configure Microsoft Entra multifactor authentication settings](https://learn.microsoft.com/en-us/entra/identity/authentication/howto-mfa-mfasettings)\n\n---\n\n## Google Cloud\n\nMFA, or 2-step verification (2SV) as presented by Google, can only be enabled by each user individually. You and your users play important roles in setting up 2-Step Verification (2SV). Your users can choose their 2SV method, or you can enforce a method for certain users or groups in your organization. For example, you can require a small team in Sales to use security keys.\n\n#### Step 1: Notify users of 2-Step Verification deployment\n\nBefore deploying 2SV, communicate your company's plans to your users, including:\n\n- What 2SV is and why your company is using it.\n- Whether 2SV is optional or required.\n- If required, give the date by which users must turn on 2SV.\n- Which 2SV method is required or recommended.\n\n#### Step 2: Allow users to turn on 2-Step Verification\n\n_User accounts created before December 2016 have 2SV on by default._\n\nLet users turn on 2SV and use any verification method.\n\n1. In your Admin Console, go to [Security > Authentication > 2-step verification](https://admin.google.com/ac/security/2sv).\n2. To apply the setting to everyone, leave the top organizational unit selected. Otherwise, select a child organizational unit or a configuration group.\n3. Check the **Allow users to turn on 2-Step Verification** box.\n4. Select **Enforcement** > **Off**.\n5. Click **Save**. If you configured an organizational unit or group, you might be able to either Inherit or Override a parent organizational unit, or Unset a group.\n\n#### Step 3: Enforce 2-Step Verification (Optional)\n\n**Before you begin**: Make sure users are enrolled in 2SV.\n\n1. In your Admin Console, go to [Security > Authentication > 2-step verification](https://admin.google.com/ac/security/2sv).\n2. For **Enforcement**, choose an option:\n\n- **On** - Starts immediately.\n- **Turn on enforcement from date** - Select the start date. Users see reminders to enroll in 2SV when they sign in. When using the On from date option, enforcement will start within 24-48 hours of the chosen date. If you want a precise enforcement start time, use the On option.\n\n3. (Optional) To give new employees time to enroll before enforcement applies to their accounts, for New user enrollment period, select a timeframe from 1 day to 6 months.\nDuring this period, users can sign in with just their passwords.\n4. (Optional) To let users avoid repeated 2SV checks on trusted devices, under Frequency, check the Allow user to trust the device box.\nThe first time a user signs in from a new device, they can check a box to trust their device. Then the user isn't prompted for 2SV on the device unless the user clears their cookies or revokes the device or you reset the user's sign-in cookie.\n\n### References\n\n- [Google Workspace Help - Deploy 2-Step Verification](https://apps.google.com/supportwidget/articlehome?hl=en&article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F9176657%3Fhl%3Den&assistant_id=generic-unu&product_context=9176657&product_name=UnuFlow&trigger_context=a)\n\n---\n\n## Alibaba\n\n### Via the management console\n\n1. Login to the [`RAM Console`](https://ram.console.aliyun.com/overview)\n2. Under `Identities`, choose `Users`\n3. In the `User Logon Name/Display Name` column, click the username of each RAM user\n4. In the `Console Logon Management` section, click `Modify Logon Settings`\n5. Select `Enabled for Console Password Logon`, and `Required for Enable MFA`\n\nNote: After you select Enabled for Console Password Logon, and Required for Enable MFA when modifying the logon settings of a RAM user, the user can go to step 7 when logging on to the RAM console for the first time.\n\n6. In the MFA Device section, click `Enable the device`\n7. Download and install Google Authenticator on your mobile phone\n\n- For iOS: Install Google Authenticator from the App Store.\n- For Android: Install Google Authenticator from the Google Play Store.\n\nNote: You need to install a QR code scanner from the Google Play Store for Google Authenticator to identify QR codes.\n\n8. Open Google Authenticator and tap `BEGIN SETUP`\n\n- Tap Scan barcode and scan the QR code displayed on the `Scan the code` tab in the console.\n- Tap `Manual entry`, enter the username and key, and then tap the check mark (√) icon.\n\nNote: You can obtain the username and key from the `Retrieval manually enter information` tab in the console.\n\n9. On the `Scan the code` tab, enter the two consecutive security codes obtained from Google Authenticator and click `Enable`.\n\nNote: The security code is refreshed at an interval of 30 seconds. For more information, see `Enable an MFA device for a RAM user`.\n\n---\n\n## Okta\n\nDepending on your security requirements, you might want to enforce MFA at the organization level requiring users to authenticate using multiple factors when accessing the Okta Dashboard, at the application level requiring users to go through MFA when accessing a certain application, or both. You can read more in the [Okta documentation](https://help.okta.com/en/prod/Content/Topics/Security/mfa/mfa-home.htm).\n",
  "isEnabled": true,
  "description": "Users Without MFA",
  "severity": 2,
  "replacementFor": [
    "aws-iam-2",
    "gcp-mfa",
    "okta-mfa",
    "cis-alibaba-1-0-0-iam-4"
  ]
}
